# 实习三
成员：梁昱桐 吴墨笛 袁梦

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql

In [2]:
%%sql 

mysql://stu2100013117:stu2100013117@162.105.146.37:43306
show databases;
use stu2100013117;
show tables;

4 rows affected.
0 rows affected.
2 rows affected.

[('family',), ('person',)]

In [3]:
import pymysql

conn = pymysql.connect(host='162.105.146.37', port=43306, user='stu2100013117', passwd='stu2100013117', db='stu2100013117')
cursor = conn.cursor()

try:
    # 禁用外键约束
    cursor.execute("SET FOREIGN_KEY_CHECKS=0;")

    # 获取所有表的名称
    cursor.execute("SHOW TABLES")
    tables = cursor.fetchall()

    # 遍历所有表，对每一个表执行清空操作
    for table_name in tables:
        sql = f"TRUNCATE TABLE {table_name[0]}"
        cursor.execute(sql)

    # 重新启用外键约束
    cursor.execute("SET FOREIGN_KEY_CHECKS=1;")

    conn.commit()
    print("所有表的数据已清空。")
except Exception as e:
    print(f"错误：{e}")
    conn.rollback()
finally:
    cursor.close()
    conn.close()

所有表的数据已清空。

## 一.递归查询

In [4]:
%%sql
-- 删除已存在的表
set foreign_key_checks = 0;
drop table if exists family;
set foreign_key_checks = 1;

-- 创建新的表
create table family (
   father char(10), 
   son char(10) 
);
insert into family(father, son) values
('司马防','司马懿'),
('司马防','司马孚'),
('司马防','司马馗'),
('司马懿','司马师'),
('司马懿','司马昭'),
('司马懿','司马亮'),
('司马懿','司马伦'),
('司马孚','司马瑰'),
('司马馗','司马泰'),
('司马师','司马攸'),
('司马昭','司马炎'),
('司马泰','司马越'),
('司马攸','司马囧'),
('司马炎','司马衷'),
('司马炎','司马玮'),
('司马炎','司马乂'),
('司马炎','司马颖'),
('司马炎','司马炽')

 * mysql://stu2100013117:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
18 rows affected.

[]

找出兄弟关系

In [5]:
%%sql

select distinct 
    f1.son as Brother1,  
    f2.son as Brother2  
from 
    family f1  
join
    family f2 on f1.father = f2.father  
where 
    f1.son < f2.son;

 * mysql://stu2100013117:***@162.105.146.37:43306
19 rows affected.

[('司马孚', '司马懿'),
 ('司马孚', '司马馗'),
 ('司马懿', '司马馗'),
 ('司马伦', '司马师'),
 ('司马亮', '司马师'),
 ('司马伦', '司马昭'),
 ('司马亮', '司马昭'),
 ('司马师', '司马昭'),
 ('司马亮', '司马伦'),
 ('司马炽', '司马衷'),
 ('司马乂', '司马衷'),
 ('司马玮', '司马衷'),
 ('司马炽', '司马玮'),
 ('司马乂', '司马玮'),
 ('司马炽', '司马颖'),
 ('司马乂', '司马颖'),
 ('司马玮', '司马颖'),
 ('司马衷', '司马颖'),
 ('司马乂', '司马炽')]

使用递归查询找出所有祖先关系

In [6]:
%%sql

with recursive Ancestors as (  
    select father, son  
    from family  
    union all 
    select a.father, f.son  
    from Ancestors a  
    join family f on a.son = f.father  
)  
select distinct  
    father as Ancestor,  
    son as Descendant  
from  
    Ancestors;

 * mysql://stu2100013117:***@162.105.146.37:43306
48 rows affected.

[('司马防', '司马懿'),
 ('司马防', '司马孚'),
 ('司马防', '司马馗'),
 ('司马懿', '司马师'),
 ('司马懿', '司马昭'),
 ('司马懿', '司马亮'),
 ('司马懿', '司马伦'),
 ('司马孚', '司马瑰'),
 ('司马馗', '司马泰'),
 ('司马师', '司马攸'),
 ('司马昭', '司马炎'),
 ('司马泰', '司马越'),
 ('司马攸', '司马囧'),
 ('司马炎', '司马衷'),
 ('司马炎', '司马玮'),
 ('司马炎', '司马乂'),
 ('司马炎', '司马颖'),
 ('司马炎', '司马炽'),
 ('司马防', '司马师'),
 ('司马防', '司马昭'),
 ('司马防', '司马亮'),
 ('司马防', '司马伦'),
 ('司马防', '司马瑰'),
 ('司马防', '司马泰'),
 ('司马懿', '司马攸'),
 ('司马懿', '司马炎'),
 ('司马馗', '司马越'),
 ('司马师', '司马囧'),
 ('司马昭', '司马衷'),
 ('司马昭', '司马玮'),
 ('司马昭', '司马乂'),
 ('司马昭', '司马颖'),
 ('司马昭', '司马炽'),
 ('司马防', '司马攸'),
 ('司马防', '司马炎'),
 ('司马防', '司马越'),
 ('司马懿', '司马囧'),
 ('司马懿', '司马衷'),
 ('司马懿', '司马玮'),
 ('司马懿', '司马乂'),
 ('司马懿', '司马颖'),
 ('司马懿', '司马炽'),
 ('司马防', '司马囧'),
 ('司马防', '司马衷'),
 ('司马防', '司马玮'),
 ('司马防', '司马乂'),
 ('司马防', '司马颖'),
 ('司马防', '司马炽')]

自定义并找出'叔侄'关系

定义'叔侄'关系为：如果A是B父亲的兄弟，那么A是B的叔叔，B是A的侄子

In [7]:
%%sql

select distinct
    u.son as Uncle,  
    n.son as Nephew  
from  
    family u  
join  
    family f on u.father = f.father -- u.son和f.son是兄弟  
join 
    family n on f.son = n.father -- n.son是f.son的儿子  
where 
    u.son <> n.father -- 避免将父亲误认为是叔叔

 * mysql://stu2100013117:***@162.105.146.37:43306
18 rows affected.

[('司马孚', '司马师'),
 ('司马馗', '司马师'),
 ('司马孚', '司马昭'),
 ('司马馗', '司马昭'),
 ('司马孚', '司马亮'),
 ('司马馗', '司马亮'),
 ('司马孚', '司马伦'),
 ('司马馗', '司马伦'),
 ('司马懿', '司马瑰'),
 ('司马馗', '司马瑰'),
 ('司马懿', '司马泰'),
 ('司马孚', '司马泰'),
 ('司马昭', '司马攸'),
 ('司马亮', '司马攸'),
 ('司马伦', '司马攸'),
 ('司马师', '司马炎'),
 ('司马亮', '司马炎'),
 ('司马伦', '司马炎')]

## 二.窗口查询
基于窗口函数实现股票的量化因子

In [8]:
import pandas as pd
import numpy as np

在量化因子公式1-25中，选择公式12：
(sign(delta(volume, 1)) * (-1 * delta(close, 1)))

In [9]:
# 加载csv文件,并设置trade_date为索引
df = pd.read_csv('./csi_300.csv', parse_dates=['trade_date'])  
df.set_index('trade_date', inplace=True)
  
# 根据时间顺序排序  
df.sort_index(inplace=True)  
  
# 计算成交量变化和收盘价变化  
df['vol_delta'] = df.groupby('ts_code')['vol'].diff()  
df['close_delta'] = df.groupby('ts_code')['close'].diff()  
  
# 计算量化因子  
df['quant_factor'] = (df['vol_delta'] > 0).astype(int) * (-1 * df['close_delta'])  
  
# 去除第一行diff()产生的NaN
df = df.dropna()  
  
# 查看结果  
print(df[['ts_code', 'vol_delta', 'close_delta', 'quant_factor']])

              ts_code  vol_delta  close_delta  quant_factor
trade_date
2020-01-03  601088.SH  -275995.0        -0.03          0.00
2020-01-03  688036.SH   -20401.5        -0.69          0.00
2020-01-03  600760.SH    86129.2         0.96         -0.96
2020-01-03  601901.SH  -715350.0         0.05         -0.00
2020-01-03  601398.SH  -827360.0         0.02         -0.00
...               ...        ...          ...           ...
2023-07-05  300454.SZ   -13578.8        -1.74          0.00
2023-07-05  002459.SZ    25718.0        -1.45          1.45
2023-07-05  600010.SH  5262250.0         0.08         -0.08
2023-07-05  000333.SZ   -32430.0         0.22         -0.00
2023-07-05  688981.SH  -121398.0        -0.43          0.00

[247138 rows x 4 columns]

在量化因子公式26-50中，选择公式33：
rank((-1 * ((1 - (open / close))^1)))

In [10]:
df = pd.read_csv('./csi_300.csv', parse_dates=['trade_date'])    
df.set_index('trade_date', inplace=True)    
df.sort_index(inplace=True)
     
df['formula_result'] = -1 * ((1 - df['open'] / df['close'] ) ** 1)  
  
# 对每个ts_code分组内的formula_result进行排名  
df['quant_factor'] = df.groupby('ts_code')['formula_result'].rank(method='first', ascending=False) 
  
df = df.dropna()  

print(df[['ts_code', 'open', 'close', 'formula_result', 'quant_factor']])

              ts_code    open   close  formula_result  quant_factor
trade_date
2020-01-02  000001.SZ   16.65   16.87       -0.013041         674.0
2020-01-02  601225.SH    9.05    9.02        0.003326         353.0
2020-01-02  601229.SH    9.58    9.54        0.004193         247.0
2020-01-02  601236.SH   17.12   16.79        0.019655         126.0
2020-01-02  000895.SZ   29.36   30.27       -0.030063         784.0
...               ...     ...     ...             ...           ...
2023-07-05  300454.SZ  113.75  112.11        0.014628         264.0
2023-07-05  002459.SZ   39.69   38.20        0.039005          90.0
2023-07-05  600010.SH    1.81    1.91       -0.052356         815.0
2023-07-05  000333.SZ   59.09   59.12       -0.000507         440.0
2023-07-05  688981.SH   51.25   50.98        0.005296         280.0

[247437 rows x 5 columns]

在量化因子公式51-75中，选择公式54：
((-1 * ((low - close) * (open^5))) / ((low - high) * (close^5)))

In [11]:
df = pd.read_csv('./csi_300.csv', parse_dates=['trade_date'])    
df.set_index('trade_date', inplace=True)   
df.sort_index(inplace=True)  
  
df['denominator'] = ((df['low'] - df['high']) * (df['close']**5)).replace(0, np.nan)  # 分母部分,如果为0则替换为NaN  
df['numerator'] = -1 * ((df['low'] - df['close']) * (df['open'] ** 5))
    
df['quant_factor'] = np.where(df['denominator'].notnull(), df['numerator'] / df['denominator'], 0)  
 
print(df[['ts_code', 'low', 'high', 'open', 'close', 'quant_factor']])

              ts_code     low    high    open   close  quant_factor
trade_date
2020-01-02  000001.SZ   16.55   16.95   16.65   16.87     -0.749179
2020-01-02  601225.SH    8.98    9.15    9.05    9.02     -0.239233
2020-01-02  601229.SH    9.52    9.64    9.58    9.54     -0.170190
2020-01-02  601236.SH   16.79   17.30   17.12   16.79      0.000000
2020-01-02  000895.SZ   29.22   30.30   29.36   30.27     -0.834610
...               ...     ...     ...     ...     ...           ...
2023-07-05  300454.SZ  112.00  115.00  113.75  112.11     -0.039428
2023-07-05  002459.SZ   38.12   39.70   39.69   38.20     -0.061309
2023-07-05  600010.SH    1.81    1.92    1.81    1.91     -0.694758
2023-07-05  000333.SZ   58.42   59.33   59.09   59.12     -0.767281
2023-07-05  688981.SH   50.71   51.40   51.25   50.98     -0.401777

[247437 rows x 6 columns]

在量化因子公式76-101中，选择公式101:
((close - open) / ((high - low) + .001))

In [12]:
df = pd.read_csv('./csi_300.csv', parse_dates=['trade_date'])    
df.set_index('trade_date', inplace=True)  
df.sort_index(inplace=True)  
   
df['quant_factor'] = (df['close'] - df['open']) / ((df['high'] - df['low']) + .001)  
  
print(df[['ts_code', 'low', 'high', 'open', 'close', 'quant_factor']])

              ts_code     low    high    open   close  quant_factor
trade_date
2020-01-02  000001.SZ   16.55   16.95   16.65   16.87      0.548628
2020-01-02  601225.SH    8.98    9.15    9.05    9.02     -0.175439
2020-01-02  601229.SH    9.52    9.64    9.58    9.54     -0.330579
2020-01-02  601236.SH   16.79   17.30   17.12   16.79     -0.645793
2020-01-02  000895.SZ   29.22   30.30   29.36   30.27      0.841813
...               ...     ...     ...     ...     ...           ...
2023-07-05  300454.SZ  112.00  115.00  113.75  112.11     -0.546485
2023-07-05  002459.SZ   38.12   39.70   39.69   38.20     -0.942441
2023-07-05  600010.SH    1.81    1.92    1.81    1.91      0.900901
2023-07-05  000333.SZ   58.42   59.33   59.09   59.12      0.032931
2023-07-05  688981.SH   50.71   51.40   51.25   50.98     -0.390738

[247437 rows x 6 columns]

## 三.JSON操作

订单数据库建表：

In [23]:
%%sql
drop table if exists OrderDetails;
drop table if exists Orders;
drop table if exists Shippers;
drop table if exists Customers;
drop table if exists Products;
drop table if exists Categories;
drop table if exists Suppliers;
drop table if exists Employees;

-- Create table Employees
CREATE TABLE Employees
(
  empid           INT          NOT NULL auto_increment,
  lastname        VARCHAR(20) NOT NULL,
  firstname       VARCHAR(10) NOT NULL,
  title           VARCHAR(30) NOT NULL,
  titleofcourtesy VARCHAR(25) NOT NULL,
  birthdate       char(50)     NOT NULL,
  hiredate        char(50)     NOT NULL,
  address         VARCHAR(60) NOT NULL,
  city            VARCHAR(15) NOT NULL,
  region          VARCHAR(15) NULL,
  postalcode      VARCHAR(10) NULL,
  country         VARCHAR(15) NOT NULL,
  phone           VARCHAR(24) NOT NULL,
  mgrid           INT          NULL,
  CONSTRAINT PK_Employees PRIMARY KEY(empid),
  CONSTRAINT FK_Employees_Employees FOREIGN KEY(mgrid)
    REFERENCES Employees(empid)
);

-- Create table Production.Suppliers
CREATE TABLE Suppliers
(
  supplierid   INT          NOT NULL auto_increment,
  companyname  VARCHAR(40) NOT NULL,
  contactname  VARCHAR(30) NOT NULL,
  contacttitle VARCHAR(30) NOT NULL,
  address      VARCHAR(60) NOT NULL,
  city         VARCHAR(15) NOT NULL,
  region       VARCHAR(15) NULL,
  postalcode   VARCHAR(10) NULL,
  country      VARCHAR(15) NOT NULL,
  phone        VARCHAR(24) NOT NULL,
  fax          VARCHAR(24) NULL,
  CONSTRAINT PK_Suppliers PRIMARY KEY(supplierid)
);

-- Create table Production.Categories
CREATE TABLE Categories
(
  categoryid   INT           NOT NULL auto_increment,
  categoryname VARCHAR(15)  NOT NULL,
  description  VARCHAR(200) NOT NULL,
  CONSTRAINT PK_Categories PRIMARY KEY(categoryid)
);

-- Create table Products
CREATE TABLE Products
(
  productid    INT          NOT NULL auto_increment,
  productname  VARCHAR(40) NOT NULL,
  supplierid   INT          NOT NULL,
  categoryid   INT          NOT NULL,
  unitprice    decimal(20,6)        NOT NULL     DEFAULT(0),
  discontinued BIT          NOT NULL      DEFAULT(0),
  CONSTRAINT PK_Products PRIMARY KEY(productid),
  CONSTRAINT FK_Products_Categories FOREIGN KEY(categoryid)
    REFERENCES Categories(categoryid),
  CONSTRAINT FK_Products_Suppliers FOREIGN KEY(supplierid)
    REFERENCES Suppliers(supplierid),
  CONSTRAINT CHK_Products_unitprice CHECK(unitprice >= 0)
);

-- Create table Customers
CREATE TABLE Customers
(
  custid       INT          NOT NULL auto_increment,
  companyname  VARCHAR(40) NOT NULL,
  contactname  VARCHAR(30) NOT NULL,
  contacttitle VARCHAR(30) NOT NULL,
  address      VARCHAR(60) NOT NULL,
  city         VARCHAR(15) NOT NULL,
  region       VARCHAR(15) NULL,
  postalcode   VARCHAR(10) NULL,
  country      VARCHAR(15) NOT NULL,
  phone        VARCHAR(24) NOT NULL,
  fax          VARCHAR(24) NULL,
  CONSTRAINT PK_Customers PRIMARY KEY(custid)
);


-- Create table Sales.Shippers
CREATE TABLE Shippers
(
  shipperid   INT          NOT NULL auto_increment,
  companyname VARCHAR(40) NOT NULL,
  phone       VARCHAR(24) NOT NULL,
  CONSTRAINT PK_Shippers PRIMARY KEY(shipperid)
);

-- Create table Orders
CREATE TABLE Orders
(
  orderid        INT          NOT NULL auto_increment,
  custid         INT          NULL,
  empid          INT          NOT NULL,
  orderdate      char(50)     NOT NULL,
  requireddate   char(50)     NOT NULL,
  shippeddate    char(50)     NULL,
  shipperid      INT          NOT NULL,
  freight        decimal(20,6)        NOT NULL     DEFAULT(0),
  shipname       VARCHAR(40) NOT NULL,
  shipaddress    VARCHAR(60) NOT NULL,
  shipcity       VARCHAR(15) NOT NULL,
  shipregion     VARCHAR(15) NULL,
  shippostalcode VARCHAR(10) NULL,
  shipcountry    VARCHAR(15) NOT NULL,
  CONSTRAINT PK_Orders PRIMARY KEY(orderid),
  CONSTRAINT FK_Orders_Customers FOREIGN KEY(custid)
    REFERENCES Customers(custid),
  CONSTRAINT FK_Orders_Employees FOREIGN KEY(empid)
    REFERENCES Employees(empid),
  CONSTRAINT FK_Orders_Shippers FOREIGN KEY(shipperid)
    REFERENCES Shippers(shipperid)
);



-- Create table OrderDetails
CREATE TABLE OrderDetails
(
  orderid   INT           NOT NULL,
  productid INT           NOT NULL,
  unitprice decimal(20,6)         NOT NULL   DEFAULT(0),
  qty       SMALLINT      NOT NULL DEFAULT(1),
  discount  NUMERIC(4, 3) NOT NULL DEFAULT(0),
  CONSTRAINT PK_OrderDetails PRIMARY KEY(orderid, productid),
  CONSTRAINT FK_OrderDetails_Orders FOREIGN KEY(orderid)
    REFERENCES Orders(orderid),
  CONSTRAINT FK_OrderDetails_Products FOREIGN KEY(productid)
    REFERENCES Products(productid),
  CONSTRAINT CHK_discount  CHECK (discount BETWEEN 0 AND 1),
  CONSTRAINT CHK_qty  CHECK (qty > 0),
  CONSTRAINT CHK_unitprice CHECK (unitprice >= 0)
);

 * mysql://stu2100013117:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [24]:
%%sql
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(1, 'Davis', 'Sara', 'CEO', 'Ms.', '19581208 00:00:00.000', '20020501 00:00:00.000', '7890 - 20th Ave. E., Apt. 2A', 'Seattle', 'WA', '10003', 'USA', '(206) 555-0101', NULL);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(2, 'Funk', 'Do', 'Vice President, Sales', 'Dr.', '19620219 00:00:00.000', '20020814 00:00:00.000', '9012 W. Capital Way', 'Tacoma', 'WA', '10001', 'USA', '(206) 555-0100', 1);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(3, 'Lew', 'Judy', 'Sales Manager', 'Ms.', '19730830 00:00:00.000', '20020401 00:00:00.000', '2345 Moss Bay Blvd.', 'Kirkland', 'WA', '10007', 'USA', '(206) 555-0103', 2);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(4, 'Peled', 'Yael', 'Sales Representative', 'Mrs.', '19470919 00:00:00.000', '20030503 00:00:00.000', '5678 Old Redmond Rd.', 'Redmond', 'WA', '10009', 'USA', '(206) 555-0104', 3);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(5, 'Buck', 'Sve', 'Sales Manager', 'Mr.', '19650304 00:00:00.000', '20031017 00:00:00.000', '8901 Garrett Hill', 'Londo', NULL, '10004', 'UK', '(71) 234-5678', 2);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(6, 'Suurs', 'Paul', 'Sales Representative', 'Mr.', '19730702 00:00:00.000', '20031017 00:00:00.000', '3456 Coventry House, Miner Rd.', 'Londo', NULL, '10005', 'UK', '(71) 345-6789', 5);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(7, 'King', 'Russell', 'Sales Representative', 'Mr.', '19700529 00:00:00.000', '20040102 00:00:00.000', '6789 Edgeham Hollow, Winchester Way', 'Londo', NULL, '10002', 'UK', '(71) 123-4567', 5);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(8, 'Camero', 'Maria', 'Sales Representative', 'Ms.', '19680109 00:00:00.000', '20040305 00:00:00.000', '4567 - 11th Ave. N.E.', 'Seattle', 'WA', '10006', 'USA', '(206) 555-0102', 3);
INSERT INTO Employees(empid, lastname, firstname, title, titleofcourtesy, birthdate, hiredate, address, city, region, postalcode, country, phone, mgrid)
  VALUES(9, 'Dolgopyatova', 'Zoya', 'Sales Representative', 'Ms.', '19760127 00:00:00.000', '20041115 00:00:00.000', '1234 Houndstooth Rd.', 'Londo', NULL, '10008', 'UK', '(71) 456-7890', 5);

INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(1, 'Supplier SWRXU', 'Adolphi, Stepha', 'Purchasing Manager', '2345 Gilbert St.', 'Londo', NULL, '10023', 'UK', '(171) 456-7890', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(2, 'Supplier VHQZD', 'Hance, Jim', 'Order Administrator', 'P.O. Box 5678', 'New Orleans', 'LA', '10013', 'USA', '(100) 555-0111', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(3, 'Supplier STUAZ', 'Parovszky, Alfons', 'Sales Representative', '1234 Oxford Rd.', 'Ann Arbor', 'MI', '10026', 'USA', '(313) 555-0109', '(313) 555-0112');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(4, 'Supplier QOVFD', 'Balázs, Erzsébet', 'Marketing Manager', '7890 Sekimai Musashino-shi', 'Tokyo', NULL, '10011', 'Japa', '(03) 6789-0123', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(5, 'Supplier EQPNC', 'Holm, Michael', 'Export Administrator', 'Calle del Rosal 4567', 'Oviedo', 'Asturias', '10029', 'Spai', '(98) 123 45 67', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(6, 'Supplier QWUSF', 'Popkova, Darya', 'Marketing Representative', '8901 Setsuko Chuo-ku', 'Osaka', NULL, '10028', 'Japa', '(06) 789-0123', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(7, 'Supplier GQRCV', 'Ræbild, Jesper', 'Marketing Manager', '5678 Rose St. Moonie Ponds', 'Melbourne', 'Victoria', '10018', 'Australia', '(03) 123-4567', '(03) 456-7890');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(8, 'Supplier BWGYE', 'Iallo, Lucio', 'Sales Representative', '9012 King''s Way', 'Manchester', NULL, '10021', 'UK', '(161) 567-8901', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(9, 'Supplier QQYEU', 'Basalik, Eva', 'Sales Agent', 'Kaloadagatan 4567', 'Göteborg', NULL, '10022', 'Swede', '031-345 67 89', '031-678 90 12');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(10, 'Supplier UNAHG', 'Barnett, Dave', 'Marketing Manager', 'Av. das Americanas 2345', 'Sao Paulo', NULL, '10034', 'Brazil', '(11) 345 6789', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(11, 'Supplier ZPYVS', 'Jain, Mukesh', 'Sales Manager', 'Tiergartenstraße 3456', 'Berli', NULL, '10016', 'Germany', '(010) 3456789', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(12, 'Supplier SVIYA', 'Regev, Barak', 'International Marketing Mgr.', 'Bogenallee 9012', 'Frankfurt', NULL, '10024', 'Germany', '(069) 234567', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(13, 'Supplier TEGSC', 'Brehm, Peter', 'Coordinator Foreign Markets', 'Frahmredder 3456', 'Cuxhave', NULL, '10019', 'Germany', '(04721) 1234', '(04721) 2345');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(14, 'Supplier KEREV', 'Keil, Kendall', 'Sales Representative', 'Viale Dante, 6789', 'Ravenna', NULL, '10015', 'Italy', '(0544) 56789', '(0544) 34567');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(15, 'Supplier NZLIF', 'Sałas-Szlejter, Karolina', 'Marketing Manager', 'Hatlevegen 1234', 'Sandvika', NULL, '10025', 'Norway', '(0)9-012345', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(16, 'Supplier UHZRG', 'Scholl, Thorste', 'Regional Account Rep.', '8901 - 8th Avenue Suite 210', 'Bend', 'OR', '10035', 'USA', '(503) 555-0108', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(17, 'Supplier QZGUF', 'Kleinerman, Christia', 'Sales Representative', 'Brovallavägen 0123', 'Stockholm', NULL, '10033', 'Swede', '08-234 56 78', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(18, 'Supplier LVJUA', 'Canel, Fabrice', 'Sales Manager', '3456, Rue des Francs-Bourgeois', 'Paris', NULL, '10031', 'France', '(1) 90.12.34.56', '(1) 01.23.45.67');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(19, 'Supplier JDNUG', 'Chapman, Greg', 'Wholesale Account Agent', 'Order Processing Dept. 7890 Paul Revere Blvd.', 'Bosto', 'MA', '10027', 'USA', '(617) 555-0110', '(617) 555-0113');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(20, 'Supplier CIYNM', 'Köszegi, Emília', 'Owner', '6789 Serangoon Loop, Suite #402', 'Singapore', NULL, '10037', 'Singapore', '012-3456', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(21, 'Supplier XOXZA', 'Shakespear, Paul', 'Sales Manager', 'Lyngbysild Fiskebakken 9012', 'Lyngby', NULL, '10012', 'Denmark', '67890123', '78901234');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(22, 'Supplier FNUXM', 'Skelly, Bonnie L.', 'Accounting Manager', 'Verkoop Rijnweg 8901', 'Zaandam', NULL, '10014', 'Netherlands', '(12345) 8901', '(12345) 5678');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(23, 'Supplier ELCR', 'LaMee, Bria', 'Product Manager', 'Valtakatu 1234', 'Lappeenranta', NULL, '10032', 'Finland', '(953) 78901', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(24, 'Supplier JNNES', 'Clark, Molly', 'Sales Representative', '6789 Prince Edward Parade Hunter''s Hill', 'Sydney', 'NSW', '10030', 'Australia', '(02) 234-5678', '(02) 567-8901');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(25, 'Supplier ERVYZ', 'Sprenger, Christof', 'Marketing Manager', '7890 Rue St. Laurent', 'Montréal', 'Québec', '10017', 'Canada', '(514) 456-7890', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(26, 'Supplier ZWZDM', 'Cunha, Gonçalo', 'Order Administrator', 'Via dei Gelsomini, 5678', 'Salerno', NULL, '10020', 'Italy', '(089) 4567890', '(089) 4567890');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(27, 'Supplier ZRYDZ', 'Leoni, Alessandro', 'Sales Manager', '4567, rue H. Voiro', 'Montceau', NULL, '10036', 'France', '89.01.23.45', NULL);
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(28, 'Supplier OAVQT', 'Teper, Jeff', 'Sales Representative', 'Bat. B 2345, rue des Alpes', 'Annecy', NULL, '10010', 'France', '01.23.45.67', '89.01.23.45');
INSERT INTO Suppliers(supplierid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(29, 'Supplier OGLRK', 'Walters, Rob', 'Accounting Manager', '0123 rue Chasseur', 'Ste-Hyacinthe', 'Québec', '10009', 'Canada', '(514) 567-890', '(514) 678-9012');

INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(3, 'Confections', 'Desserts, candies, and sweet breads');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(4, 'Dairy Products', 'Cheeses');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(5, 'Grains/Cereals', 'Breads, crackers, pasta, and cereal');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(6, 'Meat/Poultry', 'Prepared meats');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(7, 'Produce', 'Dried fruit and bean curd');
INSERT INTO Categories(categoryid, categoryname, description)
  VALUES(8, 'Seafood', 'Seaweed and fish');

INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(1, 'Product HHYDP', 1, 1, 18.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(2, 'Product RECZE', 1, 1, 19.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(3, 'Product IMEHJ', 1, 2, 10.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(4, 'Product KSBRM', 2, 2, 22.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(5, 'Product EPEIM', 2, 2, 21.35, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(6, 'Product VAIIV', 3, 2, 25.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(7, 'Product HMLNI', 3, 7, 30.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(8, 'Product WVJFP', 3, 2, 40.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(9, 'Product AOZBW', 4, 6, 97.00, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(10, 'Product YHXGE', 4, 8, 31.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(11, 'Product QMVU', 5, 4, 21.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(12, 'Product OSFNS', 5, 4, 38.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(13, 'Product POXFU', 6, 8, 6.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(14, 'Product PWCJB', 6, 7, 23.25, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(15, 'Product KSZOI', 6, 2, 15.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(16, 'Product PAFRH', 7, 3, 17.45, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(17, 'Product BLCAX', 7, 6, 39.00, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(18, 'Product CKEDC', 7, 8, 62.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(19, 'Product XKXDO', 8, 3, 9.20, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(20, 'Product QHFFP', 8, 3, 81.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(21, 'Product VJZZH', 8, 3, 10.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(22, 'Product CPHFY', 9, 5, 21.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(23, 'Product JLUDZ', 9, 5, 9.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(24, 'Product QOGNU', 10, 1, 4.50, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(25, 'Product LYLNI', 11, 3, 14.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(26, 'Product HLGZA', 11, 3, 31.23, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(27, 'Product SMIOH', 11, 3, 43.90, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(28, 'Product OFBNT', 12, 7, 45.60, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(29, 'Product VJXY', 12, 6, 123.79, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(30, 'Product LYERX', 13, 8, 25.89, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(31, 'Product XWOXC', 14, 4, 12.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(32, 'Product NUNAW', 14, 4, 32.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(33, 'Product ASTM', 15, 4, 2.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(34, 'Product SWNJY', 16, 1, 14.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(35, 'Product NEVTJ', 16, 1, 18.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(36, 'Product GMKIJ', 17, 8, 19.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(37, 'Product EVFFA', 17, 8, 26.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(38, 'Product QDOMO', 18, 1, 263.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(39, 'Product LSOFL', 18, 1, 18.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(40, 'Product YZIXQ', 19, 8, 18.40, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(41, 'Product TTEEX', 19, 8, 9.65, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(42, 'Product RJVNM', 20, 5, 14.00, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(43, 'Product ZZZHR', 20, 1, 46.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(44, 'Product VJIEO', 20, 2, 19.45, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(45, 'Product AQOKR', 21, 8, 9.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(46, 'Product CBRRL', 21, 8, 12.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(47, 'Product EZZPR', 22, 3, 9.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(48, 'Product MYNX', 22, 3, 12.75, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(49, 'Product FPYP', 23, 3, 20.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(50, 'Product BIUDV', 23, 3, 16.25, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(51, 'Product APITJ', 24, 7, 53.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(52, 'Product QSRXF', 24, 5, 7.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(53, 'Product BKGEA', 24, 6, 32.80, 1);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(54, 'Product QAQRL', 25, 6, 7.45, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(55, 'Product YYWRT', 25, 6, 24.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(56, 'Product VKCMF', 26, 5, 38.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(57, 'Product OVLQI', 26, 5, 19.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(58, 'Product ACRVI', 27, 8, 13.25, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(59, 'Product UKXRI', 28, 4, 55.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(60, 'Product WHBYK', 28, 4, 34.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(61, 'Product XYZPE', 29, 2, 28.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(62, 'Product WUXYK', 29, 3, 49.30, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(63, 'Product ICKNK', 7, 2, 43.90, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(64, 'Product HCQDE', 12, 5, 33.25, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(65, 'Product XYWBZ', 2, 2, 21.05, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(66, 'Product LQMG', 2, 2, 17.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(67, 'Product XLXQF', 16, 1, 14.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(68, 'Product TBTBL', 8, 3, 12.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(69, 'Product COAXA', 15, 4, 36.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(70, 'Product TOONT', 7, 1, 15.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(71, 'Product MYMOI', 15, 4, 21.50, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(72, 'Product GEEOO', 14, 4, 34.80, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(73, 'Product WEUJZ', 17, 8, 15.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(74, 'Product BKAZJ', 4, 7, 10.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(75, 'Product BWRLG', 12, 1, 7.75, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(76, 'Product JYGFE', 23, 1, 18.00, 0);
INSERT INTO Products(productid, productname, supplierid, categoryid, unitprice, discontinued)
  VALUES(77, 'Product LUNZZ', 12, 2, 13.00, 0);

INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(1, 'Customer NRZBB', 'Allen, Michael', 'Sales Representative', 'Obere Str. 0123', 'Berli', NULL, '10092', 'Germany', '030-3456789', '030-0123456');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(2, 'Customer MLTD', 'Hassall, Mark', 'Owner', 'Avda. de la Constitución 5678', 'México D.F.', NULL, '10077', 'Mexico', '(5) 789-0123', '(5) 456-7890');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(3, 'Customer KBUDE', 'Peoples, Joh', 'Owner', 'Mataderos  7890', 'México D.F.', NULL, '10097', 'Mexico', '(5) 123-4567', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(4, 'Customer HFBZG', 'Arndt, Torste', 'Sales Representative', '7890 Hanover Sq.', 'Londo', NULL, '10046', 'UK', '(171) 456-7890', '(171) 456-7891');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(5, 'Customer HGVLZ', 'Higginbotham, Tom', 'Order Administrator', 'Berguvsvägen  5678', 'Luleå', NULL, '10112', 'Swede', '0921-67 89 01', '0921-23 45 67');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(6, 'Customer XHXJV', 'Poland, Carole', 'Sales Representative', 'Forsterstr. 7890', 'Mannheim', NULL, '10117', 'Germany', '0621-67890', '0621-12345');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(7, 'Customer QXVLA', 'Bansal, Dushyant', 'Marketing Manager', '2345, place Kléber', 'Strasbourg', NULL, '10089', 'France', '67.89.01.23', '67.89.01.24');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(8, 'Customer QUHWH', 'Ilyina, Julia', 'Owner', 'C/ Araquil, 0123', 'Madrid', NULL, '10104', 'Spai', '(91) 345 67 89', '(91) 012 34 56');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(9, 'Customer RTXGC', 'Raghav, Amritansh', 'Owner', '6789, rue des Bouchers', 'Marseille', NULL, '10105', 'France', '23.45.67.89', '23.45.67.80');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(10, 'Customer EEALV', 'Bassols, Pilar Colome', 'Accounting Manager', '8901 Tsawassen Blvd.', 'Tsawasse', 'BC', '10111', 'Canada', '(604) 901-2345', '(604) 678-9012');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(11, 'Customer UBHAU', 'Jaffe, David', 'Sales Representative', 'Fauntleroy Circus 4567', 'Londo', NULL, '10064', 'UK', '(171) 789-0123', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(12, 'Customer PSNMQ', 'Ray, Mike', 'Sales Agent', 'Cerrito 3456', 'Buenos Aires', NULL, '10057', 'Argentina', '(1) 890-1234', '(1) 567-8901');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(13, 'Customer VMLOG', 'Benito, Almudena', 'Marketing Manager', 'Sierras de Granada 7890', 'México D.F.', NULL, '10056', 'Mexico', '(5) 456-7890', '(5) 123-4567');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(14, 'Customer WNMAF', 'Jelitto, Jacek', 'Owner', 'Hauptstr. 0123', 'Ber', NULL, '10065', 'Switzerland', '0452-678901', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(15, 'Customer JUWXK', 'Richardson, Shaw', 'Sales Associate', 'Av. dos Lusíadas, 6789', 'Sao Paulo', 'SP', '10087', 'Brazil', '(11) 012-3456', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(16, 'Customer GYBBY', 'Birkby, Dana', 'Sales Representative', 'Berkeley Gardens 0123 Brewery', 'Londo', NULL, '10039', 'UK', '(171) 234-5678', '(171) 234-5679');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(17, 'Customer FEV', 'Jones, TiAnna', 'Order Administrator', 'Walserweg 4567', 'Aache', NULL, '10067', 'Germany', '0241-789012', '0241-345678');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(18, 'Customer BSVAR', 'Rizaldy, Arif', 'Owner', '3456, rue des Cinquante Otages', 'Nantes', NULL, '10041', 'France', '89.01.23.45', '89.01.23.46');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(19, 'Customer RFNQC', 'Boseman, Randall', 'Sales Agent', '5678 King George', 'Londo', NULL, '10110', 'UK', '(171) 345-6789', '(171) 345-6780');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(20, 'Customer THHDP', 'Kane, Joh', 'Sales Manager', 'Kirchgasse 9012', 'Graz', NULL, '10059', 'Austria', '1234-5678', '9012-3456');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(21, 'Customer KIDPX', 'Russo, Giuseppe', 'Marketing Assistant', 'Rua Orós, 3456', 'Sao Paulo', 'SP', '10096', 'Brazil', '(11) 456-7890', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(22, 'Customer DTDM', 'Bueno, Janaina Burdan, Neville', 'Accounting Manager', 'C/ Moralzarzal, 5678', 'Madrid', NULL, '10080', 'Spai', '(91) 890 12 34', '(91) 567 89 01');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(23, 'Customer WVFAF', 'Khanna, Kara', 'Assistant Sales Agent', '4567, chaussée de Tournai', 'Lille', NULL, '10048', 'France', '45.67.89.01', '45.67.89.02');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(24, 'Customer CYZT', 'San Juan, Patricia', 'Owner', 'Åkergatan 5678', 'Bräcke', NULL, '10114', 'Swede', '0695-67 89 01', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(25, 'Customer AZJED', 'Carlson, Jaso', 'Marketing Manager', 'Berliner Platz 9012', 'Münche', NULL, '10091', 'Germany', '089-8901234', '089-5678901');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(26, 'Customer USDBG', 'Koch, Paul', 'Marketing Manager', '9012, rue Royale', 'Nantes', NULL, '10101', 'France', '34.56.78.90', '34.56.78.91');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(27, 'Customer WMFEA', 'Schmöllerl, Marti', 'Sales Representative', 'Via Monte Bianco 4567', 'Torino', NULL, '10099', 'Italy', '011-2345678', '011-9012345');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(28, 'Customer XYUFB', 'Cavaglieri, Giorgio', 'Sales Manager', 'Jardim das rosas n. 8901', 'Lisboa', NULL, '10054', 'Portugal', '(1) 456-7890', '(1) 123-4567');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(29, 'Customer MDLWA', 'Kolesnikova, Katerina', 'Marketing Manager', 'Rambla de Cataluña, 8901', 'Barcelona', NULL, '10081', 'Spai', '(93) 789 0123', '(93) 456 7890');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(30, 'Customer KSLQF', 'Shabalin, Rostislav', 'Sales Manager', 'C/ Romero, 1234', 'Sevilla', NULL, '10075', 'Spai', '(95) 901 23 45', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(31, 'Customer YJCBX', 'Cheng, Yao-Qiang', 'Sales Associate', 'Av. Brasil, 5678', 'Campinas', 'SP', '10128', 'Brazil', '(11) 567-8901', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(32, 'Customer YSIQX', 'Krishnan, Venky', 'Marketing Manager', '6789 Baker Blvd.', 'Eugene', 'OR', '10070', 'USA', '(503) 555-0122', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(33, 'Customer FVXPQ', 'Sigurdarson, Hallur ', 'Owner', '5ª Ave. Los Palos Grandes 3456', 'Caracas', 'DF', '10043', 'Venezuela', '(2) 789-0123', '(2) 456-7890');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(34, 'Customer IBVRG', 'Cohen, Shy', 'Accounting Manager', 'Rua do Paço, 7890', 'Rio de Janeiro', 'RJ', '10076', 'Brazil', '(21) 789-0123', '(21) 789-0124');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(35, 'Customer UMTLM', 'Langohr, Kris', 'Sales Representative', 'Carrera 1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10066', 'Venezuela', '(5) 567-8901', '(5) 234-5678');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(36, 'Customer LVJSO', 'Smith, Denise', 'Sales Representative', 'City Center Plaza 2345 Main St.', 'Elgi', 'OR', '10103', 'USA', '(503) 555-0126', '(503) 555-0135');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(37, 'Customer FRXZL', 'Crăciun, Ovidiu V.', 'Sales Associate', '9012 Johnstown Road', 'Cork', 'Co. Cork', '10051', 'Ireland', '8901 234', '5678 9012');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(38, 'Customer LJUCA', 'Lee, Frank', 'Marketing Manager', 'Garden House Crowther Way 3456', 'Cowes', 'Isle of Wight', '10063', 'UK', '(198) 567-8901', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(39, 'Customer GLLAG', 'Song, Lola', 'Sales Associate', 'Maubelstr. 8901', 'Brandenburg', NULL, '10060', 'Germany', '0555-34567', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(40, 'Customer EFFTC', 'De Oliveira, Jose', 'Sales Representative', '2345, avenue de l''Europe', 'Versailles', NULL, '10108', 'France', '12.34.56.78', '12.34.56.79');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(41, 'Customer XIIWM', 'Litton, Tim', 'Sales Manager', '3456 rue Alsace-Lorraine', 'Toulouse', NULL, '10053', 'France', '90.12.34.56', '90.12.34.57');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(42, 'Customer IAIJK', 'Steiner, Dominik', 'Marketing Assistant', '2345 Oak St.', 'Vancouver', 'BC', '10098', 'Canada', '(604) 567-8901', '(604) 234-5678');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(43, 'Customer UISOJ', 'Deshpande, Anu', 'Marketing Manager', '8901 Orchestra Terrace', 'Walla Walla', 'WA', '10069', 'USA', '(509) 555-0119', '(509) 555-0130');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(44, 'Customer OXFRU', 'Louverdis, George', 'Sales Representative', 'Magazinweg 8901', 'Frankfurt a.M.', NULL, '10095', 'Germany', '069-7890123', '069-4567890');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(45, 'Customer QXPPT', 'Sunkammurali,  Krishna', 'Owner', '1234 Polk St. Suite 5', 'San Francisco', 'CA', '10062', 'USA', '(415) 555-0118', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(46, 'Customer XPNIK', 'Dressler, Marlies', 'Accounting Manager', 'Carrera 7890 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10093', 'Venezuela', '(9) 789-0123', '(9) 456-7890');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(47, 'Customer PSQUZ', 'Lupu, Cornel', 'Owner', 'Ave. 5 de Mayo Porlamar 5678', 'I. de Margarita', 'Nueva Esparta', '10121', 'Venezuela', '(8) 01-23-45', '(8) 67-89-01');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(48, 'Customer DVFMB', 'Szymczak, Radosław', 'Sales Manager', '9012 Chiaroscuro Rd.', 'Portland', 'OR', '10073', 'USA', '(503) 555-0117', '(503) 555-0129');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(49, 'Customer CQRAA', 'Duerr, Bernard', 'Marketing Manager', 'Via Ludovico il Moro 6789', 'Bergamo', NULL, '10106', 'Italy', '035-345678', '035-901234');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(50, 'Customer JYPSC', 'Mace, Donald', 'Sales Agent', 'Rue Joseph-Bens 0123', 'Bruxelles', NULL, '10074', 'Belgium', '(02) 890 12 34', '(02) 567 89 01');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(51, 'Customer PVDZC', 'Taylor, Maurice', 'Marketing Assistant', '8901 rue St. Laurent', 'Montréal', 'Québec', '10040', 'Canada', '(514) 345-6789', '(514) 012-3456');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(52, 'Customer PZNLA', 'Dupont-Roc, Patrice', 'Marketing Assistant', 'Heerstr. 4567', 'Leipzig', NULL, '10125', 'Germany', '0342-12345', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(53, 'Customer GCJSG', 'Mallit, Ke', 'Sales Associate', 'South House 1234 Queensbridge', 'Londo', NULL, '10061', 'UK', '(171) 890-1234', '(171) 890-1235');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(54, 'Customer TDKEG', 'Tiano, Mike', 'Sales Agent', 'Ing. Gustavo Moncada 0123 Piso 20-A', 'Buenos Aires', NULL, '10094', 'Argentina', '(1) 123-4567', '(1) 890-1234');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(55, 'Customer KZQZT', 'Egelund-Muller, Anja', 'Sales Representative', '7890 Bering St.', 'Anchorage', 'AK', '10050', 'USA', '(907) 555-0115', '(907) 555-0128');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(56, 'Customer QNIVZ', 'Marinova, Nadejda', 'Owner', 'Mehrheimerstr. 9012', 'Köl', NULL, '10047', 'Germany', '0221-0123456', '0221-7890123');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(57, 'Customer WVAXS', 'Tollevsen, Bjør', 'Owner', '5678, boulevard Charonne', 'Paris', NULL, '10085', 'France', '(1) 89.01.23.45', '(1) 89.01.23.46');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(58, 'Customer AHXHT', 'Fakhouri, Fadi', 'Sales Representative', 'Calle Dr. Jorge Cash 8901', 'México D.F.', NULL, '10116', 'Mexico', '(5) 890-1234', '(5) 567-8901');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(59, 'Customer LOLJO', 'Meston, Tosh', 'Sales Manager', 'Geislweg 2345', 'Salzburg', NULL, '10127', 'Austria', '4567-8901', '2345-6789');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(60, 'Customer QZURI', 'Uppal, Sunil', 'Sales Representative', 'Estrada da saúde n. 6789', 'Lisboa', NULL, '10083', 'Portugal', '(1) 789-0123', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(61, 'Customer WULWD', 'Florczyk, Krzysztof', 'Accounting Manager', 'Rua da Panificadora, 1234', 'Rio de Janeiro', 'RJ', '10115', 'Brazil', '(21) 678-9012', '(21) 678-9013');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(62, 'Customer WFIZJ', 'Misiec, Anna', 'Marketing Assistant', 'Alameda dos Canàrios, 1234', 'Sao Paulo', 'SP', '10102', 'Brazil', '(11) 901-2345', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(63, 'Customer IRRVL', 'Veronesi, Giorgio', 'Accounting Manager', 'Taucherstraße 1234', 'Cunewalde', NULL, '10126', 'Germany', '0372-12345', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(64, 'Customer LWGMD', 'Gaffney, Lawrie', 'Sales Representative', 'Av. del Libertador 3456', 'Buenos Aires', NULL, '10124', 'Argentina', '(1) 234-5678', '(1) 901-2345');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(65, 'Customer NYUHS', 'Moore, Michael', 'Assistant Sales Representative', '6789 Milton Dr.', 'Albuquerque', 'NM', '10109', 'USA', '(505) 555-0125', '(505) 555-0134');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(66, 'Customer LHANT', 'Voss, Floria', 'Sales Associate', 'Strada Provinciale 7890', 'Reggio Emilia', NULL, '10038', 'Italy', '0522-012345', '0522-678901');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(67, 'Customer QVEPD', 'Garden, Eua', 'Assistant Sales Agent', 'Av. Copacabana, 6789', 'Rio de Janeiro', 'RJ', '10052', 'Brazil', '(21) 345-6789', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(68, 'Customer CCKOT', 'Myrcha, Jacek', 'Sales Manager', 'Grenzacherweg 0123', 'Genève', NULL, '10122', 'Switzerland', '0897-012345', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(69, 'Customer SIUIH', 'Watters, Jason M.', 'Accounting Manager', 'Gran Vía, 4567', 'Madrid', NULL, '10071', 'Spai', '(91) 567 8901', '(91) 234 5678');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(70, 'Customer TMXG', 'Ginters, Kaspars', 'Owner', 'Erling Skakkes gate 2345', 'Staver', NULL, '10123', 'Norway', '07-89 01 23', '07-45 67 89');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(71, 'Customer LCOUJ', 'Navarro, Tomás', 'Sales Representative', '9012 Suffolk Ln.', 'Boise', 'ID', '10078', 'USA', '(208) 555-0116', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(72, 'Customer AHPOP', 'Welcker, Bria', 'Sales Manager', '4567 Wadhurst Rd.', 'Londo', NULL, '10088', 'UK', '(171) 901-2345', '(171) 901-2346');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(73, 'Customer JMIKW', 'Gonzalez, Nuria', 'Owner', 'Vinbæltet 3456', 'Kobenhav', NULL, '10079', 'Denmark', '12 34 56 78', '90 12 34 56');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(74, 'Customer YSHXL', 'O’Brien, Dave', 'Marketing Manager', '9012, rue Lauristo', 'Paris', NULL, '10058', 'France', '(1) 23.45.67.89', '(1) 23.45.67.80');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(75, 'Customer XOJYP', 'Wojciechowska, Agnieszka', 'Sales Manager', 'P.O. Box 1234', 'Lander', 'WY', '10113', 'USA', '(307) 555-0114', '(307) 555-0127');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(76, 'Customer SFOGW', 'Gulbis, Katri', 'Accounting Manager', 'Boulevard Tirou, 2345', 'Charleroi', NULL, '10100', 'Belgium', '(071) 56 78 90 12', '(071) 34 56 78 90');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(77, 'Customer LCYBZ', 'Osorio, Cristia', 'Marketing Manager', '2345 Jefferson Way Suite 2', 'Portland', 'OR', '10042', 'USA', '(503) 555-0120', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(78, 'Customer NLTYP', 'Young, Robi', 'Marketing Assistant', '0123 Grizzly Peak Rd.', 'Butte', 'MT', '10107', 'USA', '(406) 555-0121', '(406) 555-0131');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(79, 'Customer FAPSM', 'Wickham, Jim', 'Marketing Manager', 'Luisenstr. 0123', 'Münster', NULL, '10118', 'Germany', '0251-456789', '0251-012345');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(80, 'Customer VONTK', 'Geschwandtner, Jens', 'Owner', 'Avda. Azteca 4567', 'México D.F.', NULL, '10044', 'Mexico', '(5) 678-9012', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(81, 'Customer YQQWW', 'Nagel, Jean-Philippe', 'Sales Representative', 'Av. Inês de Castro, 1234', 'Sao Paulo', 'SP', '10120', 'Brazil', '(11) 123-4567', '(11) 234-5678');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(82, 'Customer EYHKM', 'Veninga, Tjeerd', 'Sales Associate', '1234 DaVinci Blvd.', 'Kirkland', 'WA', '10119', 'USA', '(206) 555-0124', '(206) 555-0133');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(83, 'Customer ZRNDE', 'Fonteneau, Karl', 'Sales Manager', 'Smagsloget 3456', 'Århus', NULL, '10090', 'Denmark', '23 45 67 89', '01 23 45 67');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(84, 'Customer NRCSK', 'Tuntisangaroon, Sittichai', 'Sales Agent', '6789, rue du Commerce', 'Lyo', NULL, '10072', 'France', '78.90.12.34', '78.90.12.35');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(85, 'Customer ENQZT', 'McLin, Nkenge', 'Accounting Manager', '5678 rue de l''Abbaye', 'Reims', NULL, '10082', 'France', '56.78.90.12', '56.78.90.13');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(86, 'Customer SNXOJ', 'Syamala, Manoj', 'Sales Representative', 'Adenauerallee 7890', 'Stuttgart', NULL, '10086', 'Germany', '0711-345678', '0711-901234');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(87, 'Customer ZHYOS', 'Ludwig, Michael', 'Accounting Manager', 'Torikatu 9012', 'Oulu', NULL, '10045', 'Finland', '981-123456', '981-789012');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(88, 'Customer SRQVM', 'Li, Ya', 'Sales Manager', 'Rua do Mercado, 4567', 'Resende', 'SP', '10084', 'Brazil', '(14) 234-5678', NULL);
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(89, 'Customer YBQTI', 'Smith Jr., Ronaldo', 'Owner', '8901 - 14th Ave. S. Suite 3B', 'Seattle', 'WA', '10049', 'USA', '(206) 555-0123', '(206) 555-0132');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(90, 'Customer XBBVR', 'Larsson, Katarina', 'Owner/Marketing Assistant', 'Keskuskatu 2345', 'Helsinki', NULL, '10055', 'Finland', '90-012 3456', '90-789 0123');
INSERT INTO Customers(custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax)
  VALUES(91, 'Customer CCFIZ', 'Conn, Steve', 'Owner', 'ul. Filtrowa 6789', 'Warszawa', NULL, '10068', 'Poland', '(26) 234-5678', '(26) 901-2345');

INSERT INTO Shippers(shipperid, companyname, phone)
  VALUES(1, 'Shipper GVSUA', '(503) 555-0137');
INSERT INTO Shippers(shipperid, companyname, phone)
  VALUES(2, 'Shipper ETYNR', '(425) 555-0136');
INSERT INTO Shippers(shipperid, companyname, phone)
  VALUES(3, 'Shipper ZHIS', '(415) 555-0138');

INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10248, 85, 5, '20060704 00:00:00.000', '20060801 00:00:00.000', '20060716 00:00:00.000', 3, 32.38, 'Ship to 85-B', '6789 rue de l''Abbaye', 'Reims', NULL, '10345', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10249, 79, 6, '20060705 00:00:00.000', '20060816 00:00:00.000', '20060710 00:00:00.000', 1, 11.61, 'Ship to 79-C', 'Luisenstr. 9012', 'Münster', NULL, '10328', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10250, 34, 4, '20060708 00:00:00.000', '20060805 00:00:00.000', '20060712 00:00:00.000', 2, 65.83, 'Destination SCQXA', 'Rua do Paço, 7890', 'Rio de Janeiro', 'RJ', '10195', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10251, 84, 3, '20060708 00:00:00.000', '20060805 00:00:00.000', '20060715 00:00:00.000', 1, 41.34, 'Ship to 84-A', '3456, rue du Commerce', 'Lyo', NULL, '10342', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10252, 76, 4, '20060709 00:00:00.000', '20060806 00:00:00.000', '20060711 00:00:00.000', 2, 51.30, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10253, 34, 3, '20060710 00:00:00.000', '20060724 00:00:00.000', '20060716 00:00:00.000', 2, 58.17, 'Destination JPAIY', 'Rua do Paço, 8901', 'Rio de Janeiro', 'RJ', '10196', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10254, 14, 5, '20060711 00:00:00.000', '20060808 00:00:00.000', '20060723 00:00:00.000', 2, 22.98, 'Destination YUJRD', 'Hauptstr. 1234', 'Ber', NULL, '10139', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10255, 68, 9, '20060712 00:00:00.000', '20060809 00:00:00.000', '20060715 00:00:00.000', 3, 148.33, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10256, 88, 3, '20060715 00:00:00.000', '20060812 00:00:00.000', '20060717 00:00:00.000', 2, 13.97, 'Ship to 88-B', 'Rua do Mercado, 5678', 'Resende', 'SP', '10354', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10257, 35, 4, '20060716 00:00:00.000', '20060813 00:00:00.000', '20060722 00:00:00.000', 3, 81.91, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10258, 20, 1, '20060717 00:00:00.000', '20060814 00:00:00.000', '20060723 00:00:00.000', 1, 140.51, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10259, 13, 4, '20060718 00:00:00.000', '20060815 00:00:00.000', '20060725 00:00:00.000', 3, 3.25, 'Destination LGGCH', 'Sierras de Granada 9012', 'México D.F.', NULL, '10137', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10260, 56, 4, '20060719 00:00:00.000', '20060816 00:00:00.000', '20060729 00:00:00.000', 1, 55.09, 'Ship to 56-A', 'Mehrheimerstr. 0123', 'Köl', NULL, '10258', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10261, 61, 4, '20060719 00:00:00.000', '20060816 00:00:00.000', '20060730 00:00:00.000', 2, 3.05, 'Ship to 61-B', 'Rua da Panificadora, 6789', 'Rio de Janeiro', 'RJ', '10274', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10262, 65, 8, '20060722 00:00:00.000', '20060819 00:00:00.000', '20060725 00:00:00.000', 3, 48.29, 'Ship to 65-B', '8901 Milton Dr.', 'Albuquerque', 'NM', '10286', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10263, 20, 9, '20060723 00:00:00.000', '20060820 00:00:00.000', '20060731 00:00:00.000', 3, 146.06, 'Destination FFXKT', 'Kirchgasse 0123', 'Graz', NULL, '10158', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10264, 24, 6, '20060724 00:00:00.000', '20060821 00:00:00.000', '20060823 00:00:00.000', 3, 3.67, 'Destination KBSB', 'Åkergatan 9012', 'Bräcke', NULL, '10167', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10265, 7, 2, '20060725 00:00:00.000', '20060822 00:00:00.000', '20060812 00:00:00.000', 1, 55.28, 'Ship to 7-A', '0123, place Kléber', 'Strasbourg', NULL, '10329', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10266, 87, 3, '20060726 00:00:00.000', '20060906 00:00:00.000', '20060731 00:00:00.000', 3, 25.73, 'Ship to 87-B', 'Torikatu 2345', 'Oulu', NULL, '10351', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10267, 25, 4, '20060729 00:00:00.000', '20060826 00:00:00.000', '20060806 00:00:00.000', 1, 208.58, 'Destination VAPXU', 'Berliner Platz 0123', 'Münche', NULL, '10168', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10268, 33, 8, '20060730 00:00:00.000', '20060827 00:00:00.000', '20060802 00:00:00.000', 3, 66.29, 'Destination QJVQH', '5ª Ave. Los Palos Grandes 5678', 'Caracas', 'DF', '10193', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10269, 89, 5, '20060731 00:00:00.000', '20060814 00:00:00.000', '20060809 00:00:00.000', 1, 4.56, 'Ship to 89-B', '8901 - 12th Ave. S.', 'Seattle', 'WA', '10357', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10270, 87, 1, '20060801 00:00:00.000', '20060829 00:00:00.000', '20060802 00:00:00.000', 1, 136.54, 'Ship to 87-B', 'Torikatu 2345', 'Oulu', NULL, '10351', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10271, 75, 6, '20060801 00:00:00.000', '20060829 00:00:00.000', '20060830 00:00:00.000', 2, 4.54, 'Ship to 75-C', 'P.O. Box 7890', 'Lander', 'WY', '10316', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10272, 65, 6, '20060802 00:00:00.000', '20060830 00:00:00.000', '20060806 00:00:00.000', 2, 98.03, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10273, 63, 3, '20060805 00:00:00.000', '20060902 00:00:00.000', '20060812 00:00:00.000', 3, 76.07, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10274, 85, 6, '20060806 00:00:00.000', '20060903 00:00:00.000', '20060816 00:00:00.000', 1, 6.01, 'Ship to 85-B', '6789 rue de l''Abbaye', 'Reims', NULL, '10345', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10275, 49, 1, '20060807 00:00:00.000', '20060904 00:00:00.000', '20060809 00:00:00.000', 1, 26.93, 'Ship to 49-A', 'Via Ludovico il Moro 8901', 'Bergamo', NULL, '10235', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10276, 80, 8, '20060808 00:00:00.000', '20060822 00:00:00.000', '20060814 00:00:00.000', 3, 13.84, 'Ship to 80-C', 'Avda. Azteca 5678', 'México D.F.', NULL, '10334', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10277, 52, 2, '20060809 00:00:00.000', '20060906 00:00:00.000', '20060813 00:00:00.000', 3, 125.77, 'Ship to 52-A', 'Heerstr. 9012', 'Leipzig', NULL, '10247', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10278, 5, 8, '20060812 00:00:00.000', '20060909 00:00:00.000', '20060816 00:00:00.000', 2, 92.69, 'Ship to 5-C', 'Berguvsvägen  1234', 'Luleå', NULL, '10269', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10279, 44, 8, '20060813 00:00:00.000', '20060910 00:00:00.000', '20060816 00:00:00.000', 2, 25.83, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10280, 5, 2, '20060814 00:00:00.000', '20060911 00:00:00.000', '20060912 00:00:00.000', 1, 8.98, 'Ship to 5-B', 'Berguvsvägen  0123', 'Luleå', NULL, '10268', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10281, 69, 4, '20060814 00:00:00.000', '20060828 00:00:00.000', '20060821 00:00:00.000', 1, 2.94, 'Ship to 69-A', 'Gran Vía, 9012', 'Madrid', NULL, '10297', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10282, 69, 4, '20060815 00:00:00.000', '20060912 00:00:00.000', '20060821 00:00:00.000', 1, 12.69, 'Ship to 69-B', 'Gran Vía, 0123', 'Madrid', NULL, '10298', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10283, 46, 3, '20060816 00:00:00.000', '20060913 00:00:00.000', '20060823 00:00:00.000', 3, 84.81, 'Ship to 46-A', 'Carrera 0123 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10227', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10284, 44, 4, '20060819 00:00:00.000', '20060916 00:00:00.000', '20060827 00:00:00.000', 1, 76.56, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10285, 63, 1, '20060820 00:00:00.000', '20060917 00:00:00.000', '20060826 00:00:00.000', 2, 76.83, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10286, 63, 8, '20060821 00:00:00.000', '20060918 00:00:00.000', '20060830 00:00:00.000', 3, 229.24, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10287, 67, 8, '20060822 00:00:00.000', '20060919 00:00:00.000', '20060828 00:00:00.000', 3, 12.76, 'Ship to 67-A', 'Av. Copacabana, 3456', 'Rio de Janeiro', 'RJ', '10291', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10288, 66, 4, '20060823 00:00:00.000', '20060920 00:00:00.000', '20060903 00:00:00.000', 1, 7.45, 'Ship to 66-C', 'Strada Provinciale 2345', 'Reggio Emilia', NULL, '10290', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10289, 11, 7, '20060826 00:00:00.000', '20060923 00:00:00.000', '20060828 00:00:00.000', 3, 22.77, 'Destination DLEU', 'Fauntleroy Circus 4567', 'Londo', NULL, '10132', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10290, 15, 8, '20060827 00:00:00.000', '20060924 00:00:00.000', '20060903 00:00:00.000', 1, 79.70, 'Destination HQZHO', 'Av. dos Lusíadas, 4567', 'Sao Paulo', 'SP', '10142', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10291, 61, 6, '20060827 00:00:00.000', '20060924 00:00:00.000', '20060904 00:00:00.000', 2, 6.40, 'Ship to 61-A', 'Rua da Panificadora, 5678', 'Rio de Janeiro', 'RJ', '10273', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10292, 81, 1, '20060828 00:00:00.000', '20060925 00:00:00.000', '20060902 00:00:00.000', 2, 1.35, 'Ship to 81-A', 'Av. Inês de Castro, 6789', 'Sao Paulo', 'SP', '10335', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10293, 80, 1, '20060829 00:00:00.000', '20060926 00:00:00.000', '20060911 00:00:00.000', 3, 21.18, 'Ship to 80-B', 'Avda. Azteca 4567', 'México D.F.', NULL, '10333', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10294, 65, 4, '20060830 00:00:00.000', '20060927 00:00:00.000', '20060905 00:00:00.000', 2, 147.26, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10295, 85, 2, '20060902 00:00:00.000', '20060930 00:00:00.000', '20060910 00:00:00.000', 2, 1.15, 'Ship to 85-C', '7890 rue de l''Abbaye', 'Reims', NULL, '10346', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10296, 46, 6, '20060903 00:00:00.000', '20061001 00:00:00.000', '20060911 00:00:00.000', 1, 0.12, 'Ship to 46-C', 'Carrera 2345 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10229', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10297, 7, 5, '20060904 00:00:00.000', '20061016 00:00:00.000', '20060910 00:00:00.000', 2, 5.74, 'Ship to 7-C', '2345, place Kléber', 'Strasbourg', NULL, '10331', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10298, 37, 6, '20060905 00:00:00.000', '20061003 00:00:00.000', '20060911 00:00:00.000', 2, 168.22, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10299, 67, 4, '20060906 00:00:00.000', '20061004 00:00:00.000', '20060913 00:00:00.000', 2, 29.76, 'Ship to 67-A', 'Av. Copacabana, 3456', 'Rio de Janeiro', 'RJ', '10291', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10300, 49, 2, '20060909 00:00:00.000', '20061007 00:00:00.000', '20060918 00:00:00.000', 2, 17.68, 'Ship to 49-A', 'Via Ludovico il Moro 8901', 'Bergamo', NULL, '10235', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10301, 86, 8, '20060909 00:00:00.000', '20061007 00:00:00.000', '20060917 00:00:00.000', 2, 45.08, 'Ship to 86-A', 'Adenauerallee 8901', 'Stuttgart', NULL, '10347', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10302, 76, 4, '20060910 00:00:00.000', '20061008 00:00:00.000', '20061009 00:00:00.000', 2, 6.27, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10303, 30, 7, '20060911 00:00:00.000', '20061009 00:00:00.000', '20060918 00:00:00.000', 2, 107.83, 'Destination IIYDD', 'C/ Romero, 5678', 'Sevilla', NULL, '10183', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10304, 80, 1, '20060912 00:00:00.000', '20061010 00:00:00.000', '20060917 00:00:00.000', 2, 63.79, 'Ship to 80-C', 'Avda. Azteca 5678', 'México D.F.', NULL, '10334', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10305, 55, 8, '20060913 00:00:00.000', '20061011 00:00:00.000', '20061009 00:00:00.000', 3, 257.62, 'Ship to 55-B', '8901 Bering St.', 'Anchorage', 'AK', '10256', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10306, 69, 1, '20060916 00:00:00.000', '20061014 00:00:00.000', '20060923 00:00:00.000', 3, 7.56, 'Ship to 69-B', 'Gran Vía, 0123', 'Madrid', NULL, '10298', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10307, 48, 2, '20060917 00:00:00.000', '20061015 00:00:00.000', '20060925 00:00:00.000', 2, 0.56, 'Ship to 48-B', '6789 Chiaroscuro Rd.', 'Portland', 'OR', '10233', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10308, 2, 7, '20060918 00:00:00.000', '20061016 00:00:00.000', '20060924 00:00:00.000', 3, 1.61, 'Destination QMVCI', 'Avda. de la Constitución 2345', 'México D.F.', NULL, '10180', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10309, 37, 3, '20060919 00:00:00.000', '20061017 00:00:00.000', '20061023 00:00:00.000', 1, 47.30, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10310, 77, 8, '20060920 00:00:00.000', '20061018 00:00:00.000', '20060927 00:00:00.000', 2, 17.52, 'Ship to 77-B', '2345 Jefferson Way Suite 2', 'Portland', 'OR', '10321', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10311, 18, 1, '20060920 00:00:00.000', '20061004 00:00:00.000', '20060926 00:00:00.000', 3, 24.69, 'Destination SNPXM', '0123, rue des Cinquante Otages', 'Nantes', NULL, '10148', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10312, 86, 2, '20060923 00:00:00.000', '20061021 00:00:00.000', '20061003 00:00:00.000', 2, 40.26, 'Ship to 86-B', 'Adenauerallee 9012', 'Stuttgart', NULL, '10348', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10313, 63, 2, '20060924 00:00:00.000', '20061022 00:00:00.000', '20061004 00:00:00.000', 2, 1.96, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10314, 65, 1, '20060925 00:00:00.000', '20061023 00:00:00.000', '20061004 00:00:00.000', 2, 74.16, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10315, 38, 4, '20060926 00:00:00.000', '20061024 00:00:00.000', '20061003 00:00:00.000', 2, 41.76, 'Destination AXVHD', 'Garden House Crowther Way 9012', 'Cowes', 'Isle of Wight', '10207', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10316, 65, 1, '20060927 00:00:00.000', '20061025 00:00:00.000', '20061008 00:00:00.000', 3, 150.15, 'Ship to 65-B', '8901 Milton Dr.', 'Albuquerque', 'NM', '10286', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10317, 48, 6, '20060930 00:00:00.000', '20061028 00:00:00.000', '20061010 00:00:00.000', 1, 12.69, 'Ship to 48-B', '6789 Chiaroscuro Rd.', 'Portland', 'OR', '10233', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10318, 38, 8, '20061001 00:00:00.000', '20061029 00:00:00.000', '20061004 00:00:00.000', 2, 4.73, 'Destination AXVHD', 'Garden House Crowther Way 9012', 'Cowes', 'Isle of Wight', '10207', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10319, 80, 7, '20061002 00:00:00.000', '20061030 00:00:00.000', '20061011 00:00:00.000', 3, 64.50, 'Ship to 80-B', 'Avda. Azteca 4567', 'México D.F.', NULL, '10333', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10320, 87, 5, '20061003 00:00:00.000', '20061017 00:00:00.000', '20061018 00:00:00.000', 3, 34.57, 'Ship to 87-A', 'Torikatu 1234', 'Oulu', NULL, '10350', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10321, 38, 3, '20061003 00:00:00.000', '20061031 00:00:00.000', '20061011 00:00:00.000', 2, 3.43, 'Destination LMVGS', 'Garden House Crowther Way 8901', 'Cowes', 'Isle of Wight', '10206', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10322, 58, 7, '20061004 00:00:00.000', '20061101 00:00:00.000', '20061023 00:00:00.000', 3, 0.40, 'Ship to 58-A', 'Calle Dr. Jorge Cash 3456', 'México D.F.', NULL, '10261', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10323, 39, 4, '20061007 00:00:00.000', '20061104 00:00:00.000', '20061014 00:00:00.000', 1, 4.88, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10324, 71, 9, '20061008 00:00:00.000', '20061105 00:00:00.000', '20061010 00:00:00.000', 1, 214.27, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10325, 39, 1, '20061009 00:00:00.000', '20061023 00:00:00.000', '20061014 00:00:00.000', 3, 64.86, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10326, 8, 4, '20061010 00:00:00.000', '20061107 00:00:00.000', '20061014 00:00:00.000', 2, 77.92, 'Ship to 8-A', 'C/ Araquil, 0123', 'Madrid', NULL, '10359', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10327, 24, 2, '20061011 00:00:00.000', '20061108 00:00:00.000', '20061014 00:00:00.000', 1, 63.36, 'Destination NCKKO', 'Åkergatan 7890', 'Bräcke', NULL, '10165', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10328, 28, 4, '20061014 00:00:00.000', '20061111 00:00:00.000', '20061017 00:00:00.000', 3, 87.03, 'Destination CIRQO', 'Jardim das rosas n. 8901', 'Lisboa', NULL, '10176', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10329, 75, 4, '20061015 00:00:00.000', '20061126 00:00:00.000', '20061023 00:00:00.000', 2, 191.67, 'Ship to 75-C', 'P.O. Box 7890', 'Lander', 'WY', '10316', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10330, 46, 3, '20061016 00:00:00.000', '20061113 00:00:00.000', '20061028 00:00:00.000', 1, 12.75, 'Ship to 46-A', 'Carrera 0123 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10227', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10331, 9, 9, '20061016 00:00:00.000', '20061127 00:00:00.000', '20061021 00:00:00.000', 1, 10.19, 'Ship to 9-C', '0123, rue des Bouchers', 'Marseille', NULL, '10369', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10332, 51, 3, '20061017 00:00:00.000', '20061128 00:00:00.000', '20061021 00:00:00.000', 2, 52.84, 'Ship to 51-B', '7890 rue St. Laurent', 'Montréal', 'Québec', '10245', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10333, 87, 5, '20061018 00:00:00.000', '20061115 00:00:00.000', '20061025 00:00:00.000', 3, 0.59, 'Ship to 87-C', 'Torikatu 3456', 'Oulu', NULL, '10352', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10334, 84, 8, '20061021 00:00:00.000', '20061118 00:00:00.000', '20061028 00:00:00.000', 2, 8.56, 'Ship to 84-B', '4567, rue du Commerce', 'Lyo', NULL, '10343', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10335, 37, 7, '20061022 00:00:00.000', '20061119 00:00:00.000', '20061024 00:00:00.000', 2, 42.11, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10336, 60, 7, '20061023 00:00:00.000', '20061120 00:00:00.000', '20061025 00:00:00.000', 2, 15.51, 'Ship to 60-B', 'Estrada da saúde n. 3456', 'Lisboa', NULL, '10271', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10337, 25, 4, '20061024 00:00:00.000', '20061121 00:00:00.000', '20061029 00:00:00.000', 3, 108.26, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10338, 55, 4, '20061025 00:00:00.000', '20061122 00:00:00.000', '20061029 00:00:00.000', 3, 84.21, 'Ship to 55-C', '9012 Bering St.', 'Anchorage', 'AK', '10257', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10339, 51, 2, '20061028 00:00:00.000', '20061125 00:00:00.000', '20061104 00:00:00.000', 2, 15.66, 'Ship to 51-C', '8901 rue St. Laurent', 'Montréal', 'Québec', '10246', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10340, 9, 1, '20061029 00:00:00.000', '20061126 00:00:00.000', '20061108 00:00:00.000', 3, 166.31, 'Ship to 9-A', '8901, rue des Bouchers', 'Marseille', NULL, '10367', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10341, 73, 7, '20061029 00:00:00.000', '20061126 00:00:00.000', '20061105 00:00:00.000', 3, 26.78, 'Ship to 73-A', 'Vinbæltet 1234', 'Kobenhav', NULL, '10310', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10342, 25, 4, '20061030 00:00:00.000', '20061113 00:00:00.000', '20061104 00:00:00.000', 2, 54.83, 'Destination VAPXU', 'Berliner Platz 0123', 'Münche', NULL, '10168', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10343, 44, 4, '20061031 00:00:00.000', '20061128 00:00:00.000', '20061106 00:00:00.000', 1, 110.37, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10344, 89, 4, '20061101 00:00:00.000', '20061129 00:00:00.000', '20061105 00:00:00.000', 2, 23.29, 'Ship to 89-A', '7890 - 12th Ave. S.', 'Seattle', 'WA', '10356', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10345, 63, 2, '20061104 00:00:00.000', '20061202 00:00:00.000', '20061111 00:00:00.000', 2, 249.06, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10346, 65, 3, '20061105 00:00:00.000', '20061217 00:00:00.000', '20061108 00:00:00.000', 3, 142.08, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10347, 21, 4, '20061106 00:00:00.000', '20061204 00:00:00.000', '20061108 00:00:00.000', 3, 3.10, 'Destination KKELL', 'Rua Orós, 4567', 'Sao Paulo', 'SP', '10162', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10348, 86, 4, '20061107 00:00:00.000', '20061205 00:00:00.000', '20061115 00:00:00.000', 2, 0.78, 'Ship to 86-B', 'Adenauerallee 9012', 'Stuttgart', NULL, '10348', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10349, 75, 7, '20061108 00:00:00.000', '20061206 00:00:00.000', '20061115 00:00:00.000', 1, 8.63, 'Ship to 75-C', 'P.O. Box 7890', 'Lander', 'WY', '10316', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10350, 41, 6, '20061111 00:00:00.000', '20061209 00:00:00.000', '20061203 00:00:00.000', 2, 64.19, 'Destination DWJIO', '9012 rue Alsace-Lorraine', 'Toulouse', NULL, '10217', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10351, 20, 1, '20061111 00:00:00.000', '20061209 00:00:00.000', '20061120 00:00:00.000', 1, 162.33, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10352, 28, 3, '20061112 00:00:00.000', '20061126 00:00:00.000', '20061118 00:00:00.000', 3, 1.30, 'Destination OTSWR', 'Jardim das rosas n. 9012', 'Lisboa', NULL, '10177', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10353, 59, 7, '20061113 00:00:00.000', '20061211 00:00:00.000', '20061125 00:00:00.000', 3, 360.63, 'Ship to 59-B', 'Geislweg 7890', 'Salzburg', NULL, '10265', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10354, 58, 8, '20061114 00:00:00.000', '20061212 00:00:00.000', '20061120 00:00:00.000', 3, 53.80, 'Ship to 58-C', 'Calle Dr. Jorge Cash 5678', 'México D.F.', NULL, '10263', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10355, 4, 6, '20061115 00:00:00.000', '20061213 00:00:00.000', '20061120 00:00:00.000', 1, 41.95, 'Ship to 4-A', 'Brook Farm Stratford St. Mary 0123', 'Colchester', 'Essex', '10238', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10356, 86, 6, '20061118 00:00:00.000', '20061216 00:00:00.000', '20061127 00:00:00.000', 2, 36.71, 'Ship to 86-A', 'Adenauerallee 8901', 'Stuttgart', NULL, '10347', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10357, 46, 1, '20061119 00:00:00.000', '20061217 00:00:00.000', '20061202 00:00:00.000', 3, 34.88, 'Ship to 46-B', 'Carrera 1234 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10228', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10358, 41, 5, '20061120 00:00:00.000', '20061218 00:00:00.000', '20061127 00:00:00.000', 1, 19.64, 'Ship to 41-C', '0123 rue Alsace-Lorraine', 'Toulouse', NULL, '10218', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10359, 72, 5, '20061121 00:00:00.000', '20061219 00:00:00.000', '20061126 00:00:00.000', 3, 288.43, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10360, 7, 4, '20061122 00:00:00.000', '20061220 00:00:00.000', '20061202 00:00:00.000', 3, 131.70, 'Ship to 7-C', '2345, place Kléber', 'Strasbourg', NULL, '10331', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10361, 63, 1, '20061122 00:00:00.000', '20061220 00:00:00.000', '20061203 00:00:00.000', 2, 183.17, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10362, 9, 3, '20061125 00:00:00.000', '20061223 00:00:00.000', '20061128 00:00:00.000', 1, 96.04, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10363, 17, 4, '20061126 00:00:00.000', '20061224 00:00:00.000', '20061204 00:00:00.000', 3, 30.54, 'Destination BJCXA', 'Walserweg 7890', 'Aache', NULL, '10145', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10364, 19, 1, '20061126 00:00:00.000', '20070107 00:00:00.000', '20061204 00:00:00.000', 1, 71.97, 'Destination QTKCU', '3456 King George', 'Londo', NULL, '10151', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10365, 3, 3, '20061127 00:00:00.000', '20061225 00:00:00.000', '20061202 00:00:00.000', 2, 22.00, 'Destination FQFLS', 'Mataderos  3456', 'México D.F.', NULL, '10211', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10366, 29, 8, '20061128 00:00:00.000', '20070109 00:00:00.000', '20061230 00:00:00.000', 2, 10.14, 'Destination VPNNG', 'Rambla de Cataluña, 0123', 'Barcelona', NULL, '10178', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10367, 83, 7, '20061128 00:00:00.000', '20061226 00:00:00.000', '20061202 00:00:00.000', 3, 13.55, 'Ship to 83-B', 'Smagsloget 1234', 'Århus', NULL, '10340', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10368, 20, 2, '20061129 00:00:00.000', '20061227 00:00:00.000', '20061202 00:00:00.000', 2, 101.95, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10369, 75, 8, '20061202 00:00:00.000', '20061230 00:00:00.000', '20061209 00:00:00.000', 2, 195.68, 'Ship to 75-C', 'P.O. Box 7890', 'Lander', 'WY', '10316', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10370, 14, 6, '20061203 00:00:00.000', '20061231 00:00:00.000', '20061227 00:00:00.000', 2, 1.17, 'Destination YUJRD', 'Hauptstr. 1234', 'Ber', NULL, '10139', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10371, 41, 1, '20061203 00:00:00.000', '20061231 00:00:00.000', '20061224 00:00:00.000', 1, 0.45, 'Ship to 41-C', '0123 rue Alsace-Lorraine', 'Toulouse', NULL, '10218', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10372, 62, 5, '20061204 00:00:00.000', '20070101 00:00:00.000', '20061209 00:00:00.000', 2, 890.78, 'Ship to 62-A', 'Alameda dos Canàrios, 8901', 'Sao Paulo', 'SP', '10276', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10373, 37, 4, '20061205 00:00:00.000', '20070102 00:00:00.000', '20061211 00:00:00.000', 3, 124.12, 'Destination KPVYJ', '5678 Johnstown Road', 'Cork', 'Co. Cork', '10203', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10374, 91, 1, '20061205 00:00:00.000', '20070102 00:00:00.000', '20061209 00:00:00.000', 3, 3.94, 'Ship to 91-A', 'ul. Filtrowa 5678', 'Warszawa', NULL, '10364', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10375, 36, 3, '20061206 00:00:00.000', '20070103 00:00:00.000', '20061209 00:00:00.000', 2, 20.12, 'Destination HOHCR', 'City Center Plaza 3456 Main St.', 'Elgi', 'OR', '10201', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10376, 51, 1, '20061209 00:00:00.000', '20070106 00:00:00.000', '20061213 00:00:00.000', 2, 20.39, 'Ship to 51-B', '7890 rue St. Laurent', 'Montréal', 'Québec', '10245', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10377, 72, 1, '20061209 00:00:00.000', '20070106 00:00:00.000', '20061213 00:00:00.000', 3, 22.21, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10378, 24, 5, '20061210 00:00:00.000', '20070107 00:00:00.000', '20061219 00:00:00.000', 3, 5.44, 'Destination KBSB', 'Åkergatan 9012', 'Bräcke', NULL, '10167', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10379, 61, 2, '20061211 00:00:00.000', '20070108 00:00:00.000', '20061213 00:00:00.000', 1, 45.03, 'Ship to 61-B', 'Rua da Panificadora, 6789', 'Rio de Janeiro', 'RJ', '10274', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10380, 37, 8, '20061212 00:00:00.000', '20070109 00:00:00.000', '20070116 00:00:00.000', 3, 35.03, 'Destination KPVYJ', '5678 Johnstown Road', 'Cork', 'Co. Cork', '10203', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10381, 46, 3, '20061212 00:00:00.000', '20070109 00:00:00.000', '20061213 00:00:00.000', 3, 7.99, 'Ship to 46-C', 'Carrera 2345 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10229', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10382, 20, 4, '20061213 00:00:00.000', '20070110 00:00:00.000', '20061216 00:00:00.000', 1, 94.77, 'Destination FFXKT', 'Kirchgasse 0123', 'Graz', NULL, '10158', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10383, 4, 8, '20061216 00:00:00.000', '20070113 00:00:00.000', '20061218 00:00:00.000', 3, 34.24, 'Ship to 4-B', 'Brook Farm Stratford St. Mary 1234', 'Colchester', 'Essex', '10239', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10384, 5, 3, '20061216 00:00:00.000', '20070113 00:00:00.000', '20061220 00:00:00.000', 3, 168.64, 'Ship to 5-C', 'Berguvsvägen  1234', 'Luleå', NULL, '10269', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10385, 75, 1, '20061217 00:00:00.000', '20070114 00:00:00.000', '20061223 00:00:00.000', 2, 30.96, 'Ship to 75-B', 'P.O. Box 6789', 'Lander', 'WY', '10315', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10386, 21, 9, '20061218 00:00:00.000', '20070101 00:00:00.000', '20061225 00:00:00.000', 3, 13.99, 'Destination RNSMS', 'Rua Orós, 2345', 'Sao Paulo', 'SP', '10160', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10387, 70, 1, '20061218 00:00:00.000', '20070115 00:00:00.000', '20061220 00:00:00.000', 2, 93.63, 'Ship to 70-B', 'Erling Skakkes gate 5678', 'Staver', NULL, '10303', 'Norway');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10388, 72, 2, '20061219 00:00:00.000', '20070116 00:00:00.000', '20061220 00:00:00.000', 1, 34.86, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10389, 10, 4, '20061220 00:00:00.000', '20070117 00:00:00.000', '20061224 00:00:00.000', 2, 47.42, 'Destination OLSSJ', '2345 Tsawassen Blvd.', 'Tsawasse', 'BC', '10130', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10390, 20, 6, '20061223 00:00:00.000', '20070120 00:00:00.000', '20061226 00:00:00.000', 1, 126.38, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10391, 17, 3, '20061223 00:00:00.000', '20070120 00:00:00.000', '20061231 00:00:00.000', 3, 5.45, 'Destination AJTHX', 'Walserweg 9012', 'Aache', NULL, '10147', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10392, 59, 2, '20061224 00:00:00.000', '20070121 00:00:00.000', '20070101 00:00:00.000', 3, 122.46, 'Ship to 59-A', 'Geislweg 6789', 'Salzburg', NULL, '10264', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10393, 71, 1, '20061225 00:00:00.000', '20070122 00:00:00.000', '20070103 00:00:00.000', 3, 126.56, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10394, 36, 1, '20061225 00:00:00.000', '20070122 00:00:00.000', '20070103 00:00:00.000', 3, 30.34, 'Destination AWPJG', 'City Center Plaza 2345 Main St.', 'Elgi', 'OR', '10200', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10395, 35, 6, '20061226 00:00:00.000', '20070123 00:00:00.000', '20070103 00:00:00.000', 1, 184.41, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10396, 25, 1, '20061227 00:00:00.000', '20070110 00:00:00.000', '20070106 00:00:00.000', 3, 135.35, 'Destination VAPXU', 'Berliner Platz 0123', 'Münche', NULL, '10168', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10397, 60, 5, '20061227 00:00:00.000', '20070124 00:00:00.000', '20070102 00:00:00.000', 1, 60.26, 'Ship to 60-A', 'Estrada da saúde n. 2345', 'Lisboa', NULL, '10270', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10398, 71, 2, '20061230 00:00:00.000', '20070127 00:00:00.000', '20070109 00:00:00.000', 3, 89.16, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10399, 83, 8, '20061231 00:00:00.000', '20070114 00:00:00.000', '20070108 00:00:00.000', 3, 27.36, 'Ship to 83-C', 'Smagsloget 2345', 'Århus', NULL, '10341', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10400, 19, 1, '20070101 00:00:00.000', '20070129 00:00:00.000', '20070116 00:00:00.000', 3, 83.93, 'Destination BBMRT', '4567 King George', 'Londo', NULL, '10152', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10401, 65, 1, '20070101 00:00:00.000', '20070129 00:00:00.000', '20070110 00:00:00.000', 1, 12.51, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10402, 20, 8, '20070102 00:00:00.000', '20070213 00:00:00.000', '20070110 00:00:00.000', 2, 67.88, 'Destination FFXKT', 'Kirchgasse 0123', 'Graz', NULL, '10158', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10403, 20, 4, '20070103 00:00:00.000', '20070131 00:00:00.000', '20070109 00:00:00.000', 3, 73.79, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10404, 49, 2, '20070103 00:00:00.000', '20070131 00:00:00.000', '20070108 00:00:00.000', 1, 155.97, 'Ship to 49-B', 'Via Ludovico il Moro 9012', 'Bergamo', NULL, '10236', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10405, 47, 1, '20070106 00:00:00.000', '20070203 00:00:00.000', '20070122 00:00:00.000', 1, 34.82, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10406, 62, 7, '20070107 00:00:00.000', '20070218 00:00:00.000', '20070113 00:00:00.000', 1, 108.04, 'Ship to 62-A', 'Alameda dos Canàrios, 8901', 'Sao Paulo', 'SP', '10276', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10407, 56, 2, '20070107 00:00:00.000', '20070204 00:00:00.000', '20070130 00:00:00.000', 2, 91.48, 'Ship to 56-B', 'Mehrheimerstr. 1234', 'Köl', NULL, '10259', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10408, 23, 8, '20070108 00:00:00.000', '20070205 00:00:00.000', '20070114 00:00:00.000', 1, 11.26, 'Destination PXQRR', '5678, chaussée de Tournai', 'Lille', NULL, '10163', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10409, 54, 3, '20070109 00:00:00.000', '20070206 00:00:00.000', '20070114 00:00:00.000', 1, 29.83, 'Ship to 54-C', 'Ing. Gustavo Moncada 6789 Piso 20-A', 'Buenos Aires', NULL, '10254', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10410, 10, 3, '20070110 00:00:00.000', '20070207 00:00:00.000', '20070115 00:00:00.000', 3, 2.40, 'Destination OLSSJ', '2345 Tsawassen Blvd.', 'Tsawasse', 'BC', '10130', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10411, 10, 9, '20070110 00:00:00.000', '20070207 00:00:00.000', '20070121 00:00:00.000', 3, 23.65, 'Destination XJIBQ', '1234 Tsawassen Blvd.', 'Tsawasse', 'BC', '10129', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10412, 87, 8, '20070113 00:00:00.000', '20070210 00:00:00.000', '20070115 00:00:00.000', 2, 3.77, 'Ship to 87-C', 'Torikatu 3456', 'Oulu', NULL, '10352', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10413, 41, 3, '20070114 00:00:00.000', '20070211 00:00:00.000', '20070116 00:00:00.000', 2, 95.66, 'Destination DWJIO', '9012 rue Alsace-Lorraine', 'Toulouse', NULL, '10217', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10414, 21, 2, '20070114 00:00:00.000', '20070211 00:00:00.000', '20070117 00:00:00.000', 3, 21.48, 'Destination SSYXZ', 'Rua Orós, 3456', 'Sao Paulo', 'SP', '10161', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10415, 36, 3, '20070115 00:00:00.000', '20070212 00:00:00.000', '20070124 00:00:00.000', 1, 0.20, 'Destination AWPJG', 'City Center Plaza 2345 Main St.', 'Elgi', 'OR', '10200', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10416, 87, 8, '20070116 00:00:00.000', '20070213 00:00:00.000', '20070127 00:00:00.000', 3, 22.72, 'Ship to 87-A', 'Torikatu 1234', 'Oulu', NULL, '10350', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10417, 73, 4, '20070116 00:00:00.000', '20070213 00:00:00.000', '20070128 00:00:00.000', 3, 70.29, 'Ship to 73-C', 'Vinbæltet 2345', 'Kobenhav', NULL, '10311', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10418, 63, 4, '20070117 00:00:00.000', '20070214 00:00:00.000', '20070124 00:00:00.000', 1, 17.55, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10419, 68, 4, '20070120 00:00:00.000', '20070217 00:00:00.000', '20070130 00:00:00.000', 2, 137.35, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10420, 88, 3, '20070121 00:00:00.000', '20070218 00:00:00.000', '20070127 00:00:00.000', 1, 44.12, 'Ship to 88-C', 'Rua do Mercado, 6789', 'Resende', 'SP', '10355', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10421, 61, 8, '20070121 00:00:00.000', '20070304 00:00:00.000', '20070127 00:00:00.000', 1, 99.23, 'Ship to 61-C', 'Rua da Panificadora, 7890', 'Rio de Janeiro', 'RJ', '10275', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10422, 27, 2, '20070122 00:00:00.000', '20070219 00:00:00.000', '20070131 00:00:00.000', 1, 3.02, 'Destination FFLQT', 'Via Monte Bianco 6789', 'Torino', NULL, '10174', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10423, 31, 6, '20070123 00:00:00.000', '20070206 00:00:00.000', '20070224 00:00:00.000', 3, 24.50, 'Destination VNIAG', 'Av. Brasil, 9012', 'Campinas', 'SP', '10187', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10424, 51, 7, '20070123 00:00:00.000', '20070220 00:00:00.000', '20070127 00:00:00.000', 2, 370.61, 'Ship to 51-C', '8901 rue St. Laurent', 'Montréal', 'Québec', '10246', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10425, 41, 6, '20070124 00:00:00.000', '20070221 00:00:00.000', '20070214 00:00:00.000', 2, 7.93, 'Destination DWJIO', '9012 rue Alsace-Lorraine', 'Toulouse', NULL, '10217', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10426, 29, 4, '20070127 00:00:00.000', '20070224 00:00:00.000', '20070206 00:00:00.000', 1, 18.69, 'Destination WOFLH', 'Rambla de Cataluña, 1234', 'Barcelona', NULL, '10179', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10427, 59, 4, '20070127 00:00:00.000', '20070224 00:00:00.000', '20070303 00:00:00.000', 2, 31.29, 'Ship to 59-C', 'Geislweg 8901', 'Salzburg', NULL, '10266', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10428, 66, 7, '20070128 00:00:00.000', '20070225 00:00:00.000', '20070204 00:00:00.000', 1, 11.09, 'Ship to 66-C', 'Strada Provinciale 2345', 'Reggio Emilia', NULL, '10290', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10429, 37, 3, '20070129 00:00:00.000', '20070312 00:00:00.000', '20070207 00:00:00.000', 2, 56.63, 'Destination DGKOU', '6789 Johnstown Road', 'Cork', 'Co. Cork', '10204', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10430, 20, 4, '20070130 00:00:00.000', '20070213 00:00:00.000', '20070203 00:00:00.000', 1, 458.78, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10431, 10, 4, '20070130 00:00:00.000', '20070213 00:00:00.000', '20070207 00:00:00.000', 2, 44.17, 'Destination OLSSJ', '2345 Tsawassen Blvd.', 'Tsawasse', 'BC', '10130', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10432, 75, 3, '20070131 00:00:00.000', '20070214 00:00:00.000', '20070207 00:00:00.000', 2, 4.34, 'Ship to 75-A', 'P.O. Box 5678', 'Lander', 'WY', '10314', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10433, 60, 3, '20070203 00:00:00.000', '20070303 00:00:00.000', '20070304 00:00:00.000', 3, 73.83, 'Ship to 60-A', 'Estrada da saúde n. 2345', 'Lisboa', NULL, '10270', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10434, 24, 3, '20070203 00:00:00.000', '20070303 00:00:00.000', '20070213 00:00:00.000', 2, 17.92, 'Destination NCKKO', 'Åkergatan 7890', 'Bräcke', NULL, '10165', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10435, 16, 8, '20070204 00:00:00.000', '20070318 00:00:00.000', '20070207 00:00:00.000', 2, 9.21, 'Destination QKQNB', 'Berkeley Gardens 5678  Brewery', 'Londo', NULL, '10143', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10436, 7, 3, '20070205 00:00:00.000', '20070305 00:00:00.000', '20070211 00:00:00.000', 2, 156.66, 'Ship to 7-C', '2345, place Kléber', 'Strasbourg', NULL, '10331', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10437, 87, 8, '20070205 00:00:00.000', '20070305 00:00:00.000', '20070212 00:00:00.000', 1, 19.97, 'Ship to 87-A', 'Torikatu 1234', 'Oulu', NULL, '10350', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10438, 79, 3, '20070206 00:00:00.000', '20070306 00:00:00.000', '20070214 00:00:00.000', 2, 8.24, 'Ship to 79-A', 'Luisenstr. 7890', 'Münster', NULL, '10326', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10439, 51, 6, '20070207 00:00:00.000', '20070307 00:00:00.000', '20070210 00:00:00.000', 3, 4.07, 'Ship to 51-C', '8901 rue St. Laurent', 'Montréal', 'Québec', '10246', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10440, 71, 4, '20070210 00:00:00.000', '20070310 00:00:00.000', '20070228 00:00:00.000', 2, 86.53, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10441, 55, 3, '20070210 00:00:00.000', '20070324 00:00:00.000', '20070314 00:00:00.000', 2, 73.02, 'Ship to 55-C', '9012 Bering St.', 'Anchorage', 'AK', '10257', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10442, 20, 3, '20070211 00:00:00.000', '20070311 00:00:00.000', '20070218 00:00:00.000', 2, 47.94, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10443, 66, 8, '20070212 00:00:00.000', '20070312 00:00:00.000', '20070214 00:00:00.000', 1, 13.95, 'Ship to 66-C', 'Strada Provinciale 2345', 'Reggio Emilia', NULL, '10290', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10444, 5, 3, '20070212 00:00:00.000', '20070312 00:00:00.000', '20070221 00:00:00.000', 3, 3.50, 'Ship to 5-B', 'Berguvsvägen  0123', 'Luleå', NULL, '10268', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10445, 5, 3, '20070213 00:00:00.000', '20070313 00:00:00.000', '20070220 00:00:00.000', 1, 9.30, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10446, 79, 6, '20070214 00:00:00.000', '20070314 00:00:00.000', '20070219 00:00:00.000', 1, 14.68, 'Ship to 79-C', 'Luisenstr. 9012', 'Münster', NULL, '10328', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10447, 67, 4, '20070214 00:00:00.000', '20070314 00:00:00.000', '20070307 00:00:00.000', 2, 68.66, 'Ship to 67-C', 'Av. Copacabana, 5678', 'Rio de Janeiro', 'RJ', '10293', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10448, 64, 4, '20070217 00:00:00.000', '20070317 00:00:00.000', '20070224 00:00:00.000', 2, 38.82, 'Ship to 64-A', 'Av. del Libertador 4567', 'Buenos Aires', NULL, '10282', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10449, 7, 3, '20070218 00:00:00.000', '20070318 00:00:00.000', '20070227 00:00:00.000', 2, 53.30, 'Ship to 7-C', '2345, place Kléber', 'Strasbourg', NULL, '10331', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10450, 84, 8, '20070219 00:00:00.000', '20070319 00:00:00.000', '20070311 00:00:00.000', 2, 7.23, 'Ship to 84-C', '5678, rue du Commerce', 'Lyo', NULL, '10344', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10451, 63, 4, '20070219 00:00:00.000', '20070305 00:00:00.000', '20070312 00:00:00.000', 3, 189.09, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10452, 71, 8, '20070220 00:00:00.000', '20070320 00:00:00.000', '20070226 00:00:00.000', 1, 140.26, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10453, 4, 1, '20070221 00:00:00.000', '20070321 00:00:00.000', '20070226 00:00:00.000', 2, 25.36, 'Ship to 4-C', 'Brook Farm Stratford St. Mary 2345', 'Colchester', 'Essex', '10240', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10454, 41, 4, '20070221 00:00:00.000', '20070321 00:00:00.000', '20070225 00:00:00.000', 3, 2.74, 'Ship to 41-C', '0123 rue Alsace-Lorraine', 'Toulouse', NULL, '10218', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10455, 87, 8, '20070224 00:00:00.000', '20070407 00:00:00.000', '20070303 00:00:00.000', 2, 180.45, 'Ship to 87-B', 'Torikatu 2345', 'Oulu', NULL, '10351', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10456, 39, 8, '20070225 00:00:00.000', '20070408 00:00:00.000', '20070228 00:00:00.000', 2, 8.12, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10457, 39, 2, '20070225 00:00:00.000', '20070325 00:00:00.000', '20070303 00:00:00.000', 1, 11.57, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10458, 76, 7, '20070226 00:00:00.000', '20070326 00:00:00.000', '20070304 00:00:00.000', 3, 147.06, 'Ship to 76-A', 'Boulevard Tirou, 8901', 'Charleroi', NULL, '10317', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10459, 84, 4, '20070227 00:00:00.000', '20070327 00:00:00.000', '20070228 00:00:00.000', 2, 25.09, 'Ship to 84-B', '4567, rue du Commerce', 'Lyo', NULL, '10343', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10460, 24, 8, '20070228 00:00:00.000', '20070328 00:00:00.000', '20070303 00:00:00.000', 1, 16.27, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10461, 46, 1, '20070228 00:00:00.000', '20070328 00:00:00.000', '20070305 00:00:00.000', 3, 148.61, 'Ship to 46-A', 'Carrera 0123 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10227', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10462, 16, 2, '20070303 00:00:00.000', '20070331 00:00:00.000', '20070318 00:00:00.000', 1, 6.17, 'Destination ARRMM', 'Berkeley Gardens 6789  Brewery', 'Londo', NULL, '10144', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10463, 76, 5, '20070304 00:00:00.000', '20070401 00:00:00.000', '20070306 00:00:00.000', 3, 14.78, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10464, 28, 4, '20070304 00:00:00.000', '20070401 00:00:00.000', '20070314 00:00:00.000', 2, 89.00, 'Destination OTSWR', 'Jardim das rosas n. 9012', 'Lisboa', NULL, '10177', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10465, 83, 1, '20070305 00:00:00.000', '20070402 00:00:00.000', '20070314 00:00:00.000', 3, 145.04, 'Ship to 83-A', 'Smagsloget 0123', 'Århus', NULL, '10339', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10466, 15, 4, '20070306 00:00:00.000', '20070403 00:00:00.000', '20070313 00:00:00.000', 1, 11.93, 'Destination GGSQD', 'Av. dos Lusíadas, 2345', 'Sao Paulo', 'SP', '10140', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10467, 49, 8, '20070306 00:00:00.000', '20070403 00:00:00.000', '20070311 00:00:00.000', 2, 4.93, 'Ship to 49-C', 'Via Ludovico il Moro 0123', 'Bergamo', NULL, '10237', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10468, 39, 3, '20070307 00:00:00.000', '20070404 00:00:00.000', '20070312 00:00:00.000', 3, 44.12, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10469, 89, 1, '20070310 00:00:00.000', '20070407 00:00:00.000', '20070314 00:00:00.000', 1, 60.18, 'Ship to 89-C', '9012 - 12th Ave. S.', 'Seattle', 'WA', '10358', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10470, 9, 4, '20070311 00:00:00.000', '20070408 00:00:00.000', '20070314 00:00:00.000', 2, 64.56, 'Ship to 9-C', '0123, rue des Bouchers', 'Marseille', NULL, '10369', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10471, 11, 2, '20070311 00:00:00.000', '20070408 00:00:00.000', '20070318 00:00:00.000', 3, 45.59, 'Destination NZASL', 'Fauntleroy Circus 5678', 'Londo', NULL, '10133', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10472, 72, 8, '20070312 00:00:00.000', '20070409 00:00:00.000', '20070319 00:00:00.000', 1, 4.20, 'Ship to 72-A', '0123 Wadhurst Rd.', 'Londo', NULL, '10308', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10473, 38, 1, '20070313 00:00:00.000', '20070327 00:00:00.000', '20070321 00:00:00.000', 3, 16.37, 'Destination AXVHD', 'Garden House Crowther Way 9012', 'Cowes', 'Isle of Wight', '10207', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10474, 58, 5, '20070313 00:00:00.000', '20070410 00:00:00.000', '20070321 00:00:00.000', 2, 83.49, 'Ship to 58-C', 'Calle Dr. Jorge Cash 5678', 'México D.F.', NULL, '10263', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10475, 76, 9, '20070314 00:00:00.000', '20070411 00:00:00.000', '20070404 00:00:00.000', 1, 68.52, 'Ship to 76-C', 'Boulevard Tirou, 0123', 'Charleroi', NULL, '10319', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10476, 35, 8, '20070317 00:00:00.000', '20070414 00:00:00.000', '20070324 00:00:00.000', 3, 4.41, 'Destination SXYQX', 'Carrera 0123 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10198', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10477, 60, 5, '20070317 00:00:00.000', '20070414 00:00:00.000', '20070325 00:00:00.000', 2, 13.02, 'Ship to 60-A', 'Estrada da saúde n. 2345', 'Lisboa', NULL, '10270', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10478, 84, 2, '20070318 00:00:00.000', '20070401 00:00:00.000', '20070326 00:00:00.000', 3, 4.81, 'Ship to 84-C', '5678, rue du Commerce', 'Lyo', NULL, '10344', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10479, 65, 3, '20070319 00:00:00.000', '20070416 00:00:00.000', '20070321 00:00:00.000', 3, 708.95, 'Ship to 65-C', '9012 Milton Dr.', 'Albuquerque', 'NM', '10287', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10480, 23, 6, '20070320 00:00:00.000', '20070417 00:00:00.000', '20070324 00:00:00.000', 2, 1.35, 'Destination AGPCO', '6789, chaussée de Tournai', 'Lille', NULL, '10164', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10481, 67, 8, '20070320 00:00:00.000', '20070417 00:00:00.000', '20070325 00:00:00.000', 2, 64.33, 'Ship to 67-A', 'Av. Copacabana, 3456', 'Rio de Janeiro', 'RJ', '10291', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10482, 43, 1, '20070321 00:00:00.000', '20070418 00:00:00.000', '20070410 00:00:00.000', 3, 7.48, 'Ship to 43-B', '3456 Orchestra Terrace', 'Walla Walla', 'WA', '10221', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10483, 89, 7, '20070324 00:00:00.000', '20070421 00:00:00.000', '20070425 00:00:00.000', 2, 15.28, 'Ship to 89-A', '7890 - 12th Ave. S.', 'Seattle', 'WA', '10356', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10484, 11, 3, '20070324 00:00:00.000', '20070421 00:00:00.000', '20070401 00:00:00.000', 3, 6.88, 'Destination DLEU', 'Fauntleroy Circus 4567', 'Londo', NULL, '10132', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10485, 47, 4, '20070325 00:00:00.000', '20070408 00:00:00.000', '20070331 00:00:00.000', 2, 64.45, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10486, 35, 1, '20070326 00:00:00.000', '20070423 00:00:00.000', '20070402 00:00:00.000', 2, 30.53, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10487, 62, 2, '20070326 00:00:00.000', '20070423 00:00:00.000', '20070328 00:00:00.000', 2, 71.07, 'Ship to 62-B', 'Alameda dos Canàrios, 9012', 'Sao Paulo', 'SP', '10277', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10488, 25, 8, '20070327 00:00:00.000', '20070424 00:00:00.000', '20070402 00:00:00.000', 2, 4.93, 'Destination VAPXU', 'Berliner Platz 0123', 'Münche', NULL, '10168', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10489, 59, 6, '20070328 00:00:00.000', '20070425 00:00:00.000', '20070409 00:00:00.000', 2, 5.29, 'Ship to 59-C', 'Geislweg 8901', 'Salzburg', NULL, '10266', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10490, 35, 7, '20070331 00:00:00.000', '20070428 00:00:00.000', '20070403 00:00:00.000', 2, 210.19, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10491, 28, 8, '20070331 00:00:00.000', '20070428 00:00:00.000', '20070408 00:00:00.000', 3, 16.96, 'Destination OTSWR', 'Jardim das rosas n. 9012', 'Lisboa', NULL, '10177', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10492, 10, 3, '20070401 00:00:00.000', '20070429 00:00:00.000', '20070411 00:00:00.000', 1, 62.89, 'Destination XJIBQ', '1234 Tsawassen Blvd.', 'Tsawasse', 'BC', '10129', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10493, 41, 4, '20070402 00:00:00.000', '20070430 00:00:00.000', '20070410 00:00:00.000', 3, 10.64, 'Destination OLJND', '8901 rue Alsace-Lorraine', 'Toulouse', NULL, '10216', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10494, 15, 4, '20070402 00:00:00.000', '20070430 00:00:00.000', '20070409 00:00:00.000', 2, 65.99, 'Destination EVHYA', 'Av. dos Lusíadas, 3456', 'Sao Paulo', 'SP', '10141', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10495, 42, 3, '20070403 00:00:00.000', '20070501 00:00:00.000', '20070411 00:00:00.000', 3, 4.65, 'Ship to 42-C', '2345 Elm St.', 'Vancouver', 'BC', '10220', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10496, 81, 7, '20070404 00:00:00.000', '20070502 00:00:00.000', '20070407 00:00:00.000', 2, 46.77, 'Ship to 81-C', 'Av. Inês de Castro, 7890', 'Sao Paulo', 'SP', '10336', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10497, 44, 7, '20070404 00:00:00.000', '20070502 00:00:00.000', '20070407 00:00:00.000', 1, 36.21, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10498, 35, 8, '20070407 00:00:00.000', '20070505 00:00:00.000', '20070411 00:00:00.000', 2, 29.75, 'Destination SXYQX', 'Carrera 0123 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10198', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10499, 46, 4, '20070408 00:00:00.000', '20070506 00:00:00.000', '20070416 00:00:00.000', 2, 102.02, 'Ship to 46-C', 'Carrera 2345 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10229', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10500, 41, 6, '20070409 00:00:00.000', '20070507 00:00:00.000', '20070417 00:00:00.000', 1, 42.68, 'Destination OLJND', '8901 rue Alsace-Lorraine', 'Toulouse', NULL, '10216', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10501, 6, 9, '20070409 00:00:00.000', '20070507 00:00:00.000', '20070416 00:00:00.000', 3, 8.85, 'Ship to 6-C', 'Forsterstr. 4567', 'Mannheim', NULL, '10302', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10502, 58, 2, '20070410 00:00:00.000', '20070508 00:00:00.000', '20070429 00:00:00.000', 1, 69.32, 'Ship to 58-B', 'Calle Dr. Jorge Cash 4567', 'México D.F.', NULL, '10262', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10503, 37, 6, '20070411 00:00:00.000', '20070509 00:00:00.000', '20070416 00:00:00.000', 2, 16.74, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10504, 89, 4, '20070411 00:00:00.000', '20070509 00:00:00.000', '20070418 00:00:00.000', 3, 59.13, 'Ship to 89-B', '8901 - 12th Ave. S.', 'Seattle', 'WA', '10357', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10505, 51, 3, '20070414 00:00:00.000', '20070512 00:00:00.000', '20070421 00:00:00.000', 3, 7.13, 'Ship to 51-B', '7890 rue St. Laurent', 'Montréal', 'Québec', '10245', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10506, 39, 9, '20070415 00:00:00.000', '20070513 00:00:00.000', '20070502 00:00:00.000', 2, 21.19, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10507, 3, 7, '20070415 00:00:00.000', '20070513 00:00:00.000', '20070422 00:00:00.000', 1, 47.45, 'Destination FQFLS', 'Mataderos  3456', 'México D.F.', NULL, '10211', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10508, 56, 1, '20070416 00:00:00.000', '20070514 00:00:00.000', '20070513 00:00:00.000', 2, 4.99, 'Ship to 56-C', 'Mehrheimerstr. 2345', 'Köl', NULL, '10260', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10509, 6, 4, '20070417 00:00:00.000', '20070515 00:00:00.000', '20070429 00:00:00.000', 1, 0.15, 'Ship to 6-A', 'Forsterstr. 2345', 'Mannheim', NULL, '10300', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10510, 71, 6, '20070418 00:00:00.000', '20070516 00:00:00.000', '20070428 00:00:00.000', 3, 367.63, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10511, 9, 4, '20070418 00:00:00.000', '20070516 00:00:00.000', '20070421 00:00:00.000', 3, 350.64, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10512, 21, 7, '20070421 00:00:00.000', '20070519 00:00:00.000', '20070424 00:00:00.000', 2, 3.53, 'Destination RNSMS', 'Rua Orós, 2345', 'Sao Paulo', 'SP', '10160', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10513, 86, 7, '20070422 00:00:00.000', '20070603 00:00:00.000', '20070428 00:00:00.000', 1, 105.65, 'Ship to 86-A', 'Adenauerallee 8901', 'Stuttgart', NULL, '10347', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10514, 20, 3, '20070422 00:00:00.000', '20070520 00:00:00.000', '20070516 00:00:00.000', 2, 789.95, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10515, 63, 2, '20070423 00:00:00.000', '20070507 00:00:00.000', '20070523 00:00:00.000', 1, 204.47, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10516, 37, 2, '20070424 00:00:00.000', '20070522 00:00:00.000', '20070501 00:00:00.000', 3, 62.78, 'Destination DGKOU', '6789 Johnstown Road', 'Cork', 'Co. Cork', '10204', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10517, 53, 3, '20070424 00:00:00.000', '20070522 00:00:00.000', '20070429 00:00:00.000', 3, 32.07, 'Ship to 53-A', 'South House 2345 Queensbridge', 'Londo', NULL, '10250', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10518, 80, 4, '20070425 00:00:00.000', '20070509 00:00:00.000', '20070505 00:00:00.000', 2, 218.15, 'Ship to 80-B', 'Avda. Azteca 4567', 'México D.F.', NULL, '10333', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10519, 14, 6, '20070428 00:00:00.000', '20070526 00:00:00.000', '20070501 00:00:00.000', 3, 91.76, 'Destination NRTZZ', 'Hauptstr. 0123', 'Ber', NULL, '10138', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10520, 70, 7, '20070429 00:00:00.000', '20070527 00:00:00.000', '20070501 00:00:00.000', 1, 13.37, 'Ship to 70-B', 'Erling Skakkes gate 5678', 'Staver', NULL, '10303', 'Norway');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10521, 12, 8, '20070429 00:00:00.000', '20070527 00:00:00.000', '20070502 00:00:00.000', 2, 17.22, 'Destination QTHBC', 'Cerrito 6789', 'Buenos Aires', NULL, '10134', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10522, 44, 4, '20070430 00:00:00.000', '20070528 00:00:00.000', '20070506 00:00:00.000', 1, 45.33, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10523, 72, 7, '20070501 00:00:00.000', '20070529 00:00:00.000', '20070530 00:00:00.000', 2, 77.63, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10524, 5, 1, '20070501 00:00:00.000', '20070529 00:00:00.000', '20070507 00:00:00.000', 2, 244.79, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10525, 9, 1, '20070502 00:00:00.000', '20070530 00:00:00.000', '20070523 00:00:00.000', 2, 11.06, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10526, 87, 4, '20070505 00:00:00.000', '20070602 00:00:00.000', '20070515 00:00:00.000', 2, 58.59, 'Ship to 87-C', 'Torikatu 3456', 'Oulu', NULL, '10352', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10527, 63, 7, '20070505 00:00:00.000', '20070602 00:00:00.000', '20070507 00:00:00.000', 1, 41.90, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10528, 32, 6, '20070506 00:00:00.000', '20070520 00:00:00.000', '20070509 00:00:00.000', 2, 3.35, 'Destination LLUXZ', '1234 Baker Blvd.', 'Eugene', 'OR', '10189', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10529, 50, 5, '20070507 00:00:00.000', '20070604 00:00:00.000', '20070509 00:00:00.000', 2, 66.69, 'Ship to 50-B', 'Rue Joseph-Bens 4567', 'Bruxelles', NULL, '10242', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10530, 59, 3, '20070508 00:00:00.000', '20070605 00:00:00.000', '20070512 00:00:00.000', 2, 339.22, 'Ship to 59-C', 'Geislweg 8901', 'Salzburg', NULL, '10266', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10531, 54, 7, '20070508 00:00:00.000', '20070605 00:00:00.000', '20070519 00:00:00.000', 1, 8.12, 'Ship to 54-A', 'Ing. Gustavo Moncada 4567 Piso 20-A', 'Buenos Aires', NULL, '10252', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10532, 19, 7, '20070509 00:00:00.000', '20070606 00:00:00.000', '20070512 00:00:00.000', 3, 74.46, 'Destination QTKCU', '3456 King George', 'Londo', NULL, '10151', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10533, 24, 8, '20070512 00:00:00.000', '20070609 00:00:00.000', '20070522 00:00:00.000', 1, 188.04, 'Destination KBSB', 'Åkergatan 9012', 'Bräcke', NULL, '10167', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10534, 44, 8, '20070512 00:00:00.000', '20070609 00:00:00.000', '20070514 00:00:00.000', 2, 27.94, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10535, 3, 4, '20070513 00:00:00.000', '20070610 00:00:00.000', '20070521 00:00:00.000', 1, 15.64, 'Destination FQFLS', 'Mataderos  3456', 'México D.F.', NULL, '10211', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10536, 44, 3, '20070514 00:00:00.000', '20070611 00:00:00.000', '20070606 00:00:00.000', 2, 58.88, 'Ship to 44-B', 'Magazinweg 5678', 'Frankfurt a.M.', NULL, '10223', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10537, 68, 1, '20070514 00:00:00.000', '20070528 00:00:00.000', '20070519 00:00:00.000', 1, 78.85, 'Ship to 68-B', 'Starenweg 7890', 'Genève', NULL, '10295', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10538, 11, 9, '20070515 00:00:00.000', '20070612 00:00:00.000', '20070516 00:00:00.000', 3, 4.87, 'Destination DLEU', 'Fauntleroy Circus 4567', 'Londo', NULL, '10132', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10539, 11, 6, '20070516 00:00:00.000', '20070613 00:00:00.000', '20070523 00:00:00.000', 3, 12.36, 'Destination DLEU', 'Fauntleroy Circus 4567', 'Londo', NULL, '10132', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10540, 63, 3, '20070519 00:00:00.000', '20070616 00:00:00.000', '20070613 00:00:00.000', 3, 1007.64, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10541, 34, 2, '20070519 00:00:00.000', '20070616 00:00:00.000', '20070529 00:00:00.000', 1, 68.65, 'Destination SCQXA', 'Rua do Paço, 7890', 'Rio de Janeiro', 'RJ', '10195', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10542, 39, 1, '20070520 00:00:00.000', '20070617 00:00:00.000', '20070526 00:00:00.000', 3, 10.95, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10543, 46, 8, '20070521 00:00:00.000', '20070618 00:00:00.000', '20070523 00:00:00.000', 2, 48.17, 'Ship to 46-B', 'Carrera 1234 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10228', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10544, 48, 4, '20070521 00:00:00.000', '20070618 00:00:00.000', '20070530 00:00:00.000', 1, 24.91, 'Ship to 48-C', '7890 Chiaroscuro Rd.', 'Portland', 'OR', '10234', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10545, 43, 8, '20070522 00:00:00.000', '20070619 00:00:00.000', '20070626 00:00:00.000', 2, 11.92, 'Ship to 43-B', '3456 Orchestra Terrace', 'Walla Walla', 'WA', '10221', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10546, 84, 1, '20070523 00:00:00.000', '20070620 00:00:00.000', '20070527 00:00:00.000', 3, 194.72, 'Ship to 84-C', '5678, rue du Commerce', 'Lyo', NULL, '10344', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10547, 72, 3, '20070523 00:00:00.000', '20070620 00:00:00.000', '20070602 00:00:00.000', 2, 178.43, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10548, 79, 3, '20070526 00:00:00.000', '20070623 00:00:00.000', '20070602 00:00:00.000', 2, 1.43, 'Ship to 79-A', 'Luisenstr. 7890', 'Münster', NULL, '10326', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10549, 63, 5, '20070527 00:00:00.000', '20070610 00:00:00.000', '20070530 00:00:00.000', 1, 171.24, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10550, 30, 7, '20070528 00:00:00.000', '20070625 00:00:00.000', '20070606 00:00:00.000', 3, 4.32, 'Destination GGQIR', 'C/ Romero, 6789', 'Sevilla', NULL, '10184', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10551, 28, 4, '20070528 00:00:00.000', '20070709 00:00:00.000', '20070606 00:00:00.000', 3, 72.95, 'Destination OTSWR', 'Jardim das rosas n. 9012', 'Lisboa', NULL, '10177', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10552, 35, 2, '20070529 00:00:00.000', '20070626 00:00:00.000', '20070605 00:00:00.000', 1, 83.22, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10553, 87, 2, '20070530 00:00:00.000', '20070627 00:00:00.000', '20070603 00:00:00.000', 2, 149.49, 'Ship to 87-B', 'Torikatu 2345', 'Oulu', NULL, '10351', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10554, 56, 4, '20070530 00:00:00.000', '20070627 00:00:00.000', '20070605 00:00:00.000', 3, 120.97, 'Ship to 56-C', 'Mehrheimerstr. 2345', 'Köl', NULL, '10260', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10555, 71, 6, '20070602 00:00:00.000', '20070630 00:00:00.000', '20070604 00:00:00.000', 3, 252.49, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10556, 73, 2, '20070603 00:00:00.000', '20070715 00:00:00.000', '20070613 00:00:00.000', 1, 9.80, 'Ship to 73-A', 'Vinbæltet 1234', 'Kobenhav', NULL, '10310', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10557, 44, 9, '20070603 00:00:00.000', '20070617 00:00:00.000', '20070606 00:00:00.000', 2, 96.72, 'Ship to 44-C', 'Magazinweg 6789', 'Frankfurt a.M.', NULL, '10224', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10558, 4, 1, '20070604 00:00:00.000', '20070702 00:00:00.000', '20070610 00:00:00.000', 2, 72.97, 'Ship to 4-B', 'Brook Farm Stratford St. Mary 1234', 'Colchester', 'Essex', '10239', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10559, 7, 6, '20070605 00:00:00.000', '20070703 00:00:00.000', '20070613 00:00:00.000', 1, 8.05, 'Ship to 7-B', '1234, place Kléber', 'Strasbourg', NULL, '10330', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10560, 25, 8, '20070606 00:00:00.000', '20070704 00:00:00.000', '20070609 00:00:00.000', 1, 36.65, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10561, 24, 2, '20070606 00:00:00.000', '20070704 00:00:00.000', '20070609 00:00:00.000', 2, 242.21, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10562, 66, 1, '20070609 00:00:00.000', '20070707 00:00:00.000', '20070612 00:00:00.000', 1, 22.95, 'Ship to 66-B', 'Strada Provinciale 1234', 'Reggio Emilia', NULL, '10289', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10563, 67, 2, '20070610 00:00:00.000', '20070722 00:00:00.000', '20070624 00:00:00.000', 2, 60.43, 'Ship to 67-B', 'Av. Copacabana, 4567', 'Rio de Janeiro', 'RJ', '10292', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10564, 65, 4, '20070610 00:00:00.000', '20070708 00:00:00.000', '20070616 00:00:00.000', 3, 13.75, 'Ship to 65-B', '8901 Milton Dr.', 'Albuquerque', 'NM', '10286', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10565, 51, 8, '20070611 00:00:00.000', '20070709 00:00:00.000', '20070618 00:00:00.000', 2, 7.15, 'Ship to 51-C', '8901 rue St. Laurent', 'Montréal', 'Québec', '10246', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10566, 7, 9, '20070612 00:00:00.000', '20070710 00:00:00.000', '20070618 00:00:00.000', 1, 88.40, 'Ship to 7-C', '2345, place Kléber', 'Strasbourg', NULL, '10331', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10567, 37, 1, '20070612 00:00:00.000', '20070710 00:00:00.000', '20070617 00:00:00.000', 1, 33.97, 'Destination DGKOU', '6789 Johnstown Road', 'Cork', 'Co. Cork', '10204', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10568, 29, 3, '20070613 00:00:00.000', '20070711 00:00:00.000', '20070709 00:00:00.000', 3, 6.54, 'Destination VPNNG', 'Rambla de Cataluña, 0123', 'Barcelona', NULL, '10178', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10569, 65, 5, '20070616 00:00:00.000', '20070714 00:00:00.000', '20070711 00:00:00.000', 1, 58.98, 'Ship to 65-B', '8901 Milton Dr.', 'Albuquerque', 'NM', '10286', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10570, 51, 3, '20070617 00:00:00.000', '20070715 00:00:00.000', '20070619 00:00:00.000', 3, 188.99, 'Ship to 51-C', '8901 rue St. Laurent', 'Montréal', 'Québec', '10246', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10571, 20, 8, '20070617 00:00:00.000', '20070729 00:00:00.000', '20070704 00:00:00.000', 3, 26.06, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10572, 5, 3, '20070618 00:00:00.000', '20070716 00:00:00.000', '20070625 00:00:00.000', 2, 116.43, 'Ship to 5-B', 'Berguvsvägen  0123', 'Luleå', NULL, '10268', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10573, 3, 7, '20070619 00:00:00.000', '20070717 00:00:00.000', '20070620 00:00:00.000', 3, 84.84, 'Destination LA', 'Mataderos  4567', 'México D.F.', NULL, '10212', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10574, 82, 4, '20070619 00:00:00.000', '20070717 00:00:00.000', '20070630 00:00:00.000', 2, 37.60, 'Ship to 82-A', '8901 DaVinci Blvd.', 'Kirkland', 'WA', '10337', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10575, 52, 5, '20070620 00:00:00.000', '20070704 00:00:00.000', '20070630 00:00:00.000', 1, 127.34, 'Ship to 52-C', 'Heerstr. 1234', 'Leipzig', NULL, '10249', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10576, 80, 3, '20070623 00:00:00.000', '20070707 00:00:00.000', '20070630 00:00:00.000', 3, 18.56, 'Ship to 80-C', 'Avda. Azteca 5678', 'México D.F.', NULL, '10334', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10577, 82, 9, '20070623 00:00:00.000', '20070804 00:00:00.000', '20070630 00:00:00.000', 2, 25.41, 'Ship to 82-B', '9012 DaVinci Blvd.', 'Kirkland', 'WA', '10338', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10578, 11, 4, '20070624 00:00:00.000', '20070722 00:00:00.000', '20070725 00:00:00.000', 3, 29.60, 'Destination NZASL', 'Fauntleroy Circus 5678', 'Londo', NULL, '10133', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10579, 45, 1, '20070625 00:00:00.000', '20070723 00:00:00.000', '20070704 00:00:00.000', 2, 13.73, 'Ship to 45-C', '9012 Polk St. Suite 5', 'San Francisco', 'CA', '10226', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10580, 56, 4, '20070626 00:00:00.000', '20070724 00:00:00.000', '20070701 00:00:00.000', 3, 75.89, 'Ship to 56-C', 'Mehrheimerstr. 2345', 'Köl', NULL, '10260', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10581, 21, 3, '20070626 00:00:00.000', '20070724 00:00:00.000', '20070702 00:00:00.000', 1, 3.01, 'Destination SSYXZ', 'Rua Orós, 3456', 'Sao Paulo', 'SP', '10161', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10582, 6, 3, '20070627 00:00:00.000', '20070725 00:00:00.000', '20070714 00:00:00.000', 2, 27.71, 'Ship to 6-A', 'Forsterstr. 2345', 'Mannheim', NULL, '10300', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10583, 87, 2, '20070630 00:00:00.000', '20070728 00:00:00.000', '20070704 00:00:00.000', 2, 7.28, 'Ship to 87-C', 'Torikatu 3456', 'Oulu', NULL, '10352', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10584, 7, 4, '20070630 00:00:00.000', '20070728 00:00:00.000', '20070704 00:00:00.000', 1, 59.14, 'Ship to 7-B', '1234, place Kléber', 'Strasbourg', NULL, '10330', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10585, 88, 7, '20070701 00:00:00.000', '20070729 00:00:00.000', '20070710 00:00:00.000', 1, 13.41, 'Ship to 88-A', 'Rua do Mercado, 4567', 'Resende', 'SP', '10353', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10586, 66, 9, '20070702 00:00:00.000', '20070730 00:00:00.000', '20070709 00:00:00.000', 1, 0.48, 'Ship to 66-B', 'Strada Provinciale 1234', 'Reggio Emilia', NULL, '10289', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10587, 61, 1, '20070702 00:00:00.000', '20070730 00:00:00.000', '20070709 00:00:00.000', 1, 62.52, 'Ship to 61-C', 'Rua da Panificadora, 7890', 'Rio de Janeiro', 'RJ', '10275', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10588, 63, 2, '20070703 00:00:00.000', '20070731 00:00:00.000', '20070710 00:00:00.000', 3, 194.67, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10589, 32, 8, '20070704 00:00:00.000', '20070801 00:00:00.000', '20070714 00:00:00.000', 2, 4.42, 'Destination AVQUS', '2345 Baker Blvd.', 'Eugene', 'OR', '10190', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10590, 51, 4, '20070707 00:00:00.000', '20070804 00:00:00.000', '20070714 00:00:00.000', 3, 44.77, 'Ship to 51-B', '7890 rue St. Laurent', 'Montréal', 'Québec', '10245', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10591, 83, 1, '20070707 00:00:00.000', '20070721 00:00:00.000', '20070716 00:00:00.000', 1, 55.92, 'Ship to 83-A', 'Smagsloget 0123', 'Århus', NULL, '10339', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10592, 44, 3, '20070708 00:00:00.000', '20070805 00:00:00.000', '20070716 00:00:00.000', 1, 32.10, 'Ship to 44-B', 'Magazinweg 5678', 'Frankfurt a.M.', NULL, '10223', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10593, 44, 7, '20070709 00:00:00.000', '20070806 00:00:00.000', '20070813 00:00:00.000', 2, 174.20, 'Ship to 44-C', 'Magazinweg 6789', 'Frankfurt a.M.', NULL, '10224', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10594, 55, 3, '20070709 00:00:00.000', '20070806 00:00:00.000', '20070716 00:00:00.000', 2, 5.24, 'Ship to 55-B', '8901 Bering St.', 'Anchorage', 'AK', '10256', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10595, 20, 2, '20070710 00:00:00.000', '20070807 00:00:00.000', '20070714 00:00:00.000', 1, 96.78, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10596, 89, 8, '20070711 00:00:00.000', '20070808 00:00:00.000', '20070812 00:00:00.000', 1, 16.34, 'Ship to 89-C', '9012 - 12th Ave. S.', 'Seattle', 'WA', '10358', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10597, 59, 7, '20070711 00:00:00.000', '20070808 00:00:00.000', '20070718 00:00:00.000', 3, 35.12, 'Ship to 59-B', 'Geislweg 7890', 'Salzburg', NULL, '10265', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10598, 65, 1, '20070714 00:00:00.000', '20070811 00:00:00.000', '20070718 00:00:00.000', 3, 44.42, 'Ship to 65-C', '9012 Milton Dr.', 'Albuquerque', 'NM', '10287', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10599, 11, 6, '20070715 00:00:00.000', '20070826 00:00:00.000', '20070721 00:00:00.000', 3, 29.98, 'Destination DLEU', 'Fauntleroy Circus 4567', 'Londo', NULL, '10132', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10600, 36, 4, '20070716 00:00:00.000', '20070813 00:00:00.000', '20070721 00:00:00.000', 1, 45.13, 'Destination HOHCR', 'City Center Plaza 3456 Main St.', 'Elgi', 'OR', '10201', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10601, 35, 7, '20070716 00:00:00.000', '20070827 00:00:00.000', '20070722 00:00:00.000', 1, 58.30, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10602, 83, 8, '20070717 00:00:00.000', '20070814 00:00:00.000', '20070722 00:00:00.000', 2, 2.92, 'Ship to 83-A', 'Smagsloget 0123', 'Århus', NULL, '10339', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10603, 71, 8, '20070718 00:00:00.000', '20070815 00:00:00.000', '20070808 00:00:00.000', 2, 48.77, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10604, 28, 1, '20070718 00:00:00.000', '20070815 00:00:00.000', '20070729 00:00:00.000', 1, 7.46, 'Destination CIRQO', 'Jardim das rosas n. 8901', 'Lisboa', NULL, '10176', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10605, 51, 1, '20070721 00:00:00.000', '20070818 00:00:00.000', '20070729 00:00:00.000', 2, 379.13, 'Ship to 51-B', '7890 rue St. Laurent', 'Montréal', 'Québec', '10245', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10606, 81, 4, '20070722 00:00:00.000', '20070819 00:00:00.000', '20070731 00:00:00.000', 3, 79.40, 'Ship to 81-C', 'Av. Inês de Castro, 7890', 'Sao Paulo', 'SP', '10336', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10607, 71, 5, '20070722 00:00:00.000', '20070819 00:00:00.000', '20070725 00:00:00.000', 1, 200.24, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10608, 79, 4, '20070723 00:00:00.000', '20070820 00:00:00.000', '20070801 00:00:00.000', 2, 27.79, 'Ship to 79-C', 'Luisenstr. 9012', 'Münster', NULL, '10328', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10609, 18, 7, '20070724 00:00:00.000', '20070821 00:00:00.000', '20070730 00:00:00.000', 2, 1.85, 'Destination SNPXM', '0123, rue des Cinquante Otages', 'Nantes', NULL, '10148', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10610, 41, 8, '20070725 00:00:00.000', '20070822 00:00:00.000', '20070806 00:00:00.000', 1, 26.78, 'Ship to 41-C', '0123 rue Alsace-Lorraine', 'Toulouse', NULL, '10218', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10611, 91, 6, '20070725 00:00:00.000', '20070822 00:00:00.000', '20070801 00:00:00.000', 2, 80.65, 'Ship to 91-B', 'ul. Filtrowa 6789', 'Warszawa', NULL, '10365', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10612, 71, 1, '20070728 00:00:00.000', '20070825 00:00:00.000', '20070801 00:00:00.000', 2, 544.08, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10613, 35, 4, '20070729 00:00:00.000', '20070826 00:00:00.000', '20070801 00:00:00.000', 2, 8.11, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10614, 6, 8, '20070729 00:00:00.000', '20070826 00:00:00.000', '20070801 00:00:00.000', 3, 1.93, 'Ship to 6-A', 'Forsterstr. 2345', 'Mannheim', NULL, '10300', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10615, 90, 2, '20070730 00:00:00.000', '20070827 00:00:00.000', '20070806 00:00:00.000', 3, 0.75, 'Ship to 90-B', 'Keskuskatu 3456', 'Helsinki', NULL, '10362', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10616, 32, 1, '20070731 00:00:00.000', '20070828 00:00:00.000', '20070805 00:00:00.000', 2, 116.53, 'Destination LLUXZ', '1234 Baker Blvd.', 'Eugene', 'OR', '10189', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10617, 32, 4, '20070731 00:00:00.000', '20070828 00:00:00.000', '20070804 00:00:00.000', 2, 18.53, 'Destination AVQUS', '2345 Baker Blvd.', 'Eugene', 'OR', '10190', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10618, 51, 1, '20070801 00:00:00.000', '20070912 00:00:00.000', '20070808 00:00:00.000', 1, 154.68, 'Ship to 51-C', '8901 rue St. Laurent', 'Montréal', 'Québec', '10246', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10619, 51, 3, '20070804 00:00:00.000', '20070901 00:00:00.000', '20070807 00:00:00.000', 3, 91.05, 'Ship to 51-B', '7890 rue St. Laurent', 'Montréal', 'Québec', '10245', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10620, 42, 2, '20070805 00:00:00.000', '20070902 00:00:00.000', '20070814 00:00:00.000', 3, 0.94, 'Ship to 42-A', '1234 Elm St.', 'Vancouver', 'BC', '10219', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10621, 38, 4, '20070805 00:00:00.000', '20070902 00:00:00.000', '20070811 00:00:00.000', 2, 23.73, 'Destination LMVGS', 'Garden House Crowther Way 8901', 'Cowes', 'Isle of Wight', '10206', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10622, 67, 4, '20070806 00:00:00.000', '20070903 00:00:00.000', '20070811 00:00:00.000', 3, 50.97, 'Ship to 67-A', 'Av. Copacabana, 3456', 'Rio de Janeiro', 'RJ', '10291', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10623, 25, 8, '20070807 00:00:00.000', '20070904 00:00:00.000', '20070812 00:00:00.000', 2, 97.18, 'Destination VAPXU', 'Berliner Platz 0123', 'Münche', NULL, '10168', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10624, 78, 4, '20070807 00:00:00.000', '20070904 00:00:00.000', '20070819 00:00:00.000', 2, 94.80, 'Ship to 78-C', '6789 Grizzly Peak Rd.', 'Butte', 'MT', '10325', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10625, 2, 3, '20070808 00:00:00.000', '20070905 00:00:00.000', '20070814 00:00:00.000', 1, 43.90, 'Destination QOTQA', 'Avda. de la Constitución 3456', 'México D.F.', NULL, '10181', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10626, 5, 1, '20070811 00:00:00.000', '20070908 00:00:00.000', '20070820 00:00:00.000', 2, 138.69, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10627, 71, 8, '20070811 00:00:00.000', '20070922 00:00:00.000', '20070821 00:00:00.000', 3, 107.46, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10628, 7, 4, '20070812 00:00:00.000', '20070909 00:00:00.000', '20070820 00:00:00.000', 3, 30.36, 'Ship to 7-B', '1234, place Kléber', 'Strasbourg', NULL, '10330', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10629, 30, 4, '20070812 00:00:00.000', '20070909 00:00:00.000', '20070820 00:00:00.000', 3, 85.46, 'Destination IIYDD', 'C/ Romero, 5678', 'Sevilla', NULL, '10183', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10630, 39, 1, '20070813 00:00:00.000', '20070910 00:00:00.000', '20070819 00:00:00.000', 2, 32.35, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10631, 41, 8, '20070814 00:00:00.000', '20070911 00:00:00.000', '20070815 00:00:00.000', 1, 0.87, 'Destination OLJND', '8901 rue Alsace-Lorraine', 'Toulouse', NULL, '10216', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10632, 86, 8, '20070814 00:00:00.000', '20070911 00:00:00.000', '20070819 00:00:00.000', 1, 41.38, 'Ship to 86-C', 'Adenauerallee 0123', 'Stuttgart', NULL, '10349', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10633, 20, 7, '20070815 00:00:00.000', '20070912 00:00:00.000', '20070818 00:00:00.000', 3, 477.90, 'Destination FFXKT', 'Kirchgasse 0123', 'Graz', NULL, '10158', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10634, 23, 4, '20070815 00:00:00.000', '20070912 00:00:00.000', '20070821 00:00:00.000', 3, 487.38, 'Destination AGPCO', '6789, chaussée de Tournai', 'Lille', NULL, '10164', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10635, 49, 8, '20070818 00:00:00.000', '20070915 00:00:00.000', '20070821 00:00:00.000', 3, 47.46, 'Ship to 49-A', 'Via Ludovico il Moro 8901', 'Bergamo', NULL, '10235', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10636, 87, 4, '20070819 00:00:00.000', '20070916 00:00:00.000', '20070826 00:00:00.000', 1, 1.15, 'Ship to 87-A', 'Torikatu 1234', 'Oulu', NULL, '10350', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10637, 62, 6, '20070819 00:00:00.000', '20070916 00:00:00.000', '20070826 00:00:00.000', 1, 201.29, 'Ship to 62-C', 'Alameda dos Canàrios, 0123', 'Sao Paulo', 'SP', '10278', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10638, 47, 3, '20070820 00:00:00.000', '20070917 00:00:00.000', '20070901 00:00:00.000', 1, 158.44, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10639, 70, 7, '20070820 00:00:00.000', '20070917 00:00:00.000', '20070827 00:00:00.000', 3, 38.64, 'Ship to 70-B', 'Erling Skakkes gate 5678', 'Staver', NULL, '10303', 'Norway');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10640, 86, 4, '20070821 00:00:00.000', '20070918 00:00:00.000', '20070828 00:00:00.000', 1, 23.55, 'Ship to 86-A', 'Adenauerallee 8901', 'Stuttgart', NULL, '10347', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10641, 35, 4, '20070822 00:00:00.000', '20070919 00:00:00.000', '20070826 00:00:00.000', 2, 179.61, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10642, 73, 7, '20070822 00:00:00.000', '20070919 00:00:00.000', '20070905 00:00:00.000', 3, 41.89, 'Ship to 73-C', 'Vinbæltet 2345', 'Kobenhav', NULL, '10311', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10643, 1, 6, '20070825 00:00:00.000', '20070922 00:00:00.000', '20070902 00:00:00.000', 1, 29.46, 'Destination LOUIE', 'Obere Str. 6789', 'Berli', NULL, '10154', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10644, 88, 3, '20070825 00:00:00.000', '20070922 00:00:00.000', '20070901 00:00:00.000', 2, 0.14, 'Ship to 88-A', 'Rua do Mercado, 4567', 'Resende', 'SP', '10353', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10645, 34, 4, '20070826 00:00:00.000', '20070923 00:00:00.000', '20070902 00:00:00.000', 1, 12.41, 'Destination DPCVR', 'Rua do Paço, 6789', 'Rio de Janeiro', 'RJ', '10194', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10646, 37, 9, '20070827 00:00:00.000', '20071008 00:00:00.000', '20070903 00:00:00.000', 3, 142.33, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10647, 61, 4, '20070827 00:00:00.000', '20070910 00:00:00.000', '20070903 00:00:00.000', 2, 45.54, 'Ship to 61-B', 'Rua da Panificadora, 6789', 'Rio de Janeiro', 'RJ', '10274', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10648, 67, 5, '20070828 00:00:00.000', '20071009 00:00:00.000', '20070909 00:00:00.000', 2, 14.25, 'Ship to 67-C', 'Av. Copacabana, 5678', 'Rio de Janeiro', 'RJ', '10293', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10649, 50, 5, '20070828 00:00:00.000', '20070925 00:00:00.000', '20070829 00:00:00.000', 3, 6.20, 'Ship to 50-B', 'Rue Joseph-Bens 4567', 'Bruxelles', NULL, '10242', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10650, 21, 5, '20070829 00:00:00.000', '20070926 00:00:00.000', '20070903 00:00:00.000', 3, 176.81, 'Destination SSYXZ', 'Rua Orós, 3456', 'Sao Paulo', 'SP', '10161', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10651, 86, 8, '20070901 00:00:00.000', '20070929 00:00:00.000', '20070911 00:00:00.000', 2, 20.60, 'Ship to 86-A', 'Adenauerallee 8901', 'Stuttgart', NULL, '10347', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10652, 31, 4, '20070901 00:00:00.000', '20070929 00:00:00.000', '20070908 00:00:00.000', 2, 7.14, 'Destination VNIAG', 'Av. Brasil, 9012', 'Campinas', 'SP', '10187', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10653, 25, 1, '20070902 00:00:00.000', '20070930 00:00:00.000', '20070919 00:00:00.000', 1, 93.25, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10654, 5, 5, '20070902 00:00:00.000', '20070930 00:00:00.000', '20070911 00:00:00.000', 1, 55.26, 'Ship to 5-C', 'Berguvsvägen  1234', 'Luleå', NULL, '10269', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10655, 66, 1, '20070903 00:00:00.000', '20071001 00:00:00.000', '20070911 00:00:00.000', 2, 4.41, 'Ship to 66-B', 'Strada Provinciale 1234', 'Reggio Emilia', NULL, '10289', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10656, 32, 6, '20070904 00:00:00.000', '20071002 00:00:00.000', '20070910 00:00:00.000', 1, 57.15, 'Destination AVQUS', '2345 Baker Blvd.', 'Eugene', 'OR', '10190', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10657, 71, 2, '20070904 00:00:00.000', '20071002 00:00:00.000', '20070915 00:00:00.000', 2, 352.69, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10658, 63, 4, '20070905 00:00:00.000', '20071003 00:00:00.000', '20070908 00:00:00.000', 1, 364.15, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10659, 62, 7, '20070905 00:00:00.000', '20071003 00:00:00.000', '20070910 00:00:00.000', 2, 105.81, 'Ship to 62-B', 'Alameda dos Canàrios, 9012', 'Sao Paulo', 'SP', '10277', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10660, 36, 8, '20070908 00:00:00.000', '20071006 00:00:00.000', '20071015 00:00:00.000', 1, 111.29, 'Destination HOHCR', 'City Center Plaza 3456 Main St.', 'Elgi', 'OR', '10201', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10661, 37, 7, '20070909 00:00:00.000', '20071007 00:00:00.000', '20070915 00:00:00.000', 3, 17.55, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10662, 48, 3, '20070909 00:00:00.000', '20071007 00:00:00.000', '20070918 00:00:00.000', 2, 1.28, 'Ship to 48-C', '7890 Chiaroscuro Rd.', 'Portland', 'OR', '10234', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10663, 9, 2, '20070910 00:00:00.000', '20070924 00:00:00.000', '20071003 00:00:00.000', 2, 113.15, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10664, 28, 1, '20070910 00:00:00.000', '20071008 00:00:00.000', '20070919 00:00:00.000', 3, 1.27, 'Destination OTSWR', 'Jardim das rosas n. 9012', 'Lisboa', NULL, '10177', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10665, 48, 1, '20070911 00:00:00.000', '20071009 00:00:00.000', '20070917 00:00:00.000', 2, 26.31, 'Ship to 48-B', '6789 Chiaroscuro Rd.', 'Portland', 'OR', '10233', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10666, 68, 7, '20070912 00:00:00.000', '20071010 00:00:00.000', '20070922 00:00:00.000', 2, 232.42, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10667, 20, 7, '20070912 00:00:00.000', '20071010 00:00:00.000', '20070919 00:00:00.000', 1, 78.09, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10668, 86, 1, '20070915 00:00:00.000', '20071013 00:00:00.000', '20070923 00:00:00.000', 2, 47.22, 'Ship to 86-C', 'Adenauerallee 0123', 'Stuttgart', NULL, '10349', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10669, 73, 2, '20070915 00:00:00.000', '20071013 00:00:00.000', '20070922 00:00:00.000', 1, 24.39, 'Ship to 73-A', 'Vinbæltet 1234', 'Kobenhav', NULL, '10310', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10670, 25, 4, '20070916 00:00:00.000', '20071014 00:00:00.000', '20070918 00:00:00.000', 1, 203.48, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10671, 26, 1, '20070917 00:00:00.000', '20071015 00:00:00.000', '20070924 00:00:00.000', 1, 30.34, 'Destination OPXJT', '4567, rue Royale', 'Nantes', NULL, '10172', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10672, 5, 9, '20070917 00:00:00.000', '20071001 00:00:00.000', '20070926 00:00:00.000', 2, 95.75, 'Ship to 5-C', 'Berguvsvägen  1234', 'Luleå', NULL, '10269', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10673, 90, 2, '20070918 00:00:00.000', '20071016 00:00:00.000', '20070919 00:00:00.000', 1, 22.76, 'Ship to 90-B', 'Keskuskatu 3456', 'Helsinki', NULL, '10362', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10674, 38, 4, '20070918 00:00:00.000', '20071016 00:00:00.000', '20070930 00:00:00.000', 2, 0.90, 'Destination QVTLW', 'Garden House Crowther Way 7890', 'Cowes', 'Isle of Wight', '10205', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10675, 25, 5, '20070919 00:00:00.000', '20071017 00:00:00.000', '20070923 00:00:00.000', 2, 31.85, 'Destination WEGWI', 'Berliner Platz 2345', 'Münche', NULL, '10170', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10676, 80, 2, '20070922 00:00:00.000', '20071020 00:00:00.000', '20070929 00:00:00.000', 2, 2.01, 'Ship to 80-C', 'Avda. Azteca 5678', 'México D.F.', NULL, '10334', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10677, 3, 1, '20070922 00:00:00.000', '20071020 00:00:00.000', '20070926 00:00:00.000', 3, 4.03, 'Destination LA', 'Mataderos  4567', 'México D.F.', NULL, '10212', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10678, 71, 7, '20070923 00:00:00.000', '20071021 00:00:00.000', '20071016 00:00:00.000', 3, 388.98, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10679, 7, 8, '20070923 00:00:00.000', '20071021 00:00:00.000', '20070930 00:00:00.000', 3, 27.94, 'Ship to 7-A', '0123, place Kléber', 'Strasbourg', NULL, '10329', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10680, 55, 1, '20070924 00:00:00.000', '20071022 00:00:00.000', '20070926 00:00:00.000', 1, 26.61, 'Ship to 55-B', '8901 Bering St.', 'Anchorage', 'AK', '10256', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10681, 32, 3, '20070925 00:00:00.000', '20071023 00:00:00.000', '20070930 00:00:00.000', 3, 76.13, 'Destination AVQUS', '2345 Baker Blvd.', 'Eugene', 'OR', '10190', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10682, 3, 3, '20070925 00:00:00.000', '20071023 00:00:00.000', '20071001 00:00:00.000', 2, 36.13, 'Destination RTGIS', 'Mataderos  2345', 'México D.F.', NULL, '10210', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10683, 18, 2, '20070926 00:00:00.000', '20071024 00:00:00.000', '20071001 00:00:00.000', 1, 4.40, 'Destination FVRGC', '2345, rue des Cinquante Otages', 'Nantes', NULL, '10150', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10684, 56, 3, '20070926 00:00:00.000', '20071024 00:00:00.000', '20070930 00:00:00.000', 1, 145.63, 'Ship to 56-B', 'Mehrheimerstr. 1234', 'Köl', NULL, '10259', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10685, 31, 4, '20070929 00:00:00.000', '20071013 00:00:00.000', '20071003 00:00:00.000', 2, 33.75, 'Destination VNIAG', 'Av. Brasil, 9012', 'Campinas', 'SP', '10187', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10686, 59, 2, '20070930 00:00:00.000', '20071028 00:00:00.000', '20071008 00:00:00.000', 1, 96.50, 'Ship to 59-B', 'Geislweg 7890', 'Salzburg', NULL, '10265', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10687, 37, 9, '20070930 00:00:00.000', '20071028 00:00:00.000', '20071030 00:00:00.000', 2, 296.43, 'Destination KPVYJ', '5678 Johnstown Road', 'Cork', 'Co. Cork', '10203', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10688, 83, 4, '20071001 00:00:00.000', '20071015 00:00:00.000', '20071007 00:00:00.000', 2, 299.09, 'Ship to 83-A', 'Smagsloget 0123', 'Århus', NULL, '10339', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10689, 5, 1, '20071001 00:00:00.000', '20071029 00:00:00.000', '20071007 00:00:00.000', 2, 13.42, 'Ship to 5-B', 'Berguvsvägen  0123', 'Luleå', NULL, '10268', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10690, 34, 1, '20071002 00:00:00.000', '20071030 00:00:00.000', '20071003 00:00:00.000', 1, 15.80, 'Destination JPAIY', 'Rua do Paço, 8901', 'Rio de Janeiro', 'RJ', '10196', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10691, 63, 2, '20071003 00:00:00.000', '20071114 00:00:00.000', '20071022 00:00:00.000', 2, 810.05, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10692, 1, 4, '20071003 00:00:00.000', '20071031 00:00:00.000', '20071013 00:00:00.000', 2, 61.02, 'Destination RSVRP', 'Obere Str. 8901', 'Berli', NULL, '10156', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10693, 89, 3, '20071006 00:00:00.000', '20071020 00:00:00.000', '20071010 00:00:00.000', 3, 139.34, 'Ship to 89-C', '9012 - 12th Ave. S.', 'Seattle', 'WA', '10358', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10694, 63, 8, '20071006 00:00:00.000', '20071103 00:00:00.000', '20071009 00:00:00.000', 3, 398.36, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10695, 90, 7, '20071007 00:00:00.000', '20071118 00:00:00.000', '20071014 00:00:00.000', 1, 16.72, 'Ship to 90-C', 'Keskuskatu 4567', 'Helsinki', NULL, '10363', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10696, 89, 8, '20071008 00:00:00.000', '20071119 00:00:00.000', '20071014 00:00:00.000', 3, 102.55, 'Ship to 89-A', '7890 - 12th Ave. S.', 'Seattle', 'WA', '10356', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10697, 47, 3, '20071008 00:00:00.000', '20071105 00:00:00.000', '20071014 00:00:00.000', 1, 45.52, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10698, 20, 4, '20071009 00:00:00.000', '20071106 00:00:00.000', '20071017 00:00:00.000', 1, 272.47, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10699, 52, 3, '20071009 00:00:00.000', '20071106 00:00:00.000', '20071013 00:00:00.000', 3, 0.58, 'Ship to 52-B', 'Heerstr. 0123', 'Leipzig', NULL, '10248', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10700, 71, 3, '20071010 00:00:00.000', '20071107 00:00:00.000', '20071016 00:00:00.000', 1, 65.10, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10701, 37, 6, '20071013 00:00:00.000', '20071027 00:00:00.000', '20071015 00:00:00.000', 3, 220.31, 'Destination KPVYJ', '5678 Johnstown Road', 'Cork', 'Co. Cork', '10203', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10702, 1, 4, '20071013 00:00:00.000', '20071124 00:00:00.000', '20071021 00:00:00.000', 1, 23.94, 'Destination ZELZJ', 'Obere Str. 7890', 'Berli', NULL, '10155', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10703, 24, 6, '20071014 00:00:00.000', '20071111 00:00:00.000', '20071020 00:00:00.000', 2, 152.30, 'Destination KBSB', 'Åkergatan 9012', 'Bräcke', NULL, '10167', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10704, 62, 6, '20071014 00:00:00.000', '20071111 00:00:00.000', '20071107 00:00:00.000', 1, 4.78, 'Ship to 62-C', 'Alameda dos Canàrios, 0123', 'Sao Paulo', 'SP', '10278', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10705, 35, 9, '20071015 00:00:00.000', '20071112 00:00:00.000', '20071118 00:00:00.000', 2, 3.52, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10706, 55, 8, '20071016 00:00:00.000', '20071113 00:00:00.000', '20071021 00:00:00.000', 3, 135.63, 'Ship to 55-C', '9012 Bering St.', 'Anchorage', 'AK', '10257', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10707, 4, 4, '20071016 00:00:00.000', '20071030 00:00:00.000', '20071023 00:00:00.000', 3, 21.74, 'Ship to 4-A', 'Brook Farm Stratford St. Mary 0123', 'Colchester', 'Essex', '10238', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10708, 77, 6, '20071017 00:00:00.000', '20071128 00:00:00.000', '20071105 00:00:00.000', 2, 2.96, 'Ship to 77-C', '3456 Jefferson Way Suite 2', 'Portland', 'OR', '10322', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10709, 31, 1, '20071017 00:00:00.000', '20071114 00:00:00.000', '20071120 00:00:00.000', 3, 210.80, 'Destination GWPFK', 'Av. Brasil, 0123', 'Campinas', 'SP', '10188', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10710, 27, 1, '20071020 00:00:00.000', '20071117 00:00:00.000', '20071023 00:00:00.000', 1, 4.98, 'Destination FFLQT', 'Via Monte Bianco 6789', 'Torino', NULL, '10174', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10711, 71, 5, '20071021 00:00:00.000', '20071202 00:00:00.000', '20071029 00:00:00.000', 2, 52.41, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10712, 37, 3, '20071021 00:00:00.000', '20071118 00:00:00.000', '20071031 00:00:00.000', 1, 89.93, 'Destination KPVYJ', '5678 Johnstown Road', 'Cork', 'Co. Cork', '10203', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10713, 71, 1, '20071022 00:00:00.000', '20071119 00:00:00.000', '20071024 00:00:00.000', 1, 167.05, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10714, 71, 5, '20071022 00:00:00.000', '20071119 00:00:00.000', '20071027 00:00:00.000', 3, 24.49, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10715, 9, 3, '20071023 00:00:00.000', '20071106 00:00:00.000', '20071029 00:00:00.000', 1, 63.20, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10716, 64, 4, '20071024 00:00:00.000', '20071121 00:00:00.000', '20071027 00:00:00.000', 2, 22.57, 'Ship to 64-B', 'Av. del Libertador 5678', 'Buenos Aires', NULL, '10283', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10717, 25, 1, '20071024 00:00:00.000', '20071121 00:00:00.000', '20071029 00:00:00.000', 2, 59.25, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10718, 39, 1, '20071027 00:00:00.000', '20071124 00:00:00.000', '20071029 00:00:00.000', 3, 170.88, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10719, 45, 8, '20071027 00:00:00.000', '20071124 00:00:00.000', '20071105 00:00:00.000', 2, 51.44, 'Ship to 45-A', '8901 Polk St. Suite 5', 'San Francisco', 'CA', '10225', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10720, 61, 8, '20071028 00:00:00.000', '20071111 00:00:00.000', '20071105 00:00:00.000', 2, 9.53, 'Ship to 61-C', 'Rua da Panificadora, 7890', 'Rio de Janeiro', 'RJ', '10275', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10721, 63, 5, '20071029 00:00:00.000', '20071126 00:00:00.000', '20071031 00:00:00.000', 3, 48.92, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10722, 71, 8, '20071029 00:00:00.000', '20071210 00:00:00.000', '20071104 00:00:00.000', 1, 74.58, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10723, 89, 3, '20071030 00:00:00.000', '20071127 00:00:00.000', '20071125 00:00:00.000', 1, 21.72, 'Ship to 89-C', '9012 - 12th Ave. S.', 'Seattle', 'WA', '10358', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10724, 51, 8, '20071030 00:00:00.000', '20071211 00:00:00.000', '20071105 00:00:00.000', 2, 57.75, 'Ship to 51-A', '6789 rue St. Laurent', 'Montréal', 'Québec', '10244', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10725, 21, 4, '20071031 00:00:00.000', '20071128 00:00:00.000', '20071105 00:00:00.000', 3, 10.83, 'Destination KKELL', 'Rua Orós, 4567', 'Sao Paulo', 'SP', '10162', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10726, 19, 4, '20071103 00:00:00.000', '20071117 00:00:00.000', '20071205 00:00:00.000', 1, 16.56, 'Destination FRCGJ', '5678 King George', 'Londo', NULL, '10153', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10727, 66, 2, '20071103 00:00:00.000', '20071201 00:00:00.000', '20071205 00:00:00.000', 1, 89.90, 'Ship to 66-A', 'Strada Provinciale 0123', 'Reggio Emilia', NULL, '10288', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10728, 62, 4, '20071104 00:00:00.000', '20071202 00:00:00.000', '20071111 00:00:00.000', 2, 58.33, 'Ship to 62-A', 'Alameda dos Canàrios, 8901', 'Sao Paulo', 'SP', '10276', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10729, 47, 8, '20071104 00:00:00.000', '20071216 00:00:00.000', '20071114 00:00:00.000', 3, 141.06, 'Ship to 47-A', 'Ave. 5 de Mayo Porlamar 3456', 'I. de Margarita', 'Nueva Esparta', '10230', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10730, 9, 5, '20071105 00:00:00.000', '20071203 00:00:00.000', '20071114 00:00:00.000', 1, 20.12, 'Ship to 9-A', '8901, rue des Bouchers', 'Marseille', NULL, '10367', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10731, 14, 7, '20071106 00:00:00.000', '20071204 00:00:00.000', '20071114 00:00:00.000', 1, 96.65, 'Destination YUJRD', 'Hauptstr. 1234', 'Ber', NULL, '10139', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10732, 9, 3, '20071106 00:00:00.000', '20071204 00:00:00.000', '20071107 00:00:00.000', 1, 16.97, 'Ship to 9-A', '8901, rue des Bouchers', 'Marseille', NULL, '10367', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10733, 5, 1, '20071107 00:00:00.000', '20071205 00:00:00.000', '20071110 00:00:00.000', 3, 110.11, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10734, 31, 2, '20071107 00:00:00.000', '20071205 00:00:00.000', '20071112 00:00:00.000', 3, 1.63, 'Destination VNIAG', 'Av. Brasil, 9012', 'Campinas', 'SP', '10187', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10735, 45, 6, '20071110 00:00:00.000', '20071208 00:00:00.000', '20071121 00:00:00.000', 2, 45.97, 'Ship to 45-A', '8901 Polk St. Suite 5', 'San Francisco', 'CA', '10225', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10736, 37, 9, '20071111 00:00:00.000', '20071209 00:00:00.000', '20071121 00:00:00.000', 2, 44.10, 'Destination DGKOU', '6789 Johnstown Road', 'Cork', 'Co. Cork', '10204', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10737, 85, 2, '20071111 00:00:00.000', '20071209 00:00:00.000', '20071118 00:00:00.000', 2, 7.79, 'Ship to 85-C', '7890 rue de l''Abbaye', 'Reims', NULL, '10346', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10738, 74, 2, '20071112 00:00:00.000', '20071210 00:00:00.000', '20071118 00:00:00.000', 1, 2.91, 'Ship to 74-A', '3456, rue Lauristo', 'Paris', NULL, '10312', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10739, 85, 3, '20071112 00:00:00.000', '20071210 00:00:00.000', '20071117 00:00:00.000', 3, 11.08, 'Ship to 85-C', '7890 rue de l''Abbaye', 'Reims', NULL, '10346', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10740, 89, 4, '20071113 00:00:00.000', '20071211 00:00:00.000', '20071125 00:00:00.000', 2, 81.88, 'Ship to 89-B', '8901 - 12th Ave. S.', 'Seattle', 'WA', '10357', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10741, 4, 4, '20071114 00:00:00.000', '20071128 00:00:00.000', '20071118 00:00:00.000', 3, 10.96, 'Ship to 4-C', 'Brook Farm Stratford St. Mary 2345', 'Colchester', 'Essex', '10240', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10742, 10, 3, '20071114 00:00:00.000', '20071212 00:00:00.000', '20071118 00:00:00.000', 3, 243.73, 'Destination LPHSI', '3456 Tsawassen Blvd.', 'Tsawasse', 'BC', '10131', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10743, 4, 1, '20071117 00:00:00.000', '20071215 00:00:00.000', '20071121 00:00:00.000', 2, 23.72, 'Ship to 4-C', 'Brook Farm Stratford St. Mary 2345', 'Colchester', 'Essex', '10240', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10744, 83, 6, '20071117 00:00:00.000', '20071215 00:00:00.000', '20071124 00:00:00.000', 1, 69.19, 'Ship to 83-A', 'Smagsloget 0123', 'Århus', NULL, '10339', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10745, 63, 9, '20071118 00:00:00.000', '20071216 00:00:00.000', '20071127 00:00:00.000', 1, 3.52, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10746, 14, 1, '20071119 00:00:00.000', '20071217 00:00:00.000', '20071121 00:00:00.000', 3, 31.43, 'Destination NRTZZ', 'Hauptstr. 0123', 'Ber', NULL, '10138', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10747, 59, 6, '20071119 00:00:00.000', '20071217 00:00:00.000', '20071126 00:00:00.000', 1, 117.33, 'Ship to 59-B', 'Geislweg 7890', 'Salzburg', NULL, '10265', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10748, 71, 3, '20071120 00:00:00.000', '20071218 00:00:00.000', '20071128 00:00:00.000', 1, 232.55, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10749, 38, 4, '20071120 00:00:00.000', '20071218 00:00:00.000', '20071219 00:00:00.000', 2, 61.53, 'Destination QVTLW', 'Garden House Crowther Way 7890', 'Cowes', 'Isle of Wight', '10205', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10750, 87, 9, '20071121 00:00:00.000', '20071219 00:00:00.000', '20071124 00:00:00.000', 1, 79.30, 'Ship to 87-C', 'Torikatu 3456', 'Oulu', NULL, '10352', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10751, 68, 3, '20071124 00:00:00.000', '20071222 00:00:00.000', '20071203 00:00:00.000', 3, 130.79, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10752, 53, 2, '20071124 00:00:00.000', '20071222 00:00:00.000', '20071128 00:00:00.000', 3, 1.39, 'Ship to 53-C', 'South House 3456 Queensbridge', 'Londo', NULL, '10251', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10753, 27, 3, '20071125 00:00:00.000', '20071223 00:00:00.000', '20071127 00:00:00.000', 1, 7.70, 'Destination DICGM', 'Via Monte Bianco 7890', 'Torino', NULL, '10175', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10754, 49, 6, '20071125 00:00:00.000', '20071223 00:00:00.000', '20071127 00:00:00.000', 3, 2.38, 'Ship to 49-B', 'Via Ludovico il Moro 9012', 'Bergamo', NULL, '10236', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10755, 9, 4, '20071126 00:00:00.000', '20071224 00:00:00.000', '20071128 00:00:00.000', 2, 16.71, 'Ship to 9-C', '0123, rue des Bouchers', 'Marseille', NULL, '10369', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10756, 75, 8, '20071127 00:00:00.000', '20071225 00:00:00.000', '20071202 00:00:00.000', 2, 73.21, 'Ship to 75-C', 'P.O. Box 7890', 'Lander', 'WY', '10316', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10757, 71, 6, '20071127 00:00:00.000', '20071225 00:00:00.000', '20071215 00:00:00.000', 1, 8.19, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10758, 68, 3, '20071128 00:00:00.000', '20071226 00:00:00.000', '20071204 00:00:00.000', 3, 138.17, 'Ship to 68-C', 'Starenweg 8901', 'Genève', NULL, '10296', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10759, 2, 3, '20071128 00:00:00.000', '20071226 00:00:00.000', '20071212 00:00:00.000', 3, 11.99, 'Destination QOTQA', 'Avda. de la Constitución 3456', 'México D.F.', NULL, '10181', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10760, 50, 4, '20071201 00:00:00.000', '20071229 00:00:00.000', '20071210 00:00:00.000', 1, 155.64, 'Ship to 50-B', 'Rue Joseph-Bens 4567', 'Bruxelles', NULL, '10242', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10761, 65, 5, '20071202 00:00:00.000', '20071230 00:00:00.000', '20071208 00:00:00.000', 2, 18.66, 'Ship to 65-B', '8901 Milton Dr.', 'Albuquerque', 'NM', '10286', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10762, 24, 3, '20071202 00:00:00.000', '20071230 00:00:00.000', '20071209 00:00:00.000', 1, 328.74, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10763, 23, 3, '20071203 00:00:00.000', '20071231 00:00:00.000', '20071208 00:00:00.000', 3, 37.35, 'Destination PXQRR', '5678, chaussée de Tournai', 'Lille', NULL, '10163', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10764, 20, 6, '20071203 00:00:00.000', '20071231 00:00:00.000', '20071208 00:00:00.000', 3, 145.45, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10765, 63, 3, '20071204 00:00:00.000', '20080101 00:00:00.000', '20071209 00:00:00.000', 3, 42.74, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10766, 56, 4, '20071205 00:00:00.000', '20080102 00:00:00.000', '20071209 00:00:00.000', 1, 157.55, 'Ship to 56-C', 'Mehrheimerstr. 2345', 'Köl', NULL, '10260', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10767, 76, 4, '20071205 00:00:00.000', '20080102 00:00:00.000', '20071215 00:00:00.000', 3, 1.59, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10768, 4, 3, '20071208 00:00:00.000', '20080105 00:00:00.000', '20071215 00:00:00.000', 2, 146.32, 'Ship to 4-B', 'Brook Farm Stratford St. Mary 1234', 'Colchester', 'Essex', '10239', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10769, 83, 3, '20071208 00:00:00.000', '20080105 00:00:00.000', '20071212 00:00:00.000', 1, 65.06, 'Ship to 83-C', 'Smagsloget 2345', 'Århus', NULL, '10341', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10770, 34, 8, '20071209 00:00:00.000', '20080106 00:00:00.000', '20071217 00:00:00.000', 3, 5.32, 'Destination JPAIY', 'Rua do Paço, 8901', 'Rio de Janeiro', 'RJ', '10196', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10771, 20, 9, '20071210 00:00:00.000', '20080107 00:00:00.000', '20080102 00:00:00.000', 2, 11.19, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10772, 44, 3, '20071210 00:00:00.000', '20080107 00:00:00.000', '20071219 00:00:00.000', 2, 91.28, 'Ship to 44-B', 'Magazinweg 5678', 'Frankfurt a.M.', NULL, '10223', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10773, 20, 1, '20071211 00:00:00.000', '20080108 00:00:00.000', '20071216 00:00:00.000', 3, 96.43, 'Destination FFXKT', 'Kirchgasse 0123', 'Graz', NULL, '10158', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10774, 24, 4, '20071211 00:00:00.000', '20071225 00:00:00.000', '20071212 00:00:00.000', 1, 48.20, 'Destination KBSB', 'Åkergatan 9012', 'Bräcke', NULL, '10167', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10775, 78, 7, '20071212 00:00:00.000', '20080109 00:00:00.000', '20071226 00:00:00.000', 1, 20.25, 'Ship to 78-A', '4567 Grizzly Peak Rd.', 'Butte', 'MT', '10323', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10776, 20, 1, '20071215 00:00:00.000', '20080112 00:00:00.000', '20071218 00:00:00.000', 3, 351.53, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10777, 31, 7, '20071215 00:00:00.000', '20071229 00:00:00.000', '20080121 00:00:00.000', 2, 3.01, 'Destination GWPFK', 'Av. Brasil, 0123', 'Campinas', 'SP', '10188', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10778, 5, 3, '20071216 00:00:00.000', '20080113 00:00:00.000', '20071224 00:00:00.000', 1, 6.79, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10779, 52, 3, '20071216 00:00:00.000', '20080113 00:00:00.000', '20080114 00:00:00.000', 2, 58.13, 'Ship to 52-A', 'Heerstr. 9012', 'Leipzig', NULL, '10247', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10780, 46, 2, '20071216 00:00:00.000', '20071230 00:00:00.000', '20071225 00:00:00.000', 1, 42.13, 'Ship to 46-C', 'Carrera 2345 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10229', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10781, 87, 2, '20071217 00:00:00.000', '20080114 00:00:00.000', '20071219 00:00:00.000', 3, 73.16, 'Ship to 87-A', 'Torikatu 1234', 'Oulu', NULL, '10350', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10782, 12, 9, '20071217 00:00:00.000', '20080114 00:00:00.000', '20071222 00:00:00.000', 3, 1.10, 'Destination CJDJB', 'Cerrito 8901', 'Buenos Aires', NULL, '10136', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10783, 34, 4, '20071218 00:00:00.000', '20080115 00:00:00.000', '20071219 00:00:00.000', 2, 124.98, 'Destination DPCVR', 'Rua do Paço, 6789', 'Rio de Janeiro', 'RJ', '10194', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10784, 49, 4, '20071218 00:00:00.000', '20080115 00:00:00.000', '20071222 00:00:00.000', 3, 70.09, 'Ship to 49-A', 'Via Ludovico il Moro 8901', 'Bergamo', NULL, '10235', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10785, 33, 1, '20071218 00:00:00.000', '20080115 00:00:00.000', '20071224 00:00:00.000', 3, 1.51, 'Destination FQJFJ', '5ª Ave. Los Palos Grandes 4567', 'Caracas', 'DF', '10192', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10786, 62, 8, '20071219 00:00:00.000', '20080116 00:00:00.000', '20071223 00:00:00.000', 1, 110.87, 'Ship to 62-B', 'Alameda dos Canàrios, 9012', 'Sao Paulo', 'SP', '10277', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10787, 41, 2, '20071219 00:00:00.000', '20080102 00:00:00.000', '20071226 00:00:00.000', 1, 249.93, 'Destination DWJIO', '9012 rue Alsace-Lorraine', 'Toulouse', NULL, '10217', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10788, 63, 1, '20071222 00:00:00.000', '20080119 00:00:00.000', '20080119 00:00:00.000', 2, 42.70, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10789, 23, 1, '20071222 00:00:00.000', '20080119 00:00:00.000', '20071231 00:00:00.000', 2, 100.60, 'Destination PXQRR', '5678, chaussée de Tournai', 'Lille', NULL, '10163', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10790, 31, 6, '20071222 00:00:00.000', '20080119 00:00:00.000', '20071226 00:00:00.000', 1, 28.23, 'Destination XOIGC', 'Av. Brasil, 8901', 'Campinas', 'SP', '10186', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10791, 25, 6, '20071223 00:00:00.000', '20080120 00:00:00.000', '20080101 00:00:00.000', 2, 16.85, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10792, 91, 1, '20071223 00:00:00.000', '20080120 00:00:00.000', '20071231 00:00:00.000', 3, 23.79, 'Ship to 91-C', 'ul. Filtrowa 7890', 'Warszawa', NULL, '10366', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10793, 4, 3, '20071224 00:00:00.000', '20080121 00:00:00.000', '20080108 00:00:00.000', 3, 4.52, 'Ship to 4-B', 'Brook Farm Stratford St. Mary 1234', 'Colchester', 'Essex', '10239', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10794, 61, 6, '20071224 00:00:00.000', '20080121 00:00:00.000', '20080102 00:00:00.000', 1, 21.49, 'Ship to 61-C', 'Rua da Panificadora, 7890', 'Rio de Janeiro', 'RJ', '10275', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10795, 20, 8, '20071224 00:00:00.000', '20080121 00:00:00.000', '20080120 00:00:00.000', 2, 126.66, 'Destination FFXKT', 'Kirchgasse 0123', 'Graz', NULL, '10158', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10796, 35, 3, '20071225 00:00:00.000', '20080122 00:00:00.000', '20080114 00:00:00.000', 1, 26.52, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10797, 17, 7, '20071225 00:00:00.000', '20080122 00:00:00.000', '20080105 00:00:00.000', 2, 33.35, 'Destination AJTHX', 'Walserweg 9012', 'Aache', NULL, '10147', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10798, 38, 2, '20071226 00:00:00.000', '20080123 00:00:00.000', '20080105 00:00:00.000', 1, 2.33, 'Destination AXVHD', 'Garden House Crowther Way 9012', 'Cowes', 'Isle of Wight', '10207', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10799, 39, 9, '20071226 00:00:00.000', '20080206 00:00:00.000', '20080105 00:00:00.000', 3, 30.76, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10800, 72, 1, '20071226 00:00:00.000', '20080123 00:00:00.000', '20080105 00:00:00.000', 3, 137.44, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10801, 8, 4, '20071229 00:00:00.000', '20080126 00:00:00.000', '20071231 00:00:00.000', 2, 97.09, 'Ship to 8-C', 'C/ Araquil, 1234', 'Madrid', NULL, '10360', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10802, 73, 4, '20071229 00:00:00.000', '20080126 00:00:00.000', '20080102 00:00:00.000', 2, 257.26, 'Ship to 73-A', 'Vinbæltet 1234', 'Kobenhav', NULL, '10310', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10803, 88, 4, '20071230 00:00:00.000', '20080127 00:00:00.000', '20080106 00:00:00.000', 1, 55.23, 'Ship to 88-B', 'Rua do Mercado, 5678', 'Resende', 'SP', '10354', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10804, 72, 6, '20071230 00:00:00.000', '20080127 00:00:00.000', '20080107 00:00:00.000', 2, 27.33, 'Ship to 72-C', '1234 Wadhurst Rd.', 'Londo', NULL, '10309', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10805, 77, 2, '20071230 00:00:00.000', '20080127 00:00:00.000', '20080109 00:00:00.000', 3, 237.34, 'Ship to 77-A', '1234 Jefferson Way Suite 2', 'Portland', 'OR', '10320', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10806, 84, 3, '20071231 00:00:00.000', '20080128 00:00:00.000', '20080105 00:00:00.000', 2, 22.11, 'Ship to 84-C', '5678, rue du Commerce', 'Lyo', NULL, '10344', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10807, 27, 4, '20071231 00:00:00.000', '20080128 00:00:00.000', '20080130 00:00:00.000', 1, 1.36, 'Destination XNLFB', 'Via Monte Bianco 5678', 'Torino', NULL, '10173', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10808, 55, 2, '20080101 00:00:00.000', '20080129 00:00:00.000', '20080109 00:00:00.000', 3, 45.53, 'Ship to 55-B', '8901 Bering St.', 'Anchorage', 'AK', '10256', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10809, 88, 7, '20080101 00:00:00.000', '20080129 00:00:00.000', '20080107 00:00:00.000', 1, 4.87, 'Ship to 88-C', 'Rua do Mercado, 6789', 'Resende', 'SP', '10355', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10810, 42, 2, '20080101 00:00:00.000', '20080129 00:00:00.000', '20080107 00:00:00.000', 3, 4.33, 'Ship to 42-A', '1234 Elm St.', 'Vancouver', 'BC', '10219', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10811, 47, 8, '20080102 00:00:00.000', '20080130 00:00:00.000', '20080108 00:00:00.000', 1, 31.22, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10812, 66, 5, '20080102 00:00:00.000', '20080130 00:00:00.000', '20080112 00:00:00.000', 1, 59.78, 'Ship to 66-B', 'Strada Provinciale 1234', 'Reggio Emilia', NULL, '10289', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10813, 67, 1, '20080105 00:00:00.000', '20080202 00:00:00.000', '20080109 00:00:00.000', 1, 47.38, 'Ship to 67-C', 'Av. Copacabana, 5678', 'Rio de Janeiro', 'RJ', '10293', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10814, 84, 3, '20080105 00:00:00.000', '20080202 00:00:00.000', '20080114 00:00:00.000', 3, 130.94, 'Ship to 84-B', '4567, rue du Commerce', 'Lyo', NULL, '10343', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10815, 71, 2, '20080105 00:00:00.000', '20080202 00:00:00.000', '20080114 00:00:00.000', 3, 14.62, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10816, 32, 4, '20080106 00:00:00.000', '20080203 00:00:00.000', '20080204 00:00:00.000', 2, 719.78, 'Destination AVQUS', '2345 Baker Blvd.', 'Eugene', 'OR', '10190', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10817, 39, 3, '20080106 00:00:00.000', '20080120 00:00:00.000', '20080113 00:00:00.000', 2, 306.07, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10818, 49, 7, '20080107 00:00:00.000', '20080204 00:00:00.000', '20080112 00:00:00.000', 3, 65.48, 'Ship to 49-B', 'Via Ludovico il Moro 9012', 'Bergamo', NULL, '10236', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10819, 12, 2, '20080107 00:00:00.000', '20080204 00:00:00.000', '20080116 00:00:00.000', 3, 19.76, 'Destination QTHBC', 'Cerrito 6789', 'Buenos Aires', NULL, '10134', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10820, 65, 3, '20080107 00:00:00.000', '20080204 00:00:00.000', '20080113 00:00:00.000', 2, 37.52, 'Ship to 65-B', '8901 Milton Dr.', 'Albuquerque', 'NM', '10286', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10821, 75, 1, '20080108 00:00:00.000', '20080205 00:00:00.000', '20080115 00:00:00.000', 1, 36.68, 'Ship to 75-A', 'P.O. Box 5678', 'Lander', 'WY', '10314', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10822, 82, 6, '20080108 00:00:00.000', '20080205 00:00:00.000', '20080116 00:00:00.000', 3, 7.00, 'Ship to 82-B', '9012 DaVinci Blvd.', 'Kirkland', 'WA', '10338', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10823, 46, 5, '20080109 00:00:00.000', '20080206 00:00:00.000', '20080113 00:00:00.000', 2, 163.97, 'Ship to 46-A', 'Carrera 0123 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10227', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10824, 24, 8, '20080109 00:00:00.000', '20080206 00:00:00.000', '20080130 00:00:00.000', 1, 1.23, 'Destination NCKKO', 'Åkergatan 7890', 'Bräcke', NULL, '10165', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10825, 17, 1, '20080109 00:00:00.000', '20080206 00:00:00.000', '20080114 00:00:00.000', 1, 79.25, 'Destination BJCXA', 'Walserweg 7890', 'Aache', NULL, '10145', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10826, 7, 6, '20080112 00:00:00.000', '20080209 00:00:00.000', '20080206 00:00:00.000', 1, 7.09, 'Ship to 7-C', '2345, place Kléber', 'Strasbourg', NULL, '10331', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10827, 9, 1, '20080112 00:00:00.000', '20080126 00:00:00.000', '20080206 00:00:00.000', 2, 63.54, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10828, 64, 9, '20080113 00:00:00.000', '20080127 00:00:00.000', '20080204 00:00:00.000', 1, 90.85, 'Ship to 64-B', 'Av. del Libertador 5678', 'Buenos Aires', NULL, '10283', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10829, 38, 9, '20080113 00:00:00.000', '20080210 00:00:00.000', '20080123 00:00:00.000', 1, 154.72, 'Destination QVTLW', 'Garden House Crowther Way 7890', 'Cowes', 'Isle of Wight', '10205', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10830, 81, 4, '20080113 00:00:00.000', '20080224 00:00:00.000', '20080121 00:00:00.000', 2, 81.83, 'Ship to 81-C', 'Av. Inês de Castro, 7890', 'Sao Paulo', 'SP', '10336', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10831, 70, 3, '20080114 00:00:00.000', '20080211 00:00:00.000', '20080123 00:00:00.000', 2, 72.19, 'Ship to 70-B', 'Erling Skakkes gate 5678', 'Staver', NULL, '10303', 'Norway');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10832, 41, 2, '20080114 00:00:00.000', '20080211 00:00:00.000', '20080119 00:00:00.000', 2, 43.26, 'Ship to 41-C', '0123 rue Alsace-Lorraine', 'Toulouse', NULL, '10218', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10833, 56, 6, '20080115 00:00:00.000', '20080212 00:00:00.000', '20080123 00:00:00.000', 2, 71.49, 'Ship to 56-B', 'Mehrheimerstr. 1234', 'Köl', NULL, '10259', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10834, 81, 1, '20080115 00:00:00.000', '20080212 00:00:00.000', '20080119 00:00:00.000', 3, 29.78, 'Ship to 81-A', 'Av. Inês de Castro, 6789', 'Sao Paulo', 'SP', '10335', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10835, 1, 1, '20080115 00:00:00.000', '20080212 00:00:00.000', '20080121 00:00:00.000', 3, 69.53, 'Destination LOUIE', 'Obere Str. 6789', 'Berli', NULL, '10154', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10836, 20, 7, '20080116 00:00:00.000', '20080213 00:00:00.000', '20080121 00:00:00.000', 1, 411.88, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10837, 5, 9, '20080116 00:00:00.000', '20080213 00:00:00.000', '20080123 00:00:00.000', 3, 13.32, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10838, 47, 3, '20080119 00:00:00.000', '20080216 00:00:00.000', '20080123 00:00:00.000', 3, 59.28, 'Ship to 47-A', 'Ave. 5 de Mayo Porlamar 3456', 'I. de Margarita', 'Nueva Esparta', '10230', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10839, 81, 3, '20080119 00:00:00.000', '20080216 00:00:00.000', '20080122 00:00:00.000', 3, 35.43, 'Ship to 81-C', 'Av. Inês de Castro, 7890', 'Sao Paulo', 'SP', '10336', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10840, 47, 4, '20080119 00:00:00.000', '20080302 00:00:00.000', '20080216 00:00:00.000', 2, 2.71, 'Ship to 47-A', 'Ave. 5 de Mayo Porlamar 3456', 'I. de Margarita', 'Nueva Esparta', '10230', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10841, 76, 5, '20080120 00:00:00.000', '20080217 00:00:00.000', '20080129 00:00:00.000', 2, 424.30, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10842, 80, 1, '20080120 00:00:00.000', '20080217 00:00:00.000', '20080129 00:00:00.000', 3, 54.42, 'Ship to 80-A', 'Avda. Azteca 3456', 'México D.F.', NULL, '10332', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10843, 84, 4, '20080121 00:00:00.000', '20080218 00:00:00.000', '20080126 00:00:00.000', 2, 9.26, 'Ship to 84-C', '5678, rue du Commerce', 'Lyo', NULL, '10344', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10844, 59, 8, '20080121 00:00:00.000', '20080218 00:00:00.000', '20080126 00:00:00.000', 2, 25.22, 'Ship to 59-A', 'Geislweg 6789', 'Salzburg', NULL, '10264', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10845, 63, 8, '20080121 00:00:00.000', '20080204 00:00:00.000', '20080130 00:00:00.000', 1, 212.98, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10846, 76, 2, '20080122 00:00:00.000', '20080305 00:00:00.000', '20080123 00:00:00.000', 3, 56.46, 'Ship to 76-C', 'Boulevard Tirou, 0123', 'Charleroi', NULL, '10319', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10847, 71, 4, '20080122 00:00:00.000', '20080205 00:00:00.000', '20080210 00:00:00.000', 3, 487.57, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10848, 16, 7, '20080123 00:00:00.000', '20080220 00:00:00.000', '20080129 00:00:00.000', 2, 38.24, 'Destination QKQNB', 'Berkeley Gardens 5678  Brewery', 'Londo', NULL, '10143', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10849, 39, 9, '20080123 00:00:00.000', '20080220 00:00:00.000', '20080130 00:00:00.000', 2, 0.56, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10850, 84, 1, '20080123 00:00:00.000', '20080306 00:00:00.000', '20080130 00:00:00.000', 1, 49.19, 'Ship to 84-C', '5678, rue du Commerce', 'Lyo', NULL, '10344', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10851, 67, 5, '20080126 00:00:00.000', '20080223 00:00:00.000', '20080202 00:00:00.000', 1, 160.55, 'Ship to 67-C', 'Av. Copacabana, 5678', 'Rio de Janeiro', 'RJ', '10293', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10852, 65, 8, '20080126 00:00:00.000', '20080209 00:00:00.000', '20080130 00:00:00.000', 1, 174.05, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10853, 6, 9, '20080127 00:00:00.000', '20080224 00:00:00.000', '20080203 00:00:00.000', 2, 53.83, 'Ship to 6-B', 'Forsterstr. 3456', 'Mannheim', NULL, '10301', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10854, 20, 3, '20080127 00:00:00.000', '20080224 00:00:00.000', '20080205 00:00:00.000', 2, 100.22, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10855, 55, 3, '20080127 00:00:00.000', '20080224 00:00:00.000', '20080204 00:00:00.000', 1, 170.97, 'Ship to 55-A', '7890 Bering St.', 'Anchorage', 'AK', '10255', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10856, 3, 3, '20080128 00:00:00.000', '20080225 00:00:00.000', '20080210 00:00:00.000', 2, 58.43, 'Destination FQFLS', 'Mataderos  3456', 'México D.F.', NULL, '10211', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10857, 5, 8, '20080128 00:00:00.000', '20080225 00:00:00.000', '20080206 00:00:00.000', 2, 188.85, 'Ship to 5-B', 'Berguvsvägen  0123', 'Luleå', NULL, '10268', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10858, 40, 2, '20080129 00:00:00.000', '20080226 00:00:00.000', '20080203 00:00:00.000', 1, 52.51, 'Destination POAEW', '7890, avenue de l''Europe', 'Versailles', NULL, '10215', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10859, 25, 1, '20080129 00:00:00.000', '20080226 00:00:00.000', '20080202 00:00:00.000', 2, 76.10, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10860, 26, 3, '20080129 00:00:00.000', '20080226 00:00:00.000', '20080204 00:00:00.000', 3, 19.26, 'Destination XBVK', '3456, rue Royale', 'Nantes', NULL, '10171', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10861, 89, 4, '20080130 00:00:00.000', '20080227 00:00:00.000', '20080217 00:00:00.000', 2, 14.93, 'Ship to 89-C', '9012 - 12th Ave. S.', 'Seattle', 'WA', '10358', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10862, 44, 8, '20080130 00:00:00.000', '20080313 00:00:00.000', '20080202 00:00:00.000', 2, 53.23, 'Ship to 44-C', 'Magazinweg 6789', 'Frankfurt a.M.', NULL, '10224', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10863, 35, 4, '20080202 00:00:00.000', '20080302 00:00:00.000', '20080217 00:00:00.000', 2, 30.26, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10864, 4, 4, '20080202 00:00:00.000', '20080302 00:00:00.000', '20080209 00:00:00.000', 2, 3.04, 'Ship to 4-C', 'Brook Farm Stratford St. Mary 2345', 'Colchester', 'Essex', '10240', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10865, 63, 2, '20080202 00:00:00.000', '20080216 00:00:00.000', '20080212 00:00:00.000', 1, 348.14, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10866, 5, 5, '20080203 00:00:00.000', '20080303 00:00:00.000', '20080212 00:00:00.000', 1, 109.11, 'Ship to 5-B', 'Berguvsvägen  0123', 'Luleå', NULL, '10268', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10867, 48, 6, '20080203 00:00:00.000', '20080317 00:00:00.000', '20080211 00:00:00.000', 1, 1.93, 'Ship to 48-B', '6789 Chiaroscuro Rd.', 'Portland', 'OR', '10233', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10868, 62, 7, '20080204 00:00:00.000', '20080304 00:00:00.000', '20080223 00:00:00.000', 2, 191.27, 'Ship to 62-C', 'Alameda dos Canàrios, 0123', 'Sao Paulo', 'SP', '10278', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10869, 72, 5, '20080204 00:00:00.000', '20080304 00:00:00.000', '20080209 00:00:00.000', 1, 143.28, 'Ship to 72-A', '0123 Wadhurst Rd.', 'Londo', NULL, '10308', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10870, 91, 5, '20080204 00:00:00.000', '20080304 00:00:00.000', '20080213 00:00:00.000', 3, 12.04, 'Ship to 91-A', 'ul. Filtrowa 5678', 'Warszawa', NULL, '10364', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10871, 9, 9, '20080205 00:00:00.000', '20080305 00:00:00.000', '20080210 00:00:00.000', 2, 112.27, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10872, 30, 5, '20080205 00:00:00.000', '20080305 00:00:00.000', '20080209 00:00:00.000', 2, 175.32, 'Destination GGQIR', 'C/ Romero, 6789', 'Sevilla', NULL, '10184', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10873, 90, 4, '20080206 00:00:00.000', '20080306 00:00:00.000', '20080209 00:00:00.000', 1, 0.82, 'Ship to 90-B', 'Keskuskatu 3456', 'Helsinki', NULL, '10362', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10874, 30, 5, '20080206 00:00:00.000', '20080306 00:00:00.000', '20080211 00:00:00.000', 2, 19.58, 'Destination IIYDD', 'C/ Romero, 5678', 'Sevilla', NULL, '10183', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10875, 5, 4, '20080206 00:00:00.000', '20080306 00:00:00.000', '20080303 00:00:00.000', 2, 32.37, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10876, 9, 7, '20080209 00:00:00.000', '20080309 00:00:00.000', '20080212 00:00:00.000', 3, 60.42, 'Ship to 9-A', '8901, rue des Bouchers', 'Marseille', NULL, '10367', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10877, 67, 1, '20080209 00:00:00.000', '20080309 00:00:00.000', '20080219 00:00:00.000', 1, 38.06, 'Ship to 67-B', 'Av. Copacabana, 4567', 'Rio de Janeiro', 'RJ', '10292', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10878, 63, 4, '20080210 00:00:00.000', '20080310 00:00:00.000', '20080212 00:00:00.000', 1, 46.69, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10879, 90, 3, '20080210 00:00:00.000', '20080310 00:00:00.000', '20080212 00:00:00.000', 3, 8.50, 'Ship to 90-A', 'Keskuskatu 2345', 'Helsinki', NULL, '10361', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10880, 24, 7, '20080210 00:00:00.000', '20080324 00:00:00.000', '20080218 00:00:00.000', 1, 88.01, 'Destination KBSB', 'Åkergatan 9012', 'Bräcke', NULL, '10167', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10881, 12, 4, '20080211 00:00:00.000', '20080311 00:00:00.000', '20080218 00:00:00.000', 1, 2.84, 'Destination IGLOB', 'Cerrito 7890', 'Buenos Aires', NULL, '10135', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10882, 71, 4, '20080211 00:00:00.000', '20080311 00:00:00.000', '20080220 00:00:00.000', 3, 23.10, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10883, 48, 8, '20080212 00:00:00.000', '20080312 00:00:00.000', '20080220 00:00:00.000', 3, 0.53, 'Ship to 48-C', '7890 Chiaroscuro Rd.', 'Portland', 'OR', '10234', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10884, 45, 4, '20080212 00:00:00.000', '20080312 00:00:00.000', '20080213 00:00:00.000', 2, 90.97, 'Ship to 45-C', '9012 Polk St. Suite 5', 'San Francisco', 'CA', '10226', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10885, 76, 6, '20080212 00:00:00.000', '20080312 00:00:00.000', '20080218 00:00:00.000', 3, 5.64, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10886, 34, 1, '20080213 00:00:00.000', '20080313 00:00:00.000', '20080302 00:00:00.000', 1, 4.99, 'Destination SCQXA', 'Rua do Paço, 7890', 'Rio de Janeiro', 'RJ', '10195', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10887, 29, 8, '20080213 00:00:00.000', '20080313 00:00:00.000', '20080216 00:00:00.000', 3, 1.25, 'Destination VPNNG', 'Rambla de Cataluña, 0123', 'Barcelona', NULL, '10178', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10888, 30, 1, '20080216 00:00:00.000', '20080316 00:00:00.000', '20080223 00:00:00.000', 2, 51.87, 'Destination IIYDD', 'C/ Romero, 5678', 'Sevilla', NULL, '10183', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10889, 65, 9, '20080216 00:00:00.000', '20080316 00:00:00.000', '20080223 00:00:00.000', 3, 280.61, 'Ship to 65-C', '9012 Milton Dr.', 'Albuquerque', 'NM', '10287', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10890, 18, 7, '20080216 00:00:00.000', '20080316 00:00:00.000', '20080218 00:00:00.000', 1, 32.76, 'Destination JNSYI', '1234, rue des Cinquante Otages', 'Nantes', NULL, '10149', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10891, 44, 7, '20080217 00:00:00.000', '20080317 00:00:00.000', '20080219 00:00:00.000', 2, 20.37, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10892, 50, 4, '20080217 00:00:00.000', '20080317 00:00:00.000', '20080219 00:00:00.000', 2, 120.27, 'Ship to 50-A', 'Rue Joseph-Bens 3456', 'Bruxelles', NULL, '10241', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10893, 39, 9, '20080218 00:00:00.000', '20080318 00:00:00.000', '20080220 00:00:00.000', 2, 77.78, 'Destination RMBHM', 'Maubelstr. 1234', 'Brandenburg', NULL, '10209', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10894, 71, 1, '20080218 00:00:00.000', '20080318 00:00:00.000', '20080220 00:00:00.000', 1, 116.13, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10895, 20, 3, '20080218 00:00:00.000', '20080318 00:00:00.000', '20080223 00:00:00.000', 1, 162.75, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10896, 50, 7, '20080219 00:00:00.000', '20080319 00:00:00.000', '20080227 00:00:00.000', 3, 32.45, 'Ship to 50-A', 'Rue Joseph-Bens 3456', 'Bruxelles', NULL, '10241', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10897, 37, 3, '20080219 00:00:00.000', '20080319 00:00:00.000', '20080225 00:00:00.000', 2, 603.54, 'Destination DGKOU', '6789 Johnstown Road', 'Cork', 'Co. Cork', '10204', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10898, 54, 4, '20080220 00:00:00.000', '20080320 00:00:00.000', '20080306 00:00:00.000', 2, 1.27, 'Ship to 54-B', 'Ing. Gustavo Moncada 5678 Piso 20-A', 'Buenos Aires', NULL, '10253', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10899, 46, 5, '20080220 00:00:00.000', '20080320 00:00:00.000', '20080226 00:00:00.000', 3, 1.21, 'Ship to 46-C', 'Carrera 2345 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10229', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10900, 88, 1, '20080220 00:00:00.000', '20080320 00:00:00.000', '20080304 00:00:00.000', 2, 1.66, 'Ship to 88-A', 'Rua do Mercado, 4567', 'Resende', 'SP', '10353', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10901, 35, 4, '20080223 00:00:00.000', '20080323 00:00:00.000', '20080226 00:00:00.000', 1, 62.09, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10902, 24, 1, '20080223 00:00:00.000', '20080323 00:00:00.000', '20080303 00:00:00.000', 1, 44.15, 'Destination NCKKO', 'Åkergatan 7890', 'Bräcke', NULL, '10165', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10903, 34, 3, '20080224 00:00:00.000', '20080324 00:00:00.000', '20080304 00:00:00.000', 3, 36.71, 'Destination DPCVR', 'Rua do Paço, 6789', 'Rio de Janeiro', 'RJ', '10194', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10904, 89, 3, '20080224 00:00:00.000', '20080324 00:00:00.000', '20080227 00:00:00.000', 3, 162.95, 'Ship to 89-A', '7890 - 12th Ave. S.', 'Seattle', 'WA', '10356', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10905, 88, 9, '20080224 00:00:00.000', '20080324 00:00:00.000', '20080306 00:00:00.000', 2, 13.72, 'Ship to 88-A', 'Rua do Mercado, 4567', 'Resende', 'SP', '10353', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10906, 91, 4, '20080225 00:00:00.000', '20080311 00:00:00.000', '20080303 00:00:00.000', 3, 26.29, 'Ship to 91-B', 'ul. Filtrowa 6789', 'Warszawa', NULL, '10365', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10907, 74, 6, '20080225 00:00:00.000', '20080325 00:00:00.000', '20080227 00:00:00.000', 3, 9.19, 'Ship to 74-B', '4567, rue Lauristo', 'Paris', NULL, '10313', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10908, 66, 4, '20080226 00:00:00.000', '20080326 00:00:00.000', '20080306 00:00:00.000', 2, 32.96, 'Ship to 66-B', 'Strada Provinciale 1234', 'Reggio Emilia', NULL, '10289', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10909, 70, 1, '20080226 00:00:00.000', '20080326 00:00:00.000', '20080310 00:00:00.000', 2, 53.05, 'Ship to 70-C', 'Erling Skakkes gate 6789', 'Staver', NULL, '10304', 'Norway');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10910, 90, 1, '20080226 00:00:00.000', '20080326 00:00:00.000', '20080304 00:00:00.000', 3, 38.11, 'Ship to 90-A', 'Keskuskatu 2345', 'Helsinki', NULL, '10361', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10911, 30, 3, '20080226 00:00:00.000', '20080326 00:00:00.000', '20080305 00:00:00.000', 1, 38.19, 'Destination IIYDD', 'C/ Romero, 5678', 'Sevilla', NULL, '10183', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10912, 37, 2, '20080226 00:00:00.000', '20080326 00:00:00.000', '20080318 00:00:00.000', 2, 580.91, 'Destination DGKOU', '6789 Johnstown Road', 'Cork', 'Co. Cork', '10204', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10913, 62, 4, '20080226 00:00:00.000', '20080326 00:00:00.000', '20080304 00:00:00.000', 1, 33.05, 'Ship to 62-A', 'Alameda dos Canàrios, 8901', 'Sao Paulo', 'SP', '10276', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10914, 62, 6, '20080227 00:00:00.000', '20080327 00:00:00.000', '20080302 00:00:00.000', 1, 21.19, 'Ship to 62-B', 'Alameda dos Canàrios, 9012', 'Sao Paulo', 'SP', '10277', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10915, 80, 2, '20080227 00:00:00.000', '20080327 00:00:00.000', '20080302 00:00:00.000', 2, 3.51, 'Ship to 80-C', 'Avda. Azteca 5678', 'México D.F.', NULL, '10334', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10916, 64, 1, '20080227 00:00:00.000', '20080327 00:00:00.000', '20080309 00:00:00.000', 2, 63.77, 'Ship to 64-C', 'Av. del Libertador 6789', 'Buenos Aires', NULL, '10284', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10917, 69, 4, '20080302 00:00:00.000', '20080330 00:00:00.000', '20080311 00:00:00.000', 2, 8.29, 'Ship to 69-C', 'Gran Vía, 1234', 'Madrid', NULL, '10299', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10918, 10, 3, '20080302 00:00:00.000', '20080330 00:00:00.000', '20080311 00:00:00.000', 3, 48.83, 'Destination OLSSJ', '2345 Tsawassen Blvd.', 'Tsawasse', 'BC', '10130', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10919, 47, 2, '20080302 00:00:00.000', '20080330 00:00:00.000', '20080304 00:00:00.000', 2, 19.80, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10920, 4, 4, '20080303 00:00:00.000', '20080331 00:00:00.000', '20080309 00:00:00.000', 2, 29.61, 'Ship to 4-A', 'Brook Farm Stratford St. Mary 0123', 'Colchester', 'Essex', '10238', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10921, 83, 1, '20080303 00:00:00.000', '20080414 00:00:00.000', '20080309 00:00:00.000', 1, 176.48, 'Ship to 83-A', 'Smagsloget 0123', 'Århus', NULL, '10339', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10922, 34, 5, '20080303 00:00:00.000', '20080331 00:00:00.000', '20080305 00:00:00.000', 3, 62.74, 'Destination DPCVR', 'Rua do Paço, 6789', 'Rio de Janeiro', 'RJ', '10194', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10923, 41, 7, '20080303 00:00:00.000', '20080414 00:00:00.000', '20080313 00:00:00.000', 3, 68.26, 'Destination OLJND', '8901 rue Alsace-Lorraine', 'Toulouse', NULL, '10216', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10924, 5, 3, '20080304 00:00:00.000', '20080401 00:00:00.000', '20080408 00:00:00.000', 2, 151.52, 'Ship to 5-A', 'Berguvsvägen  9012', 'Luleå', NULL, '10267', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10925, 34, 3, '20080304 00:00:00.000', '20080401 00:00:00.000', '20080313 00:00:00.000', 1, 2.27, 'Destination JPAIY', 'Rua do Paço, 8901', 'Rio de Janeiro', 'RJ', '10196', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10926, 2, 4, '20080304 00:00:00.000', '20080401 00:00:00.000', '20080311 00:00:00.000', 3, 39.92, 'Destination RAIGI', 'Avda. de la Constitución 4567', 'México D.F.', NULL, '10182', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10927, 40, 4, '20080305 00:00:00.000', '20080402 00:00:00.000', '20080408 00:00:00.000', 1, 19.79, 'Destination WWJLO', '6789, avenue de l''Europe', 'Versailles', NULL, '10214', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10928, 29, 1, '20080305 00:00:00.000', '20080402 00:00:00.000', '20080318 00:00:00.000', 1, 1.36, 'Destination WOFLH', 'Rambla de Cataluña, 1234', 'Barcelona', NULL, '10179', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10929, 25, 6, '20080305 00:00:00.000', '20080402 00:00:00.000', '20080312 00:00:00.000', 1, 33.93, 'Destination QOCBL', 'Berliner Platz 1234', 'Münche', NULL, '10169', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10930, 76, 4, '20080306 00:00:00.000', '20080417 00:00:00.000', '20080318 00:00:00.000', 3, 15.55, 'Ship to 76-A', 'Boulevard Tirou, 8901', 'Charleroi', NULL, '10317', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10931, 68, 4, '20080306 00:00:00.000', '20080320 00:00:00.000', '20080319 00:00:00.000', 2, 13.60, 'Ship to 68-B', 'Starenweg 7890', 'Genève', NULL, '10295', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10932, 9, 8, '20080306 00:00:00.000', '20080403 00:00:00.000', '20080324 00:00:00.000', 1, 134.64, 'Ship to 9-B', '9012, rue des Bouchers', 'Marseille', NULL, '10368', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10933, 38, 6, '20080306 00:00:00.000', '20080403 00:00:00.000', '20080316 00:00:00.000', 3, 54.15, 'Destination QVTLW', 'Garden House Crowther Way 7890', 'Cowes', 'Isle of Wight', '10205', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10934, 44, 3, '20080309 00:00:00.000', '20080406 00:00:00.000', '20080312 00:00:00.000', 3, 32.01, 'Ship to 44-C', 'Magazinweg 6789', 'Frankfurt a.M.', NULL, '10224', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10935, 88, 4, '20080309 00:00:00.000', '20080406 00:00:00.000', '20080318 00:00:00.000', 3, 47.59, 'Ship to 88-A', 'Rua do Mercado, 4567', 'Resende', 'SP', '10353', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10936, 32, 3, '20080309 00:00:00.000', '20080406 00:00:00.000', '20080318 00:00:00.000', 2, 33.68, 'Destination AVQUS', '2345 Baker Blvd.', 'Eugene', 'OR', '10190', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10937, 12, 7, '20080310 00:00:00.000', '20080324 00:00:00.000', '20080313 00:00:00.000', 3, 31.51, 'Destination QTHBC', 'Cerrito 6789', 'Buenos Aires', NULL, '10134', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10938, 63, 3, '20080310 00:00:00.000', '20080407 00:00:00.000', '20080316 00:00:00.000', 2, 31.89, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10939, 49, 2, '20080310 00:00:00.000', '20080407 00:00:00.000', '20080313 00:00:00.000', 2, 76.33, 'Ship to 49-A', 'Via Ludovico il Moro 8901', 'Bergamo', NULL, '10235', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10940, 9, 8, '20080311 00:00:00.000', '20080408 00:00:00.000', '20080323 00:00:00.000', 3, 19.77, 'Ship to 9-C', '0123, rue des Bouchers', 'Marseille', NULL, '10369', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10941, 71, 7, '20080311 00:00:00.000', '20080408 00:00:00.000', '20080320 00:00:00.000', 2, 400.81, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10942, 66, 9, '20080311 00:00:00.000', '20080408 00:00:00.000', '20080318 00:00:00.000', 3, 17.95, 'Ship to 66-C', 'Strada Provinciale 2345', 'Reggio Emilia', NULL, '10290', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10943, 11, 4, '20080311 00:00:00.000', '20080408 00:00:00.000', '20080319 00:00:00.000', 2, 2.17, 'Destination NZASL', 'Fauntleroy Circus 5678', 'Londo', NULL, '10133', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10944, 10, 6, '20080312 00:00:00.000', '20080326 00:00:00.000', '20080313 00:00:00.000', 3, 52.92, 'Destination XJIBQ', '1234 Tsawassen Blvd.', 'Tsawasse', 'BC', '10129', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10945, 52, 4, '20080312 00:00:00.000', '20080409 00:00:00.000', '20080318 00:00:00.000', 1, 10.22, 'Ship to 52-B', 'Heerstr. 0123', 'Leipzig', NULL, '10248', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10946, 83, 1, '20080312 00:00:00.000', '20080409 00:00:00.000', '20080319 00:00:00.000', 2, 27.20, 'Ship to 83-B', 'Smagsloget 1234', 'Århus', NULL, '10340', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10947, 11, 3, '20080313 00:00:00.000', '20080410 00:00:00.000', '20080316 00:00:00.000', 2, 3.26, 'Destination NZASL', 'Fauntleroy Circus 5678', 'Londo', NULL, '10133', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10948, 30, 3, '20080313 00:00:00.000', '20080410 00:00:00.000', '20080319 00:00:00.000', 3, 23.39, 'Destination GGQIR', 'C/ Romero, 6789', 'Sevilla', NULL, '10184', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10949, 10, 2, '20080313 00:00:00.000', '20080410 00:00:00.000', '20080317 00:00:00.000', 3, 74.44, 'Destination OLSSJ', '2345 Tsawassen Blvd.', 'Tsawasse', 'BC', '10130', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10950, 49, 1, '20080316 00:00:00.000', '20080413 00:00:00.000', '20080323 00:00:00.000', 2, 2.50, 'Ship to 49-B', 'Via Ludovico il Moro 9012', 'Bergamo', NULL, '10236', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10951, 68, 9, '20080316 00:00:00.000', '20080427 00:00:00.000', '20080407 00:00:00.000', 2, 30.85, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10952, 1, 1, '20080316 00:00:00.000', '20080427 00:00:00.000', '20080324 00:00:00.000', 1, 40.42, 'Destination LOUIE', 'Obere Str. 6789', 'Berli', NULL, '10154', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10953, 4, 9, '20080316 00:00:00.000', '20080330 00:00:00.000', '20080325 00:00:00.000', 2, 23.72, 'Ship to 4-B', 'Brook Farm Stratford St. Mary 1234', 'Colchester', 'Essex', '10239', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10954, 47, 5, '20080317 00:00:00.000', '20080428 00:00:00.000', '20080320 00:00:00.000', 1, 27.91, 'Ship to 47-B', 'Ave. 5 de Mayo Porlamar 4567', 'I. de Margarita', 'Nueva Esparta', '10231', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10955, 24, 8, '20080317 00:00:00.000', '20080414 00:00:00.000', '20080320 00:00:00.000', 2, 3.26, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10956, 6, 6, '20080317 00:00:00.000', '20080428 00:00:00.000', '20080320 00:00:00.000', 2, 44.65, 'Ship to 6-B', 'Forsterstr. 3456', 'Mannheim', NULL, '10301', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10957, 35, 8, '20080318 00:00:00.000', '20080415 00:00:00.000', '20080327 00:00:00.000', 3, 105.36, 'Destination UOUWK', 'Carrera 9012 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10197', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10958, 54, 7, '20080318 00:00:00.000', '20080415 00:00:00.000', '20080327 00:00:00.000', 2, 49.56, 'Ship to 54-C', 'Ing. Gustavo Moncada 6789 Piso 20-A', 'Buenos Aires', NULL, '10254', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10959, 31, 6, '20080318 00:00:00.000', '20080429 00:00:00.000', '20080323 00:00:00.000', 2, 4.98, 'Destination GWPFK', 'Av. Brasil, 0123', 'Campinas', 'SP', '10188', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10960, 35, 3, '20080319 00:00:00.000', '20080402 00:00:00.000', '20080408 00:00:00.000', 1, 2.08, 'Destination SXYQX', 'Carrera 0123 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10198', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10961, 62, 8, '20080319 00:00:00.000', '20080416 00:00:00.000', '20080330 00:00:00.000', 1, 104.47, 'Ship to 62-A', 'Alameda dos Canàrios, 8901', 'Sao Paulo', 'SP', '10276', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10962, 63, 8, '20080319 00:00:00.000', '20080416 00:00:00.000', '20080323 00:00:00.000', 2, 275.79, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10963, 28, 9, '20080319 00:00:00.000', '20080416 00:00:00.000', '20080326 00:00:00.000', 3, 2.70, 'Destination CIRQO', 'Jardim das rosas n. 8901', 'Lisboa', NULL, '10176', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10964, 74, 3, '20080320 00:00:00.000', '20080417 00:00:00.000', '20080324 00:00:00.000', 2, 87.38, 'Ship to 74-B', '4567, rue Lauristo', 'Paris', NULL, '10313', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10965, 55, 6, '20080320 00:00:00.000', '20080417 00:00:00.000', '20080330 00:00:00.000', 3, 144.38, 'Ship to 55-B', '8901 Bering St.', 'Anchorage', 'AK', '10256', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10966, 14, 4, '20080320 00:00:00.000', '20080417 00:00:00.000', '20080408 00:00:00.000', 1, 27.19, 'Destination NRTZZ', 'Hauptstr. 0123', 'Ber', NULL, '10138', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10967, 79, 2, '20080323 00:00:00.000', '20080420 00:00:00.000', '20080402 00:00:00.000', 2, 62.22, 'Ship to 79-B', 'Luisenstr. 8901', 'Münster', NULL, '10327', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10968, 20, 1, '20080323 00:00:00.000', '20080420 00:00:00.000', '20080401 00:00:00.000', 3, 74.60, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10969, 15, 1, '20080323 00:00:00.000', '20080420 00:00:00.000', '20080330 00:00:00.000', 2, 0.21, 'Destination EVHYA', 'Av. dos Lusíadas, 3456', 'Sao Paulo', 'SP', '10141', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10970, 8, 9, '20080324 00:00:00.000', '20080407 00:00:00.000', '20080424 00:00:00.000', 1, 16.16, 'Ship to 8-C', 'C/ Araquil, 1234', 'Madrid', NULL, '10360', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10971, 26, 2, '20080324 00:00:00.000', '20080421 00:00:00.000', '20080402 00:00:00.000', 2, 121.82, 'Destination XBVK', '3456, rue Royale', 'Nantes', NULL, '10171', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10972, 40, 4, '20080324 00:00:00.000', '20080421 00:00:00.000', '20080326 00:00:00.000', 2, 0.02, 'Destination MVTWX', '5678, avenue de l''Europe', 'Versailles', NULL, '10213', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10973, 40, 6, '20080324 00:00:00.000', '20080421 00:00:00.000', '20080327 00:00:00.000', 2, 15.17, 'Destination WWJLO', '6789, avenue de l''Europe', 'Versailles', NULL, '10214', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10974, 75, 3, '20080325 00:00:00.000', '20080408 00:00:00.000', '20080403 00:00:00.000', 3, 12.96, 'Ship to 75-B', 'P.O. Box 6789', 'Lander', 'WY', '10315', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10975, 10, 1, '20080325 00:00:00.000', '20080422 00:00:00.000', '20080327 00:00:00.000', 3, 32.27, 'Destination OLSSJ', '2345 Tsawassen Blvd.', 'Tsawasse', 'BC', '10130', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10976, 35, 1, '20080325 00:00:00.000', '20080506 00:00:00.000', '20080403 00:00:00.000', 1, 37.97, 'Destination SXYQX', 'Carrera 0123 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10198', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10977, 24, 8, '20080326 00:00:00.000', '20080423 00:00:00.000', '20080410 00:00:00.000', 3, 208.50, 'Destination NCKKO', 'Åkergatan 7890', 'Bräcke', NULL, '10165', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10978, 50, 9, '20080326 00:00:00.000', '20080423 00:00:00.000', '20080423 00:00:00.000', 2, 32.82, 'Ship to 50-A', 'Rue Joseph-Bens 3456', 'Bruxelles', NULL, '10241', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10979, 20, 8, '20080326 00:00:00.000', '20080423 00:00:00.000', '20080331 00:00:00.000', 2, 353.07, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10980, 24, 4, '20080327 00:00:00.000', '20080508 00:00:00.000', '20080417 00:00:00.000', 1, 1.26, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10981, 34, 1, '20080327 00:00:00.000', '20080424 00:00:00.000', '20080402 00:00:00.000', 2, 193.37, 'Destination JPAIY', 'Rua do Paço, 8901', 'Rio de Janeiro', 'RJ', '10196', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10982, 10, 2, '20080327 00:00:00.000', '20080424 00:00:00.000', '20080408 00:00:00.000', 1, 14.01, 'Destination XJIBQ', '1234 Tsawassen Blvd.', 'Tsawasse', 'BC', '10129', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10983, 71, 2, '20080327 00:00:00.000', '20080424 00:00:00.000', '20080406 00:00:00.000', 2, 657.54, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10984, 71, 1, '20080330 00:00:00.000', '20080427 00:00:00.000', '20080403 00:00:00.000', 3, 211.22, 'Ship to 71-B', '8901 Suffolk Ln.', 'Boise', 'ID', '10306', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10985, 37, 2, '20080330 00:00:00.000', '20080427 00:00:00.000', '20080402 00:00:00.000', 1, 91.51, 'Destination ATSOA', '4567 Johnstown Road', 'Cork', 'Co. Cork', '10202', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10986, 54, 8, '20080330 00:00:00.000', '20080427 00:00:00.000', '20080421 00:00:00.000', 2, 217.86, 'Ship to 54-A', 'Ing. Gustavo Moncada 4567 Piso 20-A', 'Buenos Aires', NULL, '10252', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10987, 19, 8, '20080331 00:00:00.000', '20080428 00:00:00.000', '20080406 00:00:00.000', 1, 185.48, 'Destination FRCGJ', '5678 King George', 'Londo', NULL, '10153', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10988, 65, 3, '20080331 00:00:00.000', '20080428 00:00:00.000', '20080410 00:00:00.000', 2, 61.14, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10989, 61, 2, '20080331 00:00:00.000', '20080428 00:00:00.000', '20080402 00:00:00.000', 1, 34.76, 'Ship to 61-A', 'Rua da Panificadora, 5678', 'Rio de Janeiro', 'RJ', '10273', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10990, 20, 2, '20080401 00:00:00.000', '20080513 00:00:00.000', '20080407 00:00:00.000', 3, 117.61, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10991, 63, 1, '20080401 00:00:00.000', '20080429 00:00:00.000', '20080407 00:00:00.000', 1, 38.51, 'Ship to 63-A', 'Taucherstraße 1234', 'Cunewalde', NULL, '10279', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10992, 77, 1, '20080401 00:00:00.000', '20080429 00:00:00.000', '20080403 00:00:00.000', 3, 4.27, 'Ship to 77-C', '3456 Jefferson Way Suite 2', 'Portland', 'OR', '10322', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10993, 24, 7, '20080401 00:00:00.000', '20080429 00:00:00.000', '20080410 00:00:00.000', 3, 8.81, 'Destination NCKKO', 'Åkergatan 7890', 'Bräcke', NULL, '10165', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10994, 83, 2, '20080402 00:00:00.000', '20080416 00:00:00.000', '20080409 00:00:00.000', 3, 65.53, 'Ship to 83-C', 'Smagsloget 2345', 'Århus', NULL, '10341', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10995, 58, 1, '20080402 00:00:00.000', '20080430 00:00:00.000', '20080406 00:00:00.000', 3, 46.00, 'Ship to 58-B', 'Calle Dr. Jorge Cash 4567', 'México D.F.', NULL, '10262', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10996, 63, 4, '20080402 00:00:00.000', '20080430 00:00:00.000', '20080410 00:00:00.000', 2, 1.12, 'Ship to 63-C', 'Taucherstraße 3456', 'Cunewalde', NULL, '10281', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10997, 46, 8, '20080403 00:00:00.000', '20080515 00:00:00.000', '20080413 00:00:00.000', 2, 73.91, 'Ship to 46-A', 'Carrera 0123 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10227', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10998, 91, 8, '20080403 00:00:00.000', '20080417 00:00:00.000', '20080417 00:00:00.000', 2, 20.31, 'Ship to 91-A', 'ul. Filtrowa 5678', 'Warszawa', NULL, '10364', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(10999, 56, 6, '20080403 00:00:00.000', '20080501 00:00:00.000', '20080410 00:00:00.000', 2, 96.35, 'Ship to 56-B', 'Mehrheimerstr. 1234', 'Köl', NULL, '10259', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11000, 65, 2, '20080406 00:00:00.000', '20080504 00:00:00.000', '20080414 00:00:00.000', 3, 55.12, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11001, 24, 2, '20080406 00:00:00.000', '20080504 00:00:00.000', '20080414 00:00:00.000', 2, 197.30, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11002, 71, 4, '20080406 00:00:00.000', '20080504 00:00:00.000', '20080416 00:00:00.000', 1, 141.16, 'Ship to 71-A', '7890 Suffolk Ln.', 'Boise', 'ID', '10305', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11003, 78, 3, '20080406 00:00:00.000', '20080504 00:00:00.000', '20080408 00:00:00.000', 3, 14.91, 'Ship to 78-B', '5678 Grizzly Peak Rd.', 'Butte', 'MT', '10324', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11004, 50, 3, '20080407 00:00:00.000', '20080505 00:00:00.000', '20080420 00:00:00.000', 1, 44.84, 'Ship to 50-C', 'Rue Joseph-Bens 5678', 'Bruxelles', NULL, '10243', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11005, 90, 2, '20080407 00:00:00.000', '20080505 00:00:00.000', '20080410 00:00:00.000', 1, 0.75, 'Ship to 90-A', 'Keskuskatu 2345', 'Helsinki', NULL, '10361', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11006, 32, 3, '20080407 00:00:00.000', '20080505 00:00:00.000', '20080415 00:00:00.000', 2, 25.19, 'Destination LLUXZ', '1234 Baker Blvd.', 'Eugene', 'OR', '10189', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11007, 60, 8, '20080408 00:00:00.000', '20080506 00:00:00.000', '20080413 00:00:00.000', 2, 202.24, 'Ship to 60-C', 'Estrada da saúde n. 4567', 'Lisboa', NULL, '10272', 'Portugal');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11008, 20, 7, '20080408 00:00:00.000', '20080506 00:00:00.000', NULL, 3, 79.46, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11009, 30, 2, '20080408 00:00:00.000', '20080506 00:00:00.000', '20080410 00:00:00.000', 1, 59.11, 'Destination WVLDH', 'C/ Romero, 7890', 'Sevilla', NULL, '10185', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11010, 66, 2, '20080409 00:00:00.000', '20080507 00:00:00.000', '20080421 00:00:00.000', 2, 28.71, 'Ship to 66-A', 'Strada Provinciale 0123', 'Reggio Emilia', NULL, '10288', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11011, 1, 3, '20080409 00:00:00.000', '20080507 00:00:00.000', '20080413 00:00:00.000', 1, 1.21, 'Destination LOUIE', 'Obere Str. 6789', 'Berli', NULL, '10154', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11012, 25, 1, '20080409 00:00:00.000', '20080423 00:00:00.000', '20080417 00:00:00.000', 3, 242.95, 'Destination WEGWI', 'Berliner Platz 2345', 'Münche', NULL, '10170', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11013, 69, 2, '20080409 00:00:00.000', '20080507 00:00:00.000', '20080410 00:00:00.000', 1, 32.99, 'Ship to 69-A', 'Gran Vía, 9012', 'Madrid', NULL, '10297', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11014, 47, 2, '20080410 00:00:00.000', '20080508 00:00:00.000', '20080415 00:00:00.000', 3, 23.60, 'Ship to 47-A', 'Ave. 5 de Mayo Porlamar 3456', 'I. de Margarita', 'Nueva Esparta', '10230', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11015, 70, 2, '20080410 00:00:00.000', '20080424 00:00:00.000', '20080420 00:00:00.000', 2, 4.62, 'Ship to 70-C', 'Erling Skakkes gate 6789', 'Staver', NULL, '10304', 'Norway');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11016, 4, 9, '20080410 00:00:00.000', '20080508 00:00:00.000', '20080413 00:00:00.000', 2, 33.80, 'Ship to 4-A', 'Brook Farm Stratford St. Mary 0123', 'Colchester', 'Essex', '10238', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11017, 20, 9, '20080413 00:00:00.000', '20080511 00:00:00.000', '20080420 00:00:00.000', 2, 754.26, 'Destination CUVPF', 'Kirchgasse 1234', 'Graz', NULL, '10159', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11018, 48, 4, '20080413 00:00:00.000', '20080511 00:00:00.000', '20080416 00:00:00.000', 2, 11.65, 'Ship to 48-B', '6789 Chiaroscuro Rd.', 'Portland', 'OR', '10233', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11019, 64, 6, '20080413 00:00:00.000', '20080511 00:00:00.000', NULL, 3, 3.17, 'Ship to 64-B', 'Av. del Libertador 5678', 'Buenos Aires', NULL, '10283', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11020, 56, 2, '20080414 00:00:00.000', '20080512 00:00:00.000', '20080416 00:00:00.000', 2, 43.30, 'Ship to 56-B', 'Mehrheimerstr. 1234', 'Köl', NULL, '10259', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11021, 63, 3, '20080414 00:00:00.000', '20080512 00:00:00.000', '20080421 00:00:00.000', 1, 297.18, 'Ship to 63-B', 'Taucherstraße 2345', 'Cunewalde', NULL, '10280', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11022, 34, 9, '20080414 00:00:00.000', '20080512 00:00:00.000', '20080504 00:00:00.000', 2, 6.27, 'Destination SCQXA', 'Rua do Paço, 7890', 'Rio de Janeiro', 'RJ', '10195', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11023, 11, 1, '20080414 00:00:00.000', '20080428 00:00:00.000', '20080424 00:00:00.000', 2, 123.83, 'Destination NZASL', 'Fauntleroy Circus 5678', 'Londo', NULL, '10133', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11024, 19, 4, '20080415 00:00:00.000', '20080513 00:00:00.000', '20080420 00:00:00.000', 1, 74.36, 'Destination BBMRT', '4567 King George', 'Londo', NULL, '10152', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11025, 87, 6, '20080415 00:00:00.000', '20080513 00:00:00.000', '20080424 00:00:00.000', 3, 29.17, 'Ship to 87-C', 'Torikatu 3456', 'Oulu', NULL, '10352', 'Finland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11026, 27, 4, '20080415 00:00:00.000', '20080513 00:00:00.000', '20080428 00:00:00.000', 1, 47.09, 'Destination DICGM', 'Via Monte Bianco 7890', 'Torino', NULL, '10175', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11027, 10, 1, '20080416 00:00:00.000', '20080514 00:00:00.000', '20080420 00:00:00.000', 1, 52.52, 'Destination XJIBQ', '1234 Tsawassen Blvd.', 'Tsawasse', 'BC', '10129', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11028, 39, 2, '20080416 00:00:00.000', '20080514 00:00:00.000', '20080422 00:00:00.000', 1, 29.59, 'Destination DKMQA', 'Maubelstr. 0123', 'Brandenburg', NULL, '10208', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11029, 14, 4, '20080416 00:00:00.000', '20080514 00:00:00.000', '20080427 00:00:00.000', 1, 47.84, 'Destination YUJRD', 'Hauptstr. 1234', 'Ber', NULL, '10139', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11030, 71, 7, '20080417 00:00:00.000', '20080515 00:00:00.000', '20080427 00:00:00.000', 2, 830.75, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11031, 71, 6, '20080417 00:00:00.000', '20080515 00:00:00.000', '20080424 00:00:00.000', 2, 227.22, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11032, 89, 2, '20080417 00:00:00.000', '20080515 00:00:00.000', '20080423 00:00:00.000', 3, 606.19, 'Ship to 89-B', '8901 - 12th Ave. S.', 'Seattle', 'WA', '10357', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11033, 68, 7, '20080417 00:00:00.000', '20080515 00:00:00.000', '20080423 00:00:00.000', 3, 84.74, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11034, 55, 8, '20080420 00:00:00.000', '20080601 00:00:00.000', '20080427 00:00:00.000', 1, 40.32, 'Ship to 55-B', '8901 Bering St.', 'Anchorage', 'AK', '10256', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11035, 76, 2, '20080420 00:00:00.000', '20080518 00:00:00.000', '20080424 00:00:00.000', 2, 0.17, 'Ship to 76-B', 'Boulevard Tirou, 9012', 'Charleroi', NULL, '10318', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11036, 17, 8, '20080420 00:00:00.000', '20080518 00:00:00.000', '20080422 00:00:00.000', 3, 149.47, 'Destination YPUYI', 'Walserweg 8901', 'Aache', NULL, '10146', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11037, 30, 7, '20080421 00:00:00.000', '20080519 00:00:00.000', '20080427 00:00:00.000', 1, 3.20, 'Destination GGQIR', 'C/ Romero, 6789', 'Sevilla', NULL, '10184', 'Spai');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11038, 76, 1, '20080421 00:00:00.000', '20080519 00:00:00.000', '20080430 00:00:00.000', 2, 29.59, 'Ship to 76-A', 'Boulevard Tirou, 8901', 'Charleroi', NULL, '10317', 'Belgium');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11039, 47, 1, '20080421 00:00:00.000', '20080519 00:00:00.000', NULL, 2, 65.00, 'Ship to 47-C', 'Ave. 5 de Mayo Porlamar 5678', 'I. de Margarita', 'Nueva Esparta', '10232', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11040, 32, 4, '20080422 00:00:00.000', '20080520 00:00:00.000', NULL, 3, 18.84, 'Destination VYOBK', '3456 Baker Blvd.', 'Eugene', 'OR', '10191', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11041, 14, 3, '20080422 00:00:00.000', '20080520 00:00:00.000', '20080428 00:00:00.000', 2, 48.22, 'Destination YUJRD', 'Hauptstr. 1234', 'Ber', NULL, '10139', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11042, 15, 2, '20080422 00:00:00.000', '20080506 00:00:00.000', '20080501 00:00:00.000', 1, 29.99, 'Destination EVHYA', 'Av. dos Lusíadas, 3456', 'Sao Paulo', 'SP', '10141', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11043, 74, 5, '20080422 00:00:00.000', '20080520 00:00:00.000', '20080429 00:00:00.000', 2, 8.80, 'Ship to 74-B', '4567, rue Lauristo', 'Paris', NULL, '10313', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11044, 91, 4, '20080423 00:00:00.000', '20080521 00:00:00.000', '20080501 00:00:00.000', 1, 8.72, 'Ship to 91-B', 'ul. Filtrowa 6789', 'Warszawa', NULL, '10365', 'Poland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11045, 10, 6, '20080423 00:00:00.000', '20080521 00:00:00.000', NULL, 2, 70.58, 'Destination LPHSI', '3456 Tsawassen Blvd.', 'Tsawasse', 'BC', '10131', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11046, 86, 8, '20080423 00:00:00.000', '20080521 00:00:00.000', '20080424 00:00:00.000', 2, 71.64, 'Ship to 86-C', 'Adenauerallee 0123', 'Stuttgart', NULL, '10349', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11047, 19, 7, '20080424 00:00:00.000', '20080522 00:00:00.000', '20080501 00:00:00.000', 3, 46.62, 'Destination FRCGJ', '5678 King George', 'Londo', NULL, '10153', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11048, 10, 7, '20080424 00:00:00.000', '20080522 00:00:00.000', '20080430 00:00:00.000', 3, 24.12, 'Destination XJIBQ', '1234 Tsawassen Blvd.', 'Tsawasse', 'BC', '10129', 'Canada');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11049, 31, 3, '20080424 00:00:00.000', '20080522 00:00:00.000', '20080504 00:00:00.000', 1, 8.34, 'Destination XOIGC', 'Av. Brasil, 8901', 'Campinas', 'SP', '10186', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11050, 24, 8, '20080427 00:00:00.000', '20080525 00:00:00.000', '20080505 00:00:00.000', 2, 59.41, 'Destination YCMPK', 'Åkergatan 8901', 'Bräcke', NULL, '10166', 'Swede');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11051, 41, 7, '20080427 00:00:00.000', '20080525 00:00:00.000', NULL, 3, 2.79, 'Destination OLJND', '8901 rue Alsace-Lorraine', 'Toulouse', NULL, '10216', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11052, 34, 3, '20080427 00:00:00.000', '20080525 00:00:00.000', '20080501 00:00:00.000', 1, 67.26, 'Destination DPCVR', 'Rua do Paço, 6789', 'Rio de Janeiro', 'RJ', '10194', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11053, 59, 2, '20080427 00:00:00.000', '20080525 00:00:00.000', '20080429 00:00:00.000', 2, 53.05, 'Ship to 59-A', 'Geislweg 6789', 'Salzburg', NULL, '10264', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11054, 12, 8, '20080428 00:00:00.000', '20080526 00:00:00.000', NULL, 1, 0.33, 'Destination QTHBC', 'Cerrito 6789', 'Buenos Aires', NULL, '10134', 'Argentina');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11055, 35, 7, '20080428 00:00:00.000', '20080526 00:00:00.000', '20080505 00:00:00.000', 2, 120.92, 'Destination JYDLM', 'Carrera1234 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 'Táchira', '10199', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11056, 19, 8, '20080428 00:00:00.000', '20080512 00:00:00.000', '20080501 00:00:00.000', 2, 278.96, 'Destination QTKCU', '3456 King George', 'Londo', NULL, '10151', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11057, 53, 3, '20080429 00:00:00.000', '20080527 00:00:00.000', '20080501 00:00:00.000', 3, 4.13, 'Ship to 53-C', 'South House 3456 Queensbridge', 'Londo', NULL, '10251', 'UK');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11058, 6, 9, '20080429 00:00:00.000', '20080527 00:00:00.000', NULL, 3, 31.14, 'Ship to 6-A', 'Forsterstr. 2345', 'Mannheim', NULL, '10300', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11059, 67, 2, '20080429 00:00:00.000', '20080610 00:00:00.000', NULL, 2, 85.80, 'Ship to 67-A', 'Av. Copacabana, 3456', 'Rio de Janeiro', 'RJ', '10291', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11060, 27, 2, '20080430 00:00:00.000', '20080528 00:00:00.000', '20080504 00:00:00.000', 2, 10.98, 'Destination DICGM', 'Via Monte Bianco 7890', 'Torino', NULL, '10175', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11061, 32, 4, '20080430 00:00:00.000', '20080611 00:00:00.000', NULL, 3, 14.01, 'Destination VYOBK', '3456 Baker Blvd.', 'Eugene', 'OR', '10191', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11062, 66, 4, '20080430 00:00:00.000', '20080528 00:00:00.000', NULL, 2, 29.93, 'Ship to 66-B', 'Strada Provinciale 1234', 'Reggio Emilia', NULL, '10289', 'Italy');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11063, 37, 3, '20080430 00:00:00.000', '20080528 00:00:00.000', '20080506 00:00:00.000', 2, 81.73, 'Destination KPVYJ', '5678 Johnstown Road', 'Cork', 'Co. Cork', '10203', 'Ireland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11064, 71, 1, '20080501 00:00:00.000', '20080529 00:00:00.000', '20080504 00:00:00.000', 1, 30.09, 'Ship to 71-C', '9012 Suffolk Ln.', 'Boise', 'ID', '10307', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11065, 46, 8, '20080501 00:00:00.000', '20080529 00:00:00.000', NULL, 1, 12.91, 'Ship to 46-C', 'Carrera 2345 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10229', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11066, 89, 7, '20080501 00:00:00.000', '20080529 00:00:00.000', '20080504 00:00:00.000', 2, 44.72, 'Ship to 89-A', '7890 - 12th Ave. S.', 'Seattle', 'WA', '10356', 'USA');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11067, 17, 1, '20080504 00:00:00.000', '20080518 00:00:00.000', '20080506 00:00:00.000', 2, 7.98, 'Destination BJCXA', 'Walserweg 7890', 'Aache', NULL, '10145', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11068, 62, 8, '20080504 00:00:00.000', '20080601 00:00:00.000', NULL, 2, 81.75, 'Ship to 62-A', 'Alameda dos Canàrios, 8901', 'Sao Paulo', 'SP', '10276', 'Brazil');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11069, 80, 1, '20080504 00:00:00.000', '20080601 00:00:00.000', '20080506 00:00:00.000', 2, 15.67, 'Ship to 80-B', 'Avda. Azteca 4567', 'México D.F.', NULL, '10333', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11070, 44, 2, '20080505 00:00:00.000', '20080602 00:00:00.000', NULL, 1, 136.00, 'Ship to 44-A', 'Magazinweg 4567', 'Frankfurt a.M.', NULL, '10222', 'Germany');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11071, 46, 1, '20080505 00:00:00.000', '20080602 00:00:00.000', NULL, 1, 0.93, 'Ship to 46-B', 'Carrera 1234 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 'Lara', '10228', 'Venezuela');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11072, 20, 4, '20080505 00:00:00.000', '20080602 00:00:00.000', NULL, 2, 258.64, 'Destination RVDMF', 'Kirchgasse 9012', 'Graz', NULL, '10157', 'Austria');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11073, 58, 2, '20080505 00:00:00.000', '20080602 00:00:00.000', NULL, 2, 24.95, 'Ship to 58-B', 'Calle Dr. Jorge Cash 4567', 'México D.F.', NULL, '10262', 'Mexico');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11074, 73, 7, '20080506 00:00:00.000', '20080603 00:00:00.000', NULL, 2, 18.44, 'Ship to 73-A', 'Vinbæltet 1234', 'Kobenhav', NULL, '10310', 'Denmark');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11075, 68, 8, '20080506 00:00:00.000', '20080603 00:00:00.000', NULL, 2, 6.19, 'Ship to 68-A', 'Starenweg 6789', 'Genève', NULL, '10294', 'Switzerland');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11076, 9, 4, '20080506 00:00:00.000', '20080603 00:00:00.000', NULL, 2, 38.28, 'Ship to 9-A', '8901, rue des Bouchers', 'Marseille', NULL, '10367', 'France');
INSERT INTO Orders(orderid, custid, empid, orderdate, requireddate, shippeddate, shipperid, freight, shipname, shipaddress, shipcity, shipregion, shippostalcode, shipcountry)
  VALUES(11077, 65, 1, '20080506 00:00:00.000', '20080603 00:00:00.000', NULL, 2, 8.53, 'Ship to 65-A', '7890 Milton Dr.', 'Albuquerque', 'NM', '10285', 'USA');

INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10248, 11, 14.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10248, 42, 9.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10248, 72, 34.80, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10249, 14, 18.60, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10249, 51, 42.40, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10250, 41, 7.70, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10250, 51, 42.40, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10250, 65, 16.80, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10251, 22, 16.80, 6, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10251, 57, 15.60, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10251, 65, 16.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10252, 20, 64.80, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10252, 33, 2.00, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10252, 60, 27.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10253, 31, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10253, 39, 14.40, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10253, 49, 16.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10254, 24, 3.60, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10254, 55, 19.20, 21, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10254, 74, 8.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10255, 2, 15.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10255, 16, 13.90, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10255, 36, 15.20, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10255, 59, 44.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10256, 53, 26.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10256, 77, 10.40, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10257, 27, 35.10, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10257, 39, 14.40, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10257, 77, 10.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10258, 2, 15.20, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10258, 5, 17.00, 65, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10258, 32, 25.60, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10259, 21, 8.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10259, 37, 20.80, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10260, 41, 7.70, 16, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10260, 57, 15.60, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10260, 62, 39.40, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10260, 70, 12.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10261, 21, 8.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10261, 35, 14.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10262, 5, 17.00, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10262, 7, 24.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10262, 56, 30.40, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10263, 16, 13.90, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10263, 24, 3.60, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10263, 30, 20.70, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10263, 74, 8.00, 36, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10264, 2, 15.20, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10264, 41, 7.70, 25, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10265, 17, 31.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10265, 70, 12.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10266, 12, 30.40, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10267, 40, 14.70, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10267, 59, 44.00, 70, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10267, 76, 14.40, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10268, 29, 99.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10268, 72, 27.80, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10269, 33, 2.00, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10269, 72, 27.80, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10270, 36, 15.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10270, 43, 36.80, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10271, 33, 2.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10272, 20, 64.80, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10272, 31, 10.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10272, 72, 27.80, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10273, 10, 24.80, 24, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10273, 31, 10.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10273, 33, 2.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10273, 40, 14.70, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10273, 76, 14.40, 33, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10274, 71, 17.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10274, 72, 27.80, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10275, 24, 3.60, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10275, 59, 44.00, 6, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10276, 10, 24.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10276, 13, 4.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10277, 28, 36.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10277, 62, 39.40, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10278, 44, 15.50, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10278, 59, 44.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10278, 63, 35.10, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10278, 73, 12.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10279, 17, 31.20, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10280, 24, 3.60, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10280, 55, 19.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10280, 75, 6.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10281, 19, 7.30, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10281, 24, 3.60, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10281, 35, 14.40, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10282, 30, 20.70, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10282, 57, 15.60, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10283, 15, 12.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10283, 19, 7.30, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10283, 60, 27.20, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10283, 72, 27.80, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10284, 27, 35.10, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10284, 44, 15.50, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10284, 60, 27.20, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10284, 67, 11.20, 5, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10285, 1, 14.40, 45, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10285, 40, 14.70, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10285, 53, 26.20, 36, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10286, 35, 14.40, 100, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10286, 62, 39.40, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10287, 16, 13.90, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10287, 34, 11.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10287, 46, 9.60, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10288, 54, 5.90, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10288, 68, 10.00, 3, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10289, 3, 8.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10289, 64, 26.60, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10290, 5, 17.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10290, 29, 99.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10290, 49, 16.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10290, 77, 10.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10291, 13, 4.80, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10291, 44, 15.50, 24, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10291, 51, 42.40, 2, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10292, 20, 64.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10293, 18, 50.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10293, 24, 3.60, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10293, 63, 35.10, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10293, 75, 6.20, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10294, 1, 14.40, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10294, 17, 31.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10294, 43, 36.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10294, 60, 27.20, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10294, 75, 6.20, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10295, 56, 30.40, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10296, 11, 16.80, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10296, 16, 13.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10296, 69, 28.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10297, 39, 14.40, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10297, 72, 27.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10298, 2, 15.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10298, 36, 15.20, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10298, 59, 44.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10298, 62, 39.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10299, 19, 7.30, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10299, 70, 12.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10300, 66, 13.60, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10300, 68, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10301, 40, 14.70, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10301, 56, 30.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10302, 17, 31.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10302, 28, 36.40, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10302, 43, 36.80, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10303, 40, 14.70, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10303, 65, 16.80, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10303, 68, 10.00, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10304, 49, 16.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10304, 59, 44.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10304, 71, 17.20, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10305, 18, 50.00, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10305, 29, 99.00, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10305, 39, 14.40, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10306, 30, 20.70, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10306, 53, 26.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10306, 54, 5.90, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10307, 62, 39.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10307, 68, 10.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10308, 69, 28.80, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10308, 70, 12.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10309, 4, 17.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10309, 6, 20.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10309, 42, 11.20, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10309, 43, 36.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10309, 71, 17.20, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10310, 16, 13.90, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10310, 62, 39.40, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10311, 42, 11.20, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10311, 69, 28.80, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10312, 28, 36.40, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10312, 43, 36.80, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10312, 53, 26.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10312, 75, 6.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10313, 36, 15.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10314, 32, 25.60, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10314, 58, 10.60, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10314, 62, 39.40, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10315, 34, 11.20, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10315, 70, 12.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10316, 41, 7.70, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10316, 62, 39.40, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10317, 1, 14.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10318, 41, 7.70, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10318, 76, 14.40, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10319, 17, 31.20, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10319, 28, 36.40, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10319, 76, 14.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10320, 71, 17.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10321, 35, 14.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10322, 52, 5.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10323, 15, 12.40, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10323, 25, 11.20, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10323, 39, 14.40, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10324, 16, 13.90, 21, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10324, 35, 14.40, 70, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10324, 46, 9.60, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10324, 59, 44.00, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10324, 63, 35.10, 80, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10325, 6, 20.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10325, 13, 4.80, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10325, 14, 18.60, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10325, 31, 10.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10325, 72, 27.80, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10326, 4, 17.60, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10326, 57, 15.60, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10326, 75, 6.20, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10327, 2, 15.20, 25, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10327, 11, 16.80, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10327, 30, 20.70, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10327, 58, 10.60, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10328, 59, 44.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10328, 65, 16.80, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10328, 68, 10.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10329, 19, 7.30, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10329, 30, 20.70, 8, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10329, 38, 210.80, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10329, 56, 30.40, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10330, 26, 24.90, 50, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10330, 72, 27.80, 25, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10331, 54, 5.90, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10332, 18, 50.00, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10332, 42, 11.20, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10332, 47, 7.60, 16, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10333, 14, 18.60, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10333, 21, 8.00, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10333, 71, 17.20, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10334, 52, 5.60, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10334, 68, 10.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10335, 2, 15.20, 7, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10335, 31, 10.00, 25, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10335, 32, 25.60, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10335, 51, 42.40, 48, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10336, 4, 17.60, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10337, 23, 7.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10337, 26, 24.90, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10337, 36, 15.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10337, 37, 20.80, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10337, 72, 27.80, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10338, 17, 31.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10338, 30, 20.70, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10339, 4, 17.60, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10339, 17, 31.20, 70, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10339, 62, 39.40, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10340, 18, 50.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10340, 41, 7.70, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10340, 43, 36.80, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10341, 33, 2.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10341, 59, 44.00, 9, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10342, 2, 15.20, 24, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10342, 31, 10.00, 56, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10342, 36, 15.20, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10342, 55, 19.20, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10343, 64, 26.60, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10343, 68, 10.00, 4, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10343, 76, 14.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10344, 4, 17.60, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10344, 8, 32.00, 70, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10345, 8, 32.00, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10345, 19, 7.30, 80, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10345, 42, 11.20, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10346, 17, 31.20, 36, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10346, 56, 30.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10347, 25, 11.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10347, 39, 14.40, 50, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10347, 40, 14.70, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10347, 75, 6.20, 6, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10348, 1, 14.40, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10348, 23, 7.20, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10349, 54, 5.90, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10350, 50, 13.00, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10350, 69, 28.80, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10351, 38, 210.80, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10351, 41, 7.70, 13, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10351, 44, 15.50, 77, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10351, 65, 16.80, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10352, 24, 3.60, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10352, 54, 5.90, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10353, 11, 16.80, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10353, 38, 210.80, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10354, 1, 14.40, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10354, 29, 99.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10355, 24, 3.60, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10355, 57, 15.60, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10356, 31, 10.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10356, 55, 19.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10356, 69, 28.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10357, 10, 24.80, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10357, 26, 24.90, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10357, 60, 27.20, 8, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10358, 24, 3.60, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10358, 34, 11.20, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10358, 36, 15.20, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10359, 16, 13.90, 56, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10359, 31, 10.00, 70, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10359, 60, 27.20, 80, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10360, 28, 36.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10360, 29, 99.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10360, 38, 210.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10360, 49, 16.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10360, 54, 5.90, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10361, 39, 14.40, 54, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10361, 60, 27.20, 55, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10362, 25, 11.20, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10362, 51, 42.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10362, 54, 5.90, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10363, 31, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10363, 75, 6.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10363, 76, 14.40, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10364, 69, 28.80, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10364, 71, 17.20, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10365, 11, 16.80, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10366, 65, 16.80, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10366, 77, 10.40, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10367, 34, 11.20, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10367, 54, 5.90, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10367, 65, 16.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10367, 77, 10.40, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10368, 21, 8.00, 5, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10368, 28, 36.40, 13, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10368, 57, 15.60, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10368, 64, 26.60, 35, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10369, 29, 99.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10369, 56, 30.40, 18, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10370, 1, 14.40, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10370, 64, 26.60, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10370, 74, 8.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10371, 36, 15.20, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10372, 20, 64.80, 12, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10372, 38, 210.80, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10372, 60, 27.20, 70, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10372, 72, 27.80, 42, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10373, 58, 10.60, 80, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10373, 71, 17.20, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10374, 31, 10.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10374, 58, 10.60, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10375, 14, 18.60, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10375, 54, 5.90, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10376, 31, 10.00, 42, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10377, 28, 36.40, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10377, 39, 14.40, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10378, 71, 17.20, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10379, 41, 7.70, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10379, 63, 35.10, 16, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10379, 65, 16.80, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10380, 30, 20.70, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10380, 53, 26.20, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10380, 60, 27.20, 6, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10380, 70, 12.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10381, 74, 8.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10382, 5, 17.00, 32, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10382, 18, 50.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10382, 29, 99.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10382, 33, 2.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10382, 74, 8.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10383, 13, 4.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10383, 50, 13.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10383, 56, 30.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10384, 20, 64.80, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10384, 60, 27.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10385, 7, 24.00, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10385, 60, 27.20, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10385, 68, 10.00, 8, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10386, 24, 3.60, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10386, 34, 11.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10387, 24, 3.60, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10387, 28, 36.40, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10387, 59, 44.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10387, 71, 17.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10388, 45, 7.60, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10388, 52, 5.60, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10388, 53, 26.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10389, 10, 24.80, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10389, 55, 19.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10389, 62, 39.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10389, 70, 12.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10390, 31, 10.00, 60, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10390, 35, 14.40, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10390, 46, 9.60, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10390, 72, 27.80, 24, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10391, 13, 4.80, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10392, 69, 28.80, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10393, 2, 15.20, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10393, 14, 18.60, 42, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10393, 25, 11.20, 7, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10393, 26, 24.90, 70, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10393, 31, 10.00, 32, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10394, 13, 4.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10394, 62, 39.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10395, 46, 9.60, 28, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10395, 53, 26.20, 70, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10395, 69, 28.80, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10396, 23, 7.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10396, 71, 17.20, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10396, 72, 27.80, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10397, 21, 8.00, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10397, 51, 42.40, 18, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10398, 35, 14.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10398, 55, 19.20, 120, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10399, 68, 10.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10399, 71, 17.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10399, 76, 14.40, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10399, 77, 10.40, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10400, 29, 99.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10400, 35, 14.40, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10400, 49, 16.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10401, 30, 20.70, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10401, 56, 30.40, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10401, 65, 16.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10401, 71, 17.20, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10402, 23, 7.20, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10402, 63, 35.10, 65, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10403, 16, 13.90, 21, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10403, 48, 10.20, 70, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10404, 26, 24.90, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10404, 42, 11.20, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10404, 49, 16.00, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10405, 3, 8.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10406, 1, 14.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10406, 21, 8.00, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10406, 28, 36.40, 42, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10406, 36, 15.20, 5, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10406, 40, 14.70, 2, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10407, 11, 16.80, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10407, 69, 28.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10407, 71, 17.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10408, 37, 20.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10408, 54, 5.90, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10408, 62, 39.40, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10409, 14, 18.60, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10409, 21, 8.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10410, 33, 2.00, 49, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10410, 59, 44.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10411, 41, 7.70, 25, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10411, 44, 15.50, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10411, 59, 44.00, 9, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10412, 14, 18.60, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10413, 1, 14.40, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10413, 62, 39.40, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10413, 76, 14.40, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10414, 19, 7.30, 18, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10414, 33, 2.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10415, 17, 31.20, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10415, 33, 2.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10416, 19, 7.30, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10416, 53, 26.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10416, 57, 15.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10417, 38, 210.80, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10417, 46, 9.60, 2, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10417, 68, 10.00, 36, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10417, 77, 10.40, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10418, 2, 15.20, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10418, 47, 7.60, 55, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10418, 61, 22.80, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10418, 74, 8.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10419, 60, 27.20, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10419, 69, 28.80, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10420, 9, 77.60, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10420, 13, 4.80, 2, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10420, 70, 12.00, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10420, 73, 12.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10421, 19, 7.30, 4, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10421, 26, 24.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10421, 53, 26.20, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10421, 77, 10.40, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10422, 26, 24.90, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10423, 31, 10.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10423, 59, 44.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10424, 35, 14.40, 60, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10424, 38, 210.80, 49, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10424, 68, 10.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10425, 55, 19.20, 10, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10425, 76, 14.40, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10426, 56, 30.40, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10426, 64, 26.60, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10427, 14, 18.60, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10428, 46, 9.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10429, 50, 13.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10429, 63, 35.10, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10430, 17, 31.20, 45, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10430, 21, 8.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10430, 56, 30.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10430, 59, 44.00, 70, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10431, 17, 31.20, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10431, 40, 14.70, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10431, 47, 7.60, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10432, 26, 24.90, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10432, 54, 5.90, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10433, 56, 30.40, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10434, 11, 16.80, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10434, 76, 14.40, 18, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10435, 2, 15.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10435, 22, 16.80, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10435, 72, 27.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10436, 46, 9.60, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10436, 56, 30.40, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10436, 64, 26.60, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10436, 75, 6.20, 24, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10437, 53, 26.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10438, 19, 7.30, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10438, 34, 11.20, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10438, 57, 15.60, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10439, 12, 30.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10439, 16, 13.90, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10439, 64, 26.60, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10439, 74, 8.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10440, 2, 15.20, 45, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10440, 16, 13.90, 49, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10440, 29, 99.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10440, 61, 22.80, 90, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10441, 27, 35.10, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10442, 11, 16.80, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10442, 54, 5.90, 80, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10442, 66, 13.60, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10443, 11, 16.80, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10443, 28, 36.40, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10444, 17, 31.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10444, 26, 24.90, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10444, 35, 14.40, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10444, 41, 7.70, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10445, 39, 14.40, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10445, 54, 5.90, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10446, 19, 7.30, 12, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10446, 24, 3.60, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10446, 31, 10.00, 3, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10446, 52, 5.60, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10447, 19, 7.30, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10447, 65, 16.80, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10447, 71, 17.20, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10448, 26, 24.90, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10448, 40, 14.70, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10449, 10, 24.80, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10449, 52, 5.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10449, 62, 39.40, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10450, 10, 24.80, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10450, 54, 5.90, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10451, 55, 19.20, 120, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10451, 64, 26.60, 35, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10451, 65, 16.80, 28, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10451, 77, 10.40, 55, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10452, 28, 36.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10452, 44, 15.50, 100, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10453, 48, 10.20, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10453, 70, 12.00, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10454, 16, 13.90, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10454, 33, 2.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10454, 46, 9.60, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10455, 39, 14.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10455, 53, 26.20, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10455, 61, 22.80, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10455, 71, 17.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10456, 21, 8.00, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10456, 49, 16.00, 21, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10457, 59, 44.00, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10458, 26, 24.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10458, 28, 36.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10458, 43, 36.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10458, 56, 30.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10458, 71, 17.20, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10459, 7, 24.00, 16, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10459, 46, 9.60, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10459, 72, 27.80, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10460, 68, 10.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10460, 75, 6.20, 4, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10461, 21, 8.00, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10461, 30, 20.70, 28, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10461, 55, 19.20, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10462, 13, 4.80, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10462, 23, 7.20, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10463, 19, 7.30, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10463, 42, 11.20, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10464, 4, 17.60, 16, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10464, 43, 36.80, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10464, 56, 30.40, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10464, 60, 27.20, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10465, 24, 3.60, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10465, 29, 99.00, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10465, 40, 14.70, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10465, 45, 7.60, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10465, 50, 13.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10466, 11, 16.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10466, 46, 9.60, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10467, 24, 3.60, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10467, 25, 11.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10468, 30, 20.70, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10468, 43, 36.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10469, 2, 15.20, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10469, 16, 13.90, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10469, 44, 15.50, 2, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10470, 18, 50.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10470, 23, 7.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10470, 64, 26.60, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10471, 7, 24.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10471, 56, 30.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10472, 24, 3.60, 80, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10472, 51, 42.40, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10473, 33, 2.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10473, 71, 17.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10474, 14, 18.60, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10474, 28, 36.40, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10474, 40, 14.70, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10474, 75, 6.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10475, 31, 10.00, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10475, 66, 13.60, 60, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10475, 76, 14.40, 42, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10476, 55, 19.20, 2, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10476, 70, 12.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10477, 1, 14.40, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10477, 21, 8.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10477, 39, 14.40, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10478, 10, 24.80, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10479, 38, 210.80, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10479, 53, 26.20, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10479, 59, 44.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10479, 64, 26.60, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10480, 47, 7.60, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10480, 59, 44.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10481, 49, 16.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10481, 60, 27.20, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10482, 40, 14.70, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10483, 34, 11.20, 35, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10483, 77, 10.40, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10484, 21, 8.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10484, 40, 14.70, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10484, 51, 42.40, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10485, 2, 15.20, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10485, 3, 8.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10485, 55, 19.20, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10485, 70, 12.00, 60, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10486, 11, 16.80, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10486, 51, 42.40, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10486, 74, 8.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10487, 19, 7.30, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10487, 26, 24.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10487, 54, 5.90, 24, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10488, 59, 44.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10488, 73, 12.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10489, 11, 16.80, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10489, 16, 13.90, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10490, 59, 44.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10490, 68, 10.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10490, 75, 6.20, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10491, 44, 15.50, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10491, 77, 10.40, 7, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10492, 25, 11.20, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10492, 42, 11.20, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10493, 65, 16.80, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10493, 66, 13.60, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10493, 69, 28.80, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10494, 56, 30.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10495, 23, 7.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10495, 41, 7.70, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10495, 77, 10.40, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10496, 31, 10.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10497, 56, 30.40, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10497, 72, 27.80, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10497, 77, 10.40, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10498, 24, 4.50, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10498, 40, 18.40, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10498, 42, 14.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10499, 28, 45.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10499, 49, 20.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10500, 15, 15.50, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10500, 28, 45.60, 8, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10501, 54, 7.45, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10502, 45, 9.50, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10502, 53, 32.80, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10502, 67, 14.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10503, 14, 23.25, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10503, 65, 21.05, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10504, 2, 19.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10504, 21, 10.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10504, 53, 32.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10504, 61, 28.50, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10505, 62, 49.30, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10506, 25, 14.00, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10506, 70, 15.00, 14, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10507, 43, 46.00, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10507, 48, 12.75, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10508, 13, 6.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10508, 39, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10509, 28, 45.60, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10510, 29, 123.79, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10510, 75, 7.75, 36, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10511, 4, 22.00, 50, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10511, 7, 30.00, 50, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10511, 8, 40.00, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10512, 24, 4.50, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10512, 46, 12.00, 9, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10512, 47, 9.50, 6, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10512, 60, 34.00, 12, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10513, 21, 10.00, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10513, 32, 32.00, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10513, 61, 28.50, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10514, 20, 81.00, 39, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10514, 28, 45.60, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10514, 56, 38.00, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10514, 65, 21.05, 39, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10514, 75, 7.75, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10515, 9, 97.00, 16, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10515, 16, 17.45, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10515, 27, 43.90, 120, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10515, 33, 2.50, 16, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10515, 60, 34.00, 84, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10516, 18, 62.50, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10516, 41, 9.65, 80, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10516, 42, 14.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10517, 52, 7.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10517, 59, 55.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10517, 70, 15.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10518, 24, 4.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10518, 38, 263.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10518, 44, 19.45, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10519, 10, 31.00, 16, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10519, 56, 38.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10519, 60, 34.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10520, 24, 4.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10520, 53, 32.80, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10521, 35, 18.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10521, 41, 9.65, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10521, 68, 12.50, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10522, 1, 18.00, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10522, 8, 40.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10522, 30, 25.89, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10522, 40, 18.40, 25, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10523, 17, 39.00, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10523, 20, 81.00, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10523, 37, 26.00, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10523, 41, 9.65, 6, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10524, 10, 31.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10524, 30, 25.89, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10524, 43, 46.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10524, 54, 7.45, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10525, 36, 19.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10525, 40, 18.40, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10526, 1, 18.00, 8, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10526, 13, 6.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10526, 56, 38.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10527, 4, 22.00, 50, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10527, 36, 19.00, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10528, 11, 21.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10528, 33, 2.50, 8, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10528, 72, 34.80, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10529, 55, 24.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10529, 68, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10529, 69, 36.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10530, 17, 39.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10530, 43, 46.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10530, 61, 28.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10530, 76, 18.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10531, 59, 55.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10532, 30, 25.89, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10532, 66, 17.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10533, 4, 22.00, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10533, 72, 34.80, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10533, 73, 15.00, 24, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10534, 30, 25.89, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10534, 40, 18.40, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10534, 54, 7.45, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10535, 11, 21.00, 50, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10535, 40, 18.40, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10535, 57, 19.50, 5, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10535, 59, 55.00, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10536, 12, 38.00, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10536, 31, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10536, 33, 2.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10536, 60, 34.00, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10537, 31, 12.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10537, 51, 53.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10537, 58, 13.25, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10537, 72, 34.80, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10537, 73, 15.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10538, 70, 15.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10538, 72, 34.80, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10539, 13, 6.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10539, 21, 10.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10539, 33, 2.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10539, 49, 20.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10540, 3, 10.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10540, 26, 31.23, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10540, 38, 263.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10540, 68, 12.50, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10541, 24, 4.50, 35, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10541, 38, 263.50, 4, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10541, 65, 21.05, 36, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10541, 71, 21.50, 9, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10542, 11, 21.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10542, 54, 7.45, 24, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10543, 12, 38.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10543, 23, 9.00, 70, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10544, 28, 45.60, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10544, 67, 14.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10545, 11, 21.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10546, 7, 30.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10546, 35, 18.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10546, 62, 49.30, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10547, 32, 32.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10547, 36, 19.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10548, 34, 14.00, 10, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10548, 41, 9.65, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10549, 31, 12.50, 55, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10549, 45, 9.50, 100, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10549, 51, 53.00, 48, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10550, 17, 39.00, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10550, 19, 9.20, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10550, 21, 10.00, 6, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10550, 61, 28.50, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10551, 16, 17.45, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10551, 35, 18.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10551, 44, 19.45, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10552, 69, 36.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10552, 75, 7.75, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10553, 11, 21.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10553, 16, 17.45, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10553, 22, 21.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10553, 31, 12.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10553, 35, 18.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10554, 16, 17.45, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10554, 23, 9.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10554, 62, 49.30, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10554, 77, 13.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10555, 14, 23.25, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10555, 19, 9.20, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10555, 24, 4.50, 18, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10555, 51, 53.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10555, 56, 38.00, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10556, 72, 34.80, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10557, 64, 33.25, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10557, 75, 7.75, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10558, 47, 9.50, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10558, 51, 53.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10558, 52, 7.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10558, 53, 32.80, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10558, 73, 15.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10559, 41, 9.65, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10559, 55, 24.00, 18, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10560, 30, 25.89, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10560, 62, 49.30, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10561, 44, 19.45, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10561, 51, 53.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10562, 33, 2.50, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10562, 62, 49.30, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10563, 36, 19.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10563, 52, 7.00, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10564, 17, 39.00, 16, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10564, 31, 12.50, 6, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10564, 55, 24.00, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10565, 24, 4.50, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10565, 64, 33.25, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10566, 11, 21.00, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10566, 18, 62.50, 18, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10566, 76, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10567, 31, 12.50, 60, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10567, 51, 53.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10567, 59, 55.00, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10568, 10, 31.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10569, 31, 12.50, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10569, 76, 18.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10570, 11, 21.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10570, 56, 38.00, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10571, 14, 23.25, 11, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10571, 42, 14.00, 28, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10572, 16, 17.45, 12, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10572, 32, 32.00, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10572, 40, 18.40, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10572, 75, 7.75, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10573, 17, 39.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10573, 34, 14.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10573, 53, 32.80, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10574, 33, 2.50, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10574, 40, 18.40, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10574, 62, 49.30, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10574, 64, 33.25, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10575, 59, 55.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10575, 63, 43.90, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10575, 72, 34.80, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10575, 76, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10576, 1, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10576, 31, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10576, 44, 19.45, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10577, 39, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10577, 75, 7.75, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10577, 77, 13.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10578, 35, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10578, 57, 19.50, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10579, 15, 15.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10579, 75, 7.75, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10580, 14, 23.25, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10580, 41, 9.65, 9, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10580, 65, 21.05, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10581, 75, 7.75, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10582, 57, 19.50, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10582, 76, 18.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10583, 29, 123.79, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10583, 60, 34.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10583, 69, 36.00, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10584, 31, 12.50, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10585, 47, 9.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10586, 52, 7.00, 4, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10587, 26, 31.23, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10587, 35, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10587, 77, 13.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10588, 18, 62.50, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10588, 42, 14.00, 100, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10589, 35, 18.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10590, 1, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10590, 77, 13.00, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10591, 3, 10.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10591, 7, 30.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10591, 54, 7.45, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10592, 15, 15.50, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10592, 26, 31.23, 5, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10593, 20, 81.00, 21, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10593, 69, 36.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10593, 76, 18.00, 4, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10594, 52, 7.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10594, 58, 13.25, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10595, 35, 18.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10595, 61, 28.50, 120, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10595, 69, 36.00, 65, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10596, 56, 38.00, 5, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10596, 63, 43.90, 24, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10596, 75, 7.75, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10597, 24, 4.50, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10597, 57, 19.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10597, 65, 21.05, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10598, 27, 43.90, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10598, 71, 21.50, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10599, 62, 49.30, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10600, 54, 7.45, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10600, 73, 15.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10601, 13, 6.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10601, 59, 55.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10602, 77, 13.00, 5, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10603, 22, 21.00, 48, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10603, 49, 20.00, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10604, 48, 12.75, 6, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10604, 76, 18.00, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10605, 16, 17.45, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10605, 59, 55.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10605, 60, 34.00, 70, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10605, 71, 21.50, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10606, 4, 22.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10606, 55, 24.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10606, 62, 49.30, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10607, 7, 30.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10607, 17, 39.00, 100, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10607, 33, 2.50, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10607, 40, 18.40, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10607, 72, 34.80, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10608, 56, 38.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10609, 1, 18.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10609, 10, 31.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10609, 21, 10.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10610, 36, 19.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10611, 1, 18.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10611, 2, 19.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10611, 60, 34.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10612, 10, 31.00, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10612, 36, 19.00, 55, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10612, 49, 20.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10612, 60, 34.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10612, 76, 18.00, 80, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10613, 13, 6.00, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10613, 75, 7.75, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10614, 11, 21.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10614, 21, 10.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10614, 39, 18.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10615, 55, 24.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10616, 38, 263.50, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10616, 56, 38.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10616, 70, 15.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10616, 71, 21.50, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10617, 59, 55.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10618, 6, 25.00, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10618, 56, 38.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10618, 68, 12.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10619, 21, 10.00, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10619, 22, 21.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10620, 24, 4.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10620, 52, 7.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10621, 19, 9.20, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10621, 23, 9.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10621, 70, 15.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10621, 71, 21.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10622, 2, 19.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10622, 68, 12.50, 18, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10623, 14, 23.25, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10623, 19, 9.20, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10623, 21, 10.00, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10623, 24, 4.50, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10623, 35, 18.00, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10624, 28, 45.60, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10624, 29, 123.79, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10624, 44, 19.45, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10625, 14, 23.25, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10625, 42, 14.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10625, 60, 34.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10626, 53, 32.80, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10626, 60, 34.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10626, 71, 21.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10627, 62, 49.30, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10627, 73, 15.00, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10628, 1, 18.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10629, 29, 123.79, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10629, 64, 33.25, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10630, 55, 24.00, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10630, 76, 18.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10631, 75, 7.75, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10632, 2, 19.00, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10632, 33, 2.50, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10633, 12, 38.00, 36, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10633, 13, 6.00, 13, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10633, 26, 31.23, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10633, 62, 49.30, 80, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10634, 7, 30.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10634, 18, 62.50, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10634, 51, 53.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10634, 75, 7.75, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10635, 4, 22.00, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10635, 5, 21.35, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10635, 22, 21.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10636, 4, 22.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10636, 58, 13.25, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10637, 11, 21.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10637, 50, 16.25, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10637, 56, 38.00, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10638, 45, 9.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10638, 65, 21.05, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10638, 72, 34.80, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10639, 18, 62.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10640, 69, 36.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10640, 70, 15.00, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10641, 2, 19.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10641, 40, 18.40, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10642, 21, 10.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10642, 61, 28.50, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10643, 28, 45.60, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10643, 39, 18.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10643, 46, 12.00, 2, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10644, 18, 62.50, 4, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10644, 43, 46.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10644, 46, 12.00, 21, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10645, 18, 62.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10645, 36, 19.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10646, 1, 18.00, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10646, 10, 31.00, 18, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10646, 71, 21.50, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10646, 77, 13.00, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10647, 19, 9.20, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10647, 39, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10648, 22, 21.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10648, 24, 4.50, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10649, 28, 45.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10649, 72, 34.80, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10650, 30, 25.89, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10650, 53, 32.80, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10650, 54, 7.45, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10651, 19, 9.20, 12, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10651, 22, 21.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10652, 30, 25.89, 2, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10652, 42, 14.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10653, 16, 17.45, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10653, 60, 34.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10654, 4, 22.00, 12, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10654, 39, 18.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10654, 54, 7.45, 6, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10655, 41, 9.65, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10656, 14, 23.25, 3, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10656, 44, 19.45, 28, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10656, 47, 9.50, 6, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10657, 15, 15.50, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10657, 41, 9.65, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10657, 46, 12.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10657, 47, 9.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10657, 56, 38.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10657, 60, 34.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10658, 21, 10.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10658, 40, 18.40, 70, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10658, 60, 34.00, 55, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10658, 77, 13.00, 70, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10659, 31, 12.50, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10659, 40, 18.40, 24, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10659, 70, 15.00, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10660, 20, 81.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10661, 39, 18.00, 3, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10661, 58, 13.25, 49, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10662, 68, 12.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10663, 40, 18.40, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10663, 42, 14.00, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10663, 51, 53.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10664, 10, 31.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10664, 56, 38.00, 12, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10664, 65, 21.05, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10665, 51, 53.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10665, 59, 55.00, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10665, 76, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10666, 29, 123.79, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10666, 65, 21.05, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10667, 69, 36.00, 45, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10667, 71, 21.50, 14, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10668, 31, 12.50, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10668, 55, 24.00, 4, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10668, 64, 33.25, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10669, 36, 19.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10670, 23, 9.00, 32, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10670, 46, 12.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10670, 67, 14.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10670, 73, 15.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10670, 75, 7.75, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10671, 16, 17.45, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10671, 62, 49.30, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10671, 65, 21.05, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10672, 38, 263.50, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10672, 71, 21.50, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10673, 16, 17.45, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10673, 42, 14.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10673, 43, 46.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10674, 23, 9.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10675, 14, 23.25, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10675, 53, 32.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10675, 58, 13.25, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10676, 10, 31.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10676, 19, 9.20, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10676, 44, 19.45, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10677, 26, 31.23, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10677, 33, 2.50, 8, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10678, 12, 38.00, 100, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10678, 33, 2.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10678, 41, 9.65, 120, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10678, 54, 7.45, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10679, 59, 55.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10680, 16, 17.45, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10680, 31, 12.50, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10680, 42, 14.00, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10681, 19, 9.20, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10681, 21, 10.00, 12, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10681, 64, 33.25, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10682, 33, 2.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10682, 66, 17.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10682, 75, 7.75, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10683, 52, 7.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10684, 40, 18.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10684, 47, 9.50, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10684, 60, 34.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10685, 10, 31.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10685, 41, 9.65, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10685, 47, 9.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10686, 17, 39.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10686, 26, 31.23, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10687, 9, 97.00, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10687, 29, 123.79, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10687, 36, 19.00, 6, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10688, 10, 31.00, 18, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10688, 28, 45.60, 60, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10688, 34, 14.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10689, 1, 18.00, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10690, 56, 38.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10690, 77, 13.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10691, 1, 18.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10691, 29, 123.79, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10691, 43, 46.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10691, 44, 19.45, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10691, 62, 49.30, 48, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10692, 63, 43.90, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10693, 9, 97.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10693, 54, 7.45, 60, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10693, 69, 36.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10693, 73, 15.00, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10694, 7, 30.00, 90, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10694, 59, 55.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10694, 70, 15.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10695, 8, 40.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10695, 12, 38.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10695, 24, 4.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10696, 17, 39.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10696, 46, 12.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10697, 19, 9.20, 7, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10697, 35, 18.00, 9, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10697, 58, 13.25, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10697, 70, 15.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10698, 11, 21.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10698, 17, 39.00, 8, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10698, 29, 123.79, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10698, 65, 21.05, 65, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10698, 70, 15.00, 8, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10699, 47, 9.50, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10700, 1, 18.00, 5, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10700, 34, 14.00, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10700, 68, 12.50, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10700, 71, 21.50, 60, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10701, 59, 55.00, 42, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10701, 71, 21.50, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10701, 76, 18.00, 35, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10702, 3, 10.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10702, 76, 18.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10703, 2, 19.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10703, 59, 55.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10703, 73, 15.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10704, 4, 22.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10704, 24, 4.50, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10704, 48, 12.75, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10705, 31, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10705, 32, 32.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10706, 16, 17.45, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10706, 43, 46.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10706, 59, 55.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10707, 55, 24.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10707, 57, 19.50, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10707, 70, 15.00, 28, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10708, 5, 21.35, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10708, 36, 19.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10709, 8, 40.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10709, 51, 53.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10709, 60, 34.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10710, 19, 9.20, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10710, 47, 9.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10711, 19, 9.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10711, 41, 9.65, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10711, 53, 32.80, 120, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10712, 53, 32.80, 3, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10712, 56, 38.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10713, 10, 31.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10713, 26, 31.23, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10713, 45, 9.50, 110, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10713, 46, 12.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10714, 2, 19.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10714, 17, 39.00, 27, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10714, 47, 9.50, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10714, 56, 38.00, 18, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10714, 58, 13.25, 12, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10715, 10, 31.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10715, 71, 21.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10716, 21, 10.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10716, 51, 53.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10716, 61, 28.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10717, 21, 10.00, 32, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10717, 54, 7.45, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10717, 69, 36.00, 25, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10718, 12, 38.00, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10718, 16, 17.45, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10718, 36, 19.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10718, 62, 49.30, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10719, 18, 62.50, 12, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10719, 30, 25.89, 3, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10719, 54, 7.45, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10720, 35, 18.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10720, 71, 21.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10721, 44, 19.45, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10722, 2, 19.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10722, 31, 12.50, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10722, 68, 12.50, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10722, 75, 7.75, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10723, 26, 31.23, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10724, 10, 31.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10724, 61, 28.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10725, 41, 9.65, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10725, 52, 7.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10725, 55, 24.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10726, 4, 22.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10726, 11, 21.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10727, 17, 39.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10727, 56, 38.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10727, 59, 55.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10728, 30, 25.89, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10728, 40, 18.40, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10728, 55, 24.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10728, 60, 34.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10729, 1, 18.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10729, 21, 10.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10729, 50, 16.25, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10730, 16, 17.45, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10730, 31, 12.50, 3, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10730, 65, 21.05, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10731, 21, 10.00, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10731, 51, 53.00, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10732, 76, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10733, 14, 23.25, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10733, 28, 45.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10733, 52, 7.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10734, 6, 25.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10734, 30, 25.89, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10734, 76, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10735, 61, 28.50, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10735, 77, 13.00, 2, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10736, 65, 21.05, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10736, 75, 7.75, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10737, 13, 6.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10737, 41, 9.65, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10738, 16, 17.45, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10739, 36, 19.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10739, 52, 7.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10740, 28, 45.60, 5, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10740, 35, 18.00, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10740, 45, 9.50, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10740, 56, 38.00, 14, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10741, 2, 19.00, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10742, 3, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10742, 60, 34.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10742, 72, 34.80, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10743, 46, 12.00, 28, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10744, 40, 18.40, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10745, 18, 62.50, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10745, 44, 19.45, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10745, 59, 55.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10745, 72, 34.80, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10746, 13, 6.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10746, 42, 14.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10746, 62, 49.30, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10746, 69, 36.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10747, 31, 12.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10747, 41, 9.65, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10747, 63, 43.90, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10747, 69, 36.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10748, 23, 9.00, 44, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10748, 40, 18.40, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10748, 56, 38.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10749, 56, 38.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10749, 59, 55.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10749, 76, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10750, 14, 23.25, 5, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10750, 45, 9.50, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10750, 59, 55.00, 25, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10751, 26, 31.23, 12, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10751, 30, 25.89, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10751, 50, 16.25, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10751, 73, 15.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10752, 1, 18.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10752, 69, 36.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10753, 45, 9.50, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10753, 74, 10.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10754, 40, 18.40, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10755, 47, 9.50, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10755, 56, 38.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10755, 57, 19.50, 14, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10755, 69, 36.00, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10756, 18, 62.50, 21, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10756, 36, 19.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10756, 68, 12.50, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10756, 69, 36.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10757, 34, 14.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10757, 59, 55.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10757, 62, 49.30, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10757, 64, 33.25, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10758, 26, 31.23, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10758, 52, 7.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10758, 70, 15.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10759, 32, 32.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10760, 25, 14.00, 12, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10760, 27, 43.90, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10760, 43, 46.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10761, 25, 14.00, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10761, 75, 7.75, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10762, 39, 18.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10762, 47, 9.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10762, 51, 53.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10762, 56, 38.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10763, 21, 10.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10763, 22, 21.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10763, 24, 4.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10764, 3, 10.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10764, 39, 18.00, 130, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10765, 65, 21.05, 80, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10766, 2, 19.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10766, 7, 30.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10766, 68, 12.50, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10767, 42, 14.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10768, 22, 21.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10768, 31, 12.50, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10768, 60, 34.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10768, 71, 21.50, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10769, 41, 9.65, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10769, 52, 7.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10769, 61, 28.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10769, 62, 49.30, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10770, 11, 21.00, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10771, 71, 21.50, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10772, 29, 123.79, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10772, 59, 55.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10773, 17, 39.00, 33, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10773, 31, 12.50, 70, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10773, 75, 7.75, 7, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10774, 31, 12.50, 2, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10774, 66, 17.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10775, 10, 31.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10775, 67, 14.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10776, 31, 12.50, 16, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10776, 42, 14.00, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10776, 45, 9.50, 27, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10776, 51, 53.00, 120, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10777, 42, 14.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10778, 41, 9.65, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10779, 16, 17.45, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10779, 62, 49.30, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10780, 70, 15.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10780, 77, 13.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10781, 54, 7.45, 3, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10781, 56, 38.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10781, 74, 10.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10782, 31, 12.50, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10783, 31, 12.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10783, 38, 263.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10784, 36, 19.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10784, 39, 18.00, 2, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10784, 72, 34.80, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10785, 10, 31.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10785, 75, 7.75, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10786, 8, 40.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10786, 30, 25.89, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10786, 75, 7.75, 42, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10787, 2, 19.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10787, 29, 123.79, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10788, 19, 9.20, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10788, 75, 7.75, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10789, 18, 62.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10789, 35, 18.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10789, 63, 43.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10789, 68, 12.50, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10790, 7, 30.00, 3, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10790, 56, 38.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10791, 29, 123.79, 14, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10791, 41, 9.65, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10792, 2, 19.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10792, 54, 7.45, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10792, 68, 12.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10793, 41, 9.65, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10793, 52, 7.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10794, 14, 23.25, 15, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10794, 54, 7.45, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10795, 16, 17.45, 65, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10795, 17, 39.00, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10796, 26, 31.23, 21, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10796, 44, 19.45, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10796, 64, 33.25, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10796, 69, 36.00, 24, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10797, 11, 21.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10798, 62, 49.30, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10798, 72, 34.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10799, 13, 6.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10799, 24, 4.50, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10799, 59, 55.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10800, 11, 21.00, 50, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10800, 51, 53.00, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10800, 54, 7.45, 7, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10801, 17, 39.00, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10801, 29, 123.79, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10802, 30, 25.89, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10802, 51, 53.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10802, 55, 24.00, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10802, 62, 49.30, 5, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10803, 19, 9.20, 24, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10803, 25, 14.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10803, 59, 55.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10804, 10, 31.00, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10804, 28, 45.60, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10804, 49, 20.00, 4, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10805, 34, 14.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10805, 38, 263.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10806, 2, 19.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10806, 65, 21.05, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10806, 74, 10.00, 15, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10807, 40, 18.40, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10808, 56, 38.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10808, 76, 18.00, 50, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10809, 52, 7.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10810, 13, 6.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10810, 25, 14.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10810, 70, 15.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10811, 19, 9.20, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10811, 23, 9.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10811, 40, 18.40, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10812, 31, 12.50, 16, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10812, 72, 34.80, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10812, 77, 13.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10813, 2, 19.00, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10813, 46, 12.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10814, 41, 9.65, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10814, 43, 46.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10814, 48, 12.75, 8, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10814, 61, 28.50, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10815, 33, 2.50, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10816, 38, 263.50, 30, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10816, 62, 49.30, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10817, 26, 31.23, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10817, 38, 263.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10817, 40, 18.40, 60, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10817, 62, 49.30, 25, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10818, 32, 32.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10818, 41, 9.65, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10819, 43, 46.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10819, 75, 7.75, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10820, 56, 38.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10821, 35, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10821, 51, 53.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10822, 62, 49.30, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10822, 70, 15.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10823, 11, 21.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10823, 57, 19.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10823, 59, 55.00, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10823, 77, 13.00, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10824, 41, 9.65, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10824, 70, 15.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10825, 26, 31.23, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10825, 53, 32.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10826, 31, 12.50, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10826, 57, 19.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10827, 10, 31.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10827, 39, 18.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10828, 20, 81.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10828, 38, 263.50, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10829, 2, 19.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10829, 8, 40.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10829, 13, 6.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10829, 60, 34.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10830, 6, 25.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10830, 39, 18.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10830, 60, 34.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10830, 68, 12.50, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10831, 19, 9.20, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10831, 35, 18.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10831, 38, 263.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10831, 43, 46.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10832, 13, 6.00, 3, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10832, 25, 14.00, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10832, 44, 19.45, 16, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10832, 64, 33.25, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10833, 7, 30.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10833, 31, 12.50, 9, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10833, 53, 32.80, 9, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10834, 29, 123.79, 8, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10834, 30, 25.89, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10835, 59, 55.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10835, 77, 13.00, 2, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10836, 22, 21.00, 52, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10836, 35, 18.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10836, 57, 19.50, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10836, 60, 34.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10836, 64, 33.25, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10837, 13, 6.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10837, 40, 18.40, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10837, 47, 9.50, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10837, 76, 18.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10838, 1, 18.00, 4, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10838, 18, 62.50, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10838, 36, 19.00, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10839, 58, 13.25, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10839, 72, 34.80, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10840, 25, 14.00, 6, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10840, 39, 18.00, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10841, 10, 31.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10841, 56, 38.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10841, 59, 55.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10841, 77, 13.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10842, 11, 21.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10842, 43, 46.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10842, 68, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10842, 70, 15.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10843, 51, 53.00, 4, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10844, 22, 21.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10845, 23, 9.00, 70, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10845, 35, 18.00, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10845, 42, 14.00, 42, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10845, 58, 13.25, 60, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10845, 64, 33.25, 48, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10846, 4, 22.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10846, 70, 15.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10846, 74, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10847, 1, 18.00, 80, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10847, 19, 9.20, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10847, 37, 26.00, 60, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10847, 45, 9.50, 36, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10847, 60, 34.00, 45, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10847, 71, 21.50, 55, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10848, 5, 21.35, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10848, 9, 97.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10849, 3, 10.00, 49, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10849, 26, 31.23, 18, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10850, 25, 14.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10850, 33, 2.50, 4, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10850, 70, 15.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10851, 2, 19.00, 5, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10851, 25, 14.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10851, 57, 19.50, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10851, 59, 55.00, 42, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10852, 2, 19.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10852, 17, 39.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10852, 62, 49.30, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10853, 18, 62.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10854, 10, 31.00, 100, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10854, 13, 6.00, 65, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10855, 16, 17.45, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10855, 31, 12.50, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10855, 56, 38.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10855, 65, 21.05, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10856, 2, 19.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10856, 42, 14.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10857, 3, 10.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10857, 26, 31.23, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10857, 29, 123.79, 10, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10858, 7, 30.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10858, 27, 43.90, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10858, 70, 15.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10859, 24, 4.50, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10859, 54, 7.45, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10859, 64, 33.25, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10860, 51, 53.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10860, 76, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10861, 17, 39.00, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10861, 18, 62.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10861, 21, 10.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10861, 33, 2.50, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10861, 62, 49.30, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10862, 11, 21.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10862, 52, 7.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10863, 1, 18.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10863, 58, 13.25, 12, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10864, 35, 18.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10864, 67, 14.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10865, 38, 263.50, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10865, 39, 18.00, 80, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10866, 2, 19.00, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10866, 24, 4.50, 6, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10866, 30, 25.89, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10867, 53, 32.80, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10868, 26, 31.23, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10868, 35, 18.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10868, 49, 20.00, 42, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10869, 1, 18.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10869, 11, 21.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10869, 23, 9.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10869, 68, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10870, 35, 18.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10870, 51, 53.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10871, 6, 25.00, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10871, 16, 17.45, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10871, 17, 39.00, 16, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10872, 55, 24.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10872, 62, 49.30, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10872, 64, 33.25, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10872, 65, 21.05, 21, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10873, 21, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10873, 28, 45.60, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10874, 10, 31.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10875, 19, 9.20, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10875, 47, 9.50, 21, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10875, 49, 20.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10876, 46, 12.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10876, 64, 33.25, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10877, 16, 17.45, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10877, 18, 62.50, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10878, 20, 81.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10879, 40, 18.40, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10879, 65, 21.05, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10879, 76, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10880, 23, 9.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10880, 61, 28.50, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10880, 70, 15.00, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10881, 73, 15.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10882, 42, 14.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10882, 49, 20.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10882, 54, 7.45, 32, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10883, 24, 4.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10884, 21, 10.00, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10884, 56, 38.00, 21, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10884, 65, 21.05, 12, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10885, 2, 19.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10885, 24, 4.50, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10885, 70, 15.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10885, 77, 13.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10886, 10, 31.00, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10886, 31, 12.50, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10886, 77, 13.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10887, 25, 14.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10888, 2, 19.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10888, 68, 12.50, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10889, 11, 21.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10889, 38, 263.50, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10890, 17, 39.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10890, 34, 14.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10890, 41, 9.65, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10891, 30, 25.89, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10892, 59, 55.00, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10893, 8, 40.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10893, 24, 4.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10893, 29, 123.79, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10893, 30, 25.89, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10893, 36, 19.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10894, 13, 6.00, 28, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10894, 69, 36.00, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10894, 75, 7.75, 120, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10895, 24, 4.50, 110, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10895, 39, 18.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10895, 40, 18.40, 91, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10895, 60, 34.00, 100, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10896, 45, 9.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10896, 56, 38.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10897, 29, 123.79, 80, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10897, 30, 25.89, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10898, 13, 6.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10899, 39, 18.00, 8, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10900, 70, 15.00, 3, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10901, 41, 9.65, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10901, 71, 21.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10902, 55, 24.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10902, 62, 49.30, 6, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10903, 13, 6.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10903, 65, 21.05, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10903, 68, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10904, 58, 13.25, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10904, 62, 49.30, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10905, 1, 18.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10906, 61, 28.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10907, 75, 7.75, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10908, 7, 30.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10908, 52, 7.00, 14, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10909, 7, 30.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10909, 16, 17.45, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10909, 41, 9.65, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10910, 19, 9.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10910, 49, 20.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10910, 61, 28.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10911, 1, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10911, 17, 39.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10911, 67, 14.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10912, 11, 21.00, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10912, 29, 123.79, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10913, 4, 22.00, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10913, 33, 2.50, 40, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10913, 58, 13.25, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10914, 71, 21.50, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10915, 17, 39.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10915, 33, 2.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10915, 54, 7.45, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10916, 16, 17.45, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10916, 32, 32.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10916, 57, 19.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10917, 30, 25.89, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10917, 60, 34.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10918, 1, 18.00, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10918, 60, 34.00, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10919, 16, 17.45, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10919, 25, 14.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10919, 40, 18.40, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10920, 50, 16.25, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10921, 35, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10921, 63, 43.90, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10922, 17, 39.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10922, 24, 4.50, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10923, 42, 14.00, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10923, 43, 46.00, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10923, 67, 14.00, 24, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10924, 10, 31.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10924, 28, 45.60, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10924, 75, 7.75, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10925, 36, 19.00, 25, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10925, 52, 7.00, 12, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10926, 11, 21.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10926, 13, 6.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10926, 19, 9.20, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10926, 72, 34.80, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10927, 20, 81.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10927, 52, 7.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10927, 76, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10928, 47, 9.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10928, 76, 18.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10929, 21, 10.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10929, 75, 7.75, 49, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10929, 77, 13.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10930, 21, 10.00, 36, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10930, 27, 43.90, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10930, 55, 24.00, 25, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10930, 58, 13.25, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10931, 13, 6.00, 42, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10931, 57, 19.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10932, 16, 17.45, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10932, 62, 49.30, 14, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10932, 72, 34.80, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10932, 75, 7.75, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10933, 53, 32.80, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10933, 61, 28.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10934, 6, 25.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10935, 1, 18.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10935, 18, 62.50, 4, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10935, 23, 9.00, 8, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10936, 36, 19.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10937, 28, 45.60, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10937, 34, 14.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10938, 13, 6.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10938, 43, 46.00, 24, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10938, 60, 34.00, 49, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10938, 71, 21.50, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10939, 2, 19.00, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10939, 67, 14.00, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10940, 7, 30.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10940, 13, 6.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10941, 31, 12.50, 44, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10941, 62, 49.30, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10941, 68, 12.50, 80, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10941, 72, 34.80, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10942, 49, 20.00, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10943, 13, 6.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10943, 22, 21.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10943, 46, 12.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10944, 11, 21.00, 5, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10944, 44, 19.45, 18, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10944, 56, 38.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10945, 13, 6.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10945, 31, 12.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10946, 10, 31.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10946, 24, 4.50, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10946, 77, 13.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10947, 59, 55.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10948, 50, 16.25, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10948, 51, 53.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10948, 55, 24.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10949, 6, 25.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10949, 10, 31.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10949, 17, 39.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10949, 62, 49.30, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10950, 4, 22.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10951, 33, 2.50, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10951, 41, 9.65, 6, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10951, 75, 7.75, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10952, 6, 25.00, 16, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10952, 28, 45.60, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10953, 20, 81.00, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10953, 31, 12.50, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10954, 16, 17.45, 28, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10954, 31, 12.50, 25, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10954, 45, 9.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10954, 60, 34.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10955, 75, 7.75, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10956, 21, 10.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10956, 47, 9.50, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10956, 51, 53.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10957, 30, 25.89, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10957, 35, 18.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10957, 64, 33.25, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10958, 5, 21.35, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10958, 7, 30.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10958, 72, 34.80, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10959, 75, 7.75, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10960, 24, 4.50, 10, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10960, 41, 9.65, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10961, 52, 7.00, 6, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10961, 76, 18.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10962, 7, 30.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10962, 13, 6.00, 77, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10962, 53, 32.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10962, 69, 36.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10962, 76, 18.00, 44, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10963, 60, 34.00, 2, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10964, 18, 62.50, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10964, 38, 263.50, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10964, 69, 36.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10965, 51, 53.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10966, 37, 26.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10966, 56, 38.00, 12, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10966, 62, 49.30, 12, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10967, 19, 9.20, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10967, 49, 20.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10968, 12, 38.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10968, 24, 4.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10968, 64, 33.25, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10969, 46, 12.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10970, 52, 7.00, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10971, 29, 123.79, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10972, 17, 39.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10972, 33, 2.50, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10973, 26, 31.23, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10973, 41, 9.65, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10973, 75, 7.75, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10974, 63, 43.90, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10975, 8, 40.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10975, 75, 7.75, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10976, 28, 45.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10977, 39, 18.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10977, 47, 9.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10977, 51, 53.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10977, 63, 43.90, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10978, 8, 40.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10978, 21, 10.00, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10978, 40, 18.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10978, 44, 19.45, 6, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10979, 7, 30.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10979, 12, 38.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10979, 24, 4.50, 80, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10979, 27, 43.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10979, 31, 12.50, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10979, 63, 43.90, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10980, 75, 7.75, 40, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10981, 38, 263.50, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10982, 7, 30.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10982, 43, 46.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10983, 13, 6.00, 84, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10983, 57, 19.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10984, 16, 17.45, 55, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10984, 24, 4.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10984, 36, 19.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10985, 16, 17.45, 36, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10985, 18, 62.50, 8, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10985, 32, 32.00, 35, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10986, 11, 21.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10986, 20, 81.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10986, 76, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10986, 77, 13.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10987, 7, 30.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10987, 43, 46.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10987, 72, 34.80, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10988, 7, 30.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10988, 62, 49.30, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10989, 6, 25.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10989, 11, 21.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10989, 41, 9.65, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10990, 21, 10.00, 65, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10990, 34, 14.00, 60, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10990, 55, 24.00, 65, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10990, 61, 28.50, 66, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10991, 2, 19.00, 50, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10991, 70, 15.00, 20, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10991, 76, 18.00, 90, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10992, 72, 34.80, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10993, 29, 123.79, 50, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10993, 41, 9.65, 35, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10994, 59, 55.00, 18, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10995, 51, 53.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10995, 60, 34.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10996, 42, 14.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10997, 32, 32.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10997, 46, 12.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10997, 52, 7.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10998, 24, 4.50, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10998, 61, 28.50, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10998, 74, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10998, 75, 7.75, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10999, 41, 9.65, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10999, 51, 53.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(10999, 77, 13.00, 21, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11000, 4, 22.00, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11000, 24, 4.50, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11000, 77, 13.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11001, 7, 30.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11001, 22, 21.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11001, 46, 12.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11001, 55, 24.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11002, 13, 6.00, 56, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11002, 35, 18.00, 15, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11002, 42, 14.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11002, 55, 24.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11003, 1, 18.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11003, 40, 18.40, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11003, 52, 7.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11004, 26, 31.23, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11004, 76, 18.00, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11005, 1, 18.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11005, 59, 55.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11006, 1, 18.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11006, 29, 123.79, 2, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11007, 8, 40.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11007, 29, 123.79, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11007, 42, 14.00, 14, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11008, 28, 45.60, 70, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11008, 34, 14.00, 90, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11008, 71, 21.50, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11009, 24, 4.50, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11009, 36, 19.00, 18, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11009, 60, 34.00, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11010, 7, 30.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11010, 24, 4.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11011, 58, 13.25, 40, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11011, 71, 21.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11012, 19, 9.20, 50, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11012, 60, 34.00, 36, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11012, 71, 21.50, 60, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11013, 23, 9.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11013, 42, 14.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11013, 45, 9.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11013, 68, 12.50, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11014, 41, 9.65, 28, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11015, 30, 25.89, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11015, 77, 13.00, 18, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11016, 31, 12.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11016, 36, 19.00, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11017, 3, 10.00, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11017, 59, 55.00, 110, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11017, 70, 15.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11018, 12, 38.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11018, 18, 62.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11018, 56, 38.00, 5, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11019, 46, 12.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11019, 49, 20.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11020, 10, 31.00, 24, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11021, 2, 19.00, 11, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11021, 20, 81.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11021, 26, 31.23, 63, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11021, 51, 53.00, 44, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11021, 72, 34.80, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11022, 19, 9.20, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11022, 69, 36.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11023, 7, 30.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11023, 43, 46.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11024, 26, 31.23, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11024, 33, 2.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11024, 65, 21.05, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11024, 71, 21.50, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11025, 1, 18.00, 10, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11025, 13, 6.00, 20, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11026, 18, 62.50, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11026, 51, 53.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11027, 24, 4.50, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11027, 62, 49.30, 21, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11028, 55, 24.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11028, 59, 55.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11029, 56, 38.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11029, 63, 43.90, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11030, 2, 19.00, 100, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11030, 5, 21.35, 70, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11030, 29, 123.79, 60, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11030, 59, 55.00, 100, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11031, 1, 18.00, 45, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11031, 13, 6.00, 80, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11031, 24, 4.50, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11031, 64, 33.25, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11031, 71, 21.50, 16, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11032, 36, 19.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11032, 38, 263.50, 25, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11032, 59, 55.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11033, 53, 32.80, 70, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11033, 69, 36.00, 36, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11034, 21, 10.00, 15, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11034, 44, 19.45, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11034, 61, 28.50, 6, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11035, 1, 18.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11035, 35, 18.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11035, 42, 14.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11035, 54, 7.45, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11036, 13, 6.00, 7, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11036, 59, 55.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11037, 70, 15.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11038, 40, 18.40, 5, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11038, 52, 7.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11038, 71, 21.50, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11039, 28, 45.60, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11039, 35, 18.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11039, 49, 20.00, 60, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11039, 57, 19.50, 28, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11040, 21, 10.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11041, 2, 19.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11041, 63, 43.90, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11042, 44, 19.45, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11042, 61, 28.50, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11043, 11, 21.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11044, 62, 49.30, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11045, 33, 2.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11045, 51, 53.00, 24, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11046, 12, 38.00, 20, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11046, 32, 32.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11046, 35, 18.00, 18, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11047, 1, 18.00, 25, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11047, 5, 21.35, 30, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11048, 68, 12.50, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11049, 2, 19.00, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11049, 12, 38.00, 4, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11050, 76, 18.00, 50, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11051, 24, 4.50, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11052, 43, 46.00, 30, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11052, 61, 28.50, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11053, 18, 62.50, 35, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11053, 32, 32.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11053, 64, 33.25, 25, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11054, 33, 2.50, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11054, 67, 14.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11055, 24, 4.50, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11055, 25, 14.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11055, 51, 53.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11055, 57, 19.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11056, 7, 30.00, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11056, 55, 24.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11056, 60, 34.00, 50, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11057, 70, 15.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11058, 21, 10.00, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11058, 60, 34.00, 21, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11058, 61, 28.50, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11059, 13, 6.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11059, 17, 39.00, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11059, 60, 34.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11060, 60, 34.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11060, 77, 13.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11061, 60, 34.00, 15, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11062, 53, 32.80, 10, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11062, 70, 15.00, 12, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11063, 34, 14.00, 30, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11063, 40, 18.40, 40, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11063, 41, 9.65, 30, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11064, 17, 39.00, 77, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11064, 41, 9.65, 12, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11064, 53, 32.80, 25, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11064, 55, 24.00, 4, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11064, 68, 12.50, 55, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11065, 30, 25.89, 4, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11065, 54, 7.45, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11066, 16, 17.45, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11066, 19, 9.20, 42, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11066, 34, 14.00, 35, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11067, 41, 9.65, 9, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11068, 28, 45.60, 8, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11068, 43, 46.00, 36, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11068, 77, 13.00, 28, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11069, 39, 18.00, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11070, 1, 18.00, 40, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11070, 2, 19.00, 20, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11070, 16, 17.45, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11070, 31, 12.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11071, 7, 30.00, 15, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11071, 13, 6.00, 10, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11072, 2, 19.00, 8, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11072, 41, 9.65, 40, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11072, 50, 16.25, 22, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11072, 64, 33.25, 130, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11073, 11, 21.00, 10, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11073, 24, 4.50, 20, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11074, 16, 17.45, 14, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11075, 2, 19.00, 10, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11075, 46, 12.00, 30, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11075, 76, 18.00, 2, 0.15);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11076, 6, 25.00, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11076, 14, 23.25, 20, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11076, 19, 9.20, 10, 0.25);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 2, 19.00, 24, 0.2);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 3, 10.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 4, 22.00, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 6, 25.00, 1, 0.02);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 7, 30.00, 1, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 8, 40.00, 2, 0.1);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 10, 31.00, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 12, 38.00, 2, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 13, 6.00, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 14, 23.25, 1, 0.03);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 16, 17.45, 2, 0.03);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 20, 81.00, 1, 0.04);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 23, 9.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 32, 32.00, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 39, 18.00, 2, 0.05);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 41, 9.65, 3, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 46, 12.00, 3, 0.02);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 52, 7.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 55, 24.00, 2, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 60, 34.00, 2, 0.06);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 64, 33.25, 2, 0.03);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 66, 17.00, 1, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 73, 15.00, 2, 0.01);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 75, 7.75, 4, 0);
INSERT INTO OrderDetails(orderid, productid, unitprice, qty, discount)
  VALUES(11077, 77, 13.00, 2, 0);

 * mysql://stu2100013117:***@162.105.146.37:43306
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### 基于平台上的订单数据库，生成一个描述customer的JSON对象

In [43]:
%%sql
SELECT JSON_OBJECT(
  'customerId', Customers.custid,
  'customerName', Customers.contactname,
  'addr', JSON_OBJECT(
            'country', Customers.country,
            'city', Customers.city
          ),
  'products', (
    SELECT JSON_ARRAYAGG(
      JSON_OBJECT(
        'productName', productname,
        'totalMoney', totalMoney
      )
    )
    FROM (
      SELECT Products.productname as productname, SUM(OrderDetails.unitprice * OrderDetails.qty * (1 - OrderDetails.discount)) as totalMoney
      FROM OrderDetails
      JOIN Products ON OrderDetails.productid = Products.productid
      WHERE OrderDetails.orderid IN (
        SELECT Orders.orderid
        FROM Orders
        WHERE Orders.custid = Customers.custid
      )
      GROUP BY productname
      ORDER BY totalMoney DESC
      LIMIT 5
    ) AS MostExpensiveProducts
  )
)
FROM Customers;

 * mysql://stu2100013117:***@162.105.146.37:43306
91 rows affected.

[('{"addr": {"city": "Berli", "country": "Germany"}, "products": [{"totalMoney": 878.000000000, "productName": "Product ICKNK"}, {"totalMoney": 825.0000 ... (131 characters truncated) ... , "productName": "Product ACRVI"}, {"totalMoney": 430.000000000, "productName": "Product MYMOI"}], "customerId": 1, "customerName": "Allen, Michael"}',),
 ('{"addr": {"city": "México D.F.", "country": "Mexico"}, "products": [{"totalMoney": 348.000000000, "productName": "Product GEEOO"}, {"totalMoney": 340 ... (133 characters truncated) ... 00, "productName": "Product RJVNM"}, {"totalMoney": 69.750000000, "productName": "Product PWCJB"}], "customerId": 2, "customerName": "Hassall, Mark"}',),
 ('{"addr": {"city": "México D.F.", "country": "Mexico"}, "products": [{"totalMoney": 1348.200000000, "productName": "Product QMVU"}, {"totalMoney": 820 ... (134 characters truncated) ... 00, "productName": "Product UKXRI"}, {"totalMoney": 702.000000000, "productName": "Product BLCAX"}], "customerId": 3, "customerName": "Peoples, Joh"}',),
 ('{"addr": {"city": "Londo", "country": "UK"}, "products": [{"totalMoney": 3847.500000000, "productName": "Product QHFFP"}, {"totalMoney": 1406.2500000 ... (129 characters truncated) ... 0, "productName": "Product APITJ"}, {"totalMoney": 627.000000000, "productName": "Product TOONT"}], "customerId": 4, "customerName": "Arndt, Torste"}',),
 ('{"addr": {"city": "Luleå", "country": "Swede"}, "products": [{"totalMoney": 3557.250000000, "productName": "Product QDOMO"}, {"totalMoney": 2760.0000 ... (137 characters truncated) ... roductName": "Product QHFFP"}, {"totalMoney": 1380.000000000, "productName": "Product YZIXQ"}], "customerId": 5, "customerName": "Higginbotham, Tom"}',),
 ('{"addr": {"city": "Mannheim", "country": "Germany"}, "products": [{"totalMoney": 714.000000000, "productName": "Product WHBYK"}, {"totalMoney": 625.0 ... (133 characters truncated) ... 0, "productName": "Product QMVU"}, {"totalMoney": 252.000000000, "productName": "Product JYGFE"}], "customerId": 6, "customerName": "Poland, Carole"}',),
 ('{"addr": {"city": "Strasbourg", "country": "France"}, "products": [{"totalMoney": 3465.000000000, "productName": "Product VJXY"}, {"totalMoney": 2108 ... (141 characters truncated) ... productName": "Product VKCMF"}, {"totalMoney": 1092.000000000, "productName": "Product OFBNT"}], "customerId": 7, "customerName": "Bansal, Dushyant"}',),
 ('{"addr": {"city": "Madrid", "country": "Spai"}, "products": [{"totalMoney": 1856.850000000, "productName": "Product VJXY"}, {"totalMoney": 1170.00000 ... (129 characters truncated) ... 0, "productName": "Product BWRLG"}, {"totalMoney": 249.600000000, "productName": "Product OVLQI"}], "customerId": 8, "customerName": "Ilyina, Julia"}',),
 ('{"addr": {"city": "Marseille", "country": "France"}, "products": [{"totalMoney": 2450.000000000, "productName": "Product CKEDC"}, {"totalMoney": 1855 ... (142 characters truncated) ... roductName": "Product HMLNI"}, {"totalMoney": 1398.400000000, "productName": "Product ZZZHR"}], "customerId": 9, "customerName": "Raghav, Amritansh"}',),
 ('{"addr": {"city": "Tsawasse", "country": "Canada"}, "products": [{"totalMoney": 4522.475000000, "productName": "Product WUXYK"}, {"totalMoney": 2337. ... (146 characters truncated) ... tName": "Product YHXGE"}, {"totalMoney": 1272.000000000, "productName": "Product APITJ"}], "customerId": 10, "customerName": "Bassols, Pilar Colome"}',),
 ('{"addr": {"city": "Londo", "country": "UK"}, "products": [{"totalMoney": 1380.000000000, "productName": "Product ZZZHR"}, {"totalMoney": 840.00000000 ... (126 characters truncated) ... 0, "productName": "Product WUXYK"}, {"totalMoney": 441.000000000, "productName": "Product CPHFY"}], "customerId": 11, "customerName": "Jaffe, David"}',),
 ('{"addr": {"city": "Buenos Aires", "country": "Argentina"}, "products": [{"totalMoney": 364.800000000, "productName": "Product OFBNT"}, {"totalMoney": ... (136 characters truncated) ... 0000, "productName": "Product SWNJY"}, {"totalMoney": 155.000000000, "productName": "Product BWRLG"}], "customerId": 12, "customerName": "Ray, Mike"}',),
 ('{"addr": {"city": "México D.F.", "country": "Mexico"}, "products": [{"totalMoney": 80.000000000, "productName": "Product VJZZH"}, {"totalMoney": 20.800000000, "productName": "Product EVFFA"}], "customerId": 13, "customerName": "Benito, Almudena"}',),
 ('{"addr": {"city": "Ber", "country": "Switzerland"}, "products": [{"totalMoney": 2667.600000000, "productName": "Product VKCMF"}, {"totalMoney": 1843. ... (138 characters truncated) ...  "productName": "Product COAXA"}, {"totalMoney": 946.560000000, "productName": "Product WUXYK"}], "customerId": 14, "customerName": "Jelitto, Jacek"}',),
 ('{"addr": {"city": "Sao Paulo", "country": "Brazil"}, "products": [{"totalMoney": 1485.000000000, "productName": "Product VJXY"}, {"totalMoney": 912.0 ... (136 characters truncated) ... "productName": "Product VJIEO"}, {"totalMoney": 240.000000000, "productName": "Product FPYP"}], "customerId": 15, "customerName": "Richardson, Shaw"}',),
 ('{"addr": {"city": "Londo", "country": "UK"}, "products": [{"totalMoney": 640.500000000, "productName": "Product EPEIM"}, {"totalMoney": 291.000000000 ... (125 characters truncated) ... 0, "productName": "Product CPHFY"}, {"totalMoney": 152.000000000, "productName": "Product RECZE"}], "customerId": 16, "customerName": "Birkby, Dana"}',),
 ('{"addr": {"city": "Aache", "country": "Germany"}, "products": [{"totalMoney": 1650.000000000, "productName": "Product UKXRI"}, {"totalMoney": 656.000 ... (131 characters truncated) ... , "productName": "Product HLGZA"}, {"totalMoney": 200.000000000, "productName": "Product XWOXC"}], "customerId": 17, "customerName": "Jones, TiAnna"}',),
 ('{"addr": {"city": "Nantes", "country": "France"}, "products": [{"totalMoney": 585.000000000, "productName": "Product BLCAX"}, {"totalMoney": 310.0000 ... (131 characters truncated) ... , "productName": "Product SWNJY"}, {"totalMoney": 135.100000000, "productName": "Product TTEEX"}], "customerId": 18, "customerName": "Rizaldy, Arif"}',),
 ('{"addr": {"city": "Londo", "country": "UK"}, "products": [{"totalMoney": 3000.000000000, "productName": "Product HMLNI"}, {"totalMoney": 2079.0000000 ... (132 characters truncated) ... productName": "Product MYMOI"}, {"totalMoney": 864.000000000, "productName": "Product COAXA"}], "customerId": 19, "customerName": "Boseman, Randall"}',),
 ('{"addr": {"city": "Graz", "country": "Austria"}, "products": [{"totalMoney": 8514.000000000, "productName": "Product UKXRI"}, {"totalMoney": 6290.900 ... (131 characters truncated) ... 000, "productName": "Product WHBYK"}, {"totalMoney": 5054.280000000, "productName": "Product OFBNT"}], "customerId": 20, "customerName": "Kane, Joh"}',),
 ('{"addr": {"city": "Sao Paulo", "country": "Brazil"}, "products": [{"totalMoney": 779.000000000, "productName": "Product BKGEA"}, {"totalMoney": 776.7 ... (136 characters truncated) ... "productName": "Product WHBYK"}, {"totalMoney": 341.620000000, "productName": "Product BWRLG"}], "customerId": 21, "customerName": "Russo, Giuseppe"}',),
 ('{"addr": {"city": "Madrid", "country": "Spai"}, "products": null, "customerId": 22, "customerName": "Bueno, Janaina Burdan, Neville"}',),
 ('{"addr": {"city": "Lille", "country": "France"}, "products": [{"totalMoney": 5000.000000000, "productName": "Product CKEDC"}, {"totalMoney": 1379.000 ... (133 characters truncated) ... 0, "productName": "Product HMLNI"}, {"totalMoney": 795.000000000, "productName": "Product APITJ"}], "customerId": 23, "customerName": "Khanna, Kara"}',),
 ('{"addr": {"city": "Bräcke", "country": "Swede"}, "products": [{"totalMoney": 4664.000000000, "productName": "Product APITJ"}, {"totalMoney": 4642.125 ... (139 characters truncated) ... ductName": "Product UKXRI"}, {"totalMoney": 1800.000000000, "productName": "Product HMLNI"}], "customerId": 24, "customerName": "San Juan, Patricia"}',),
 ('{"addr": {"city": "Münche", "country": "Germany"}, "products": [{"totalMoney": 3938.000000000, "productName": "Product UKXRI"}, {"totalMoney": 2257.5 ... (136 characters truncated) ... , "productName": "Product VJXY"}, {"totalMoney": 1278.800000000, "productName": "Product GEEOO"}], "customerId": 25, "customerName": "Carlson, Jaso"}',),
 ('{"addr": {"city": "Nantes", "country": "France"}, "products": [{"totalMoney": 1733.060000000, "productName": "Product VJXY"}, {"totalMoney": 493.0000 ... (128 characters truncated) ... 000, "productName": "Product XYWBZ"}, {"totalMoney": 174.500000000, "productName": "Product PAFRH"}], "customerId": 26, "customerName": "Koch, Paul"}',),
 ('{"addr": {"city": "Torino", "country": "Italy"}, "products": [{"totalMoney": 530.000000000, "productName": "Product APITJ"}, {"totalMoney": 500.00000 ... (133 characters truncated) ... productName": "Product LUNZZ"}, {"totalMoney": 50.000000000, "productName": "Product BKAZJ"}], "customerId": 27, "customerName": "Schmöllerl, Marti"}',),
 ('{"addr": {"city": "Lisboa", "country": "Portugal"}, "products": [{"totalMoney": 1117.200000000, "productName": "Product VKCMF"}, {"totalMoney": 975.6 ... (140 characters truncated) ... ductName": "Product YHXGE"}, {"totalMoney": 601.800000000, "productName": "Product WHBYK"}], "customerId": 28, "customerName": "Cavaglieri, Giorgio"}',),
 ('{"addr": {"city": "Barcelona", "country": "Spai"}, "products": [{"totalMoney": 186.200000000, "productName": "Product HCQDE"}, {"totalMoney": 155.000 ... (138 characters truncated) ... uctName": "Product JYGFE"}, {"totalMoney": 84.000000000, "productName": "Product XYWBZ"}], "customerId": 29, "customerName": "Kolesnikova, Katerina"}',),
 ('{"addr": {"city": "Sevilla", "country": "Spai"}, "products": [{"totalMoney": 2475.800000000, "productName": "Product VJXY"}, {"totalMoney": 2120.0000 ... (137 characters truncated) ... ductName": "Product XYWBZ"}, {"totalMoney": 773.062500000, "productName": "Product HCQDE"}], "customerId": 30, "customerName": "Shabalin, Rostislav"}',),
 ('{"addr": {"city": "Campinas", "country": "Brazil"}, "products": [{"totalMoney": 1600.000000000, "productName": "Product WVJFP"}, {"totalMoney": 1484. ... (138 characters truncated) ... productName": "Product VAIIV"}, {"totalMoney": 646.000000000, "productName": "Product VKCMF"}], "customerId": 31, "customerName": "Cheng, Yao-Qiang"}',),
 ('{"addr": {"city": "Eugene", "country": "USA"}, "products": [{"totalMoney": 11264.625000000, "productName": "Product QDOMO"}, {"totalMoney": 1402.5000 ... (133 characters truncated) ... "productName": "Product HCQDE"}, {"totalMoney": 532.000000000, "productName": "Product VKCMF"}], "customerId": 32, "customerName": "Krishnan, Venky"}',),
 ('{"addr": {"city": "Caracas", "country": "Venezuela"}, "products": [{"totalMoney": 990.000000000, "productName": "Product VJXY"}, {"totalMoney": 310.0 ... (77 characters truncated) ... ductName": "Product GEEOO"}, {"totalMoney": 77.500000000, "productName": "Product BWRLG"}], "customerId": 33, "customerName": "Sigurdarson, Hallur "}',),
 ('{"addr": {"city": "Rio de Janeiro", "country": "Brazil"}, "products": [{"totalMoney": 18076.100000000, "productName": "Product QDOMO"}, {"totalMoney" ... (142 characters truncated) ... 00, "productName": "Product APITJ"}, {"totalMoney": 1250.000000000, "productName": "Product CKEDC"}], "customerId": 34, "customerName": "Cohen, Shy"}',),
 ('{"addr": {"city": "San Cristóbal", "country": "Venezuela"}, "products": [{"totalMoney": 4565.000000000, "productName": "Product UKXRI"}, {"totalMoney ... (146 characters truncated) ...  "productName": "Product COAXA"}, {"totalMoney": 1197.000000000, "productName": "Product HCQDE"}], "customerId": 35, "customerName": "Langohr, Kris"}',),
 ('{"addr": {"city": "Elgi", "country": "USA"}, "products": [{"totalMoney": 1701.000000000, "productName": "Product QHFFP"}, {"totalMoney": 450.00000000 ... (126 characters truncated) ... 0, "productName": "Product PWCJB"}, {"totalMoney": 88.800000000, "productName": "Product QAQRL"}], "customerId": 36, "customerName": "Smith, Denise"}',),
 ('{"addr": {"city": "Cork", "country": "Ireland"}, "products": [{"totalMoney": 16711.650000000, "productName": "Product VJXY"}, {"totalMoney": 4713.500 ... (140 characters truncated) ... ductName": "Product CKEDC"}, {"totalMoney": 1787.160000000, "productName": "Product APITJ"}], "customerId": 37, "customerName": "Crăciun, Ovidiu V."}',),
 ('{"addr": {"city": "Cowes", "country": "UK"}, "products": [{"totalMoney": 855.000000000, "productName": "Product XYZPE"}, {"totalMoney": 800.000000000 ... (123 characters truncated) ... 000, "productName": "Product TOONT"}, {"totalMoney": 570.000000000, "productName": "Product VKCMF"}], "customerId": 38, "customerName": "Lee, Frank"}',),
 ('{"addr": {"city": "Brandenburg", "country": "Germany"}, "products": [{"totalMoney": 7905.000000000, "productName": "Product QDOMO"}, {"totalMoney": 4 ... (138 characters truncated) ... 00, "productName": "Product WUXYK"}, {"totalMoney": 1539.639000000, "productName": "Product HLGZA"}], "customerId": 39, "customerName": "Song, Lola"}',),
 ('{"addr": {"city": "Versailles", "country": "France"}, "products": [{"totalMoney": 439.000000000, "productName": "Product SMIOH"}, {"totalMoney": 405. ... (139 characters truncated) ... roductName": "Product BLCAX"}, {"totalMoney": 156.150000000, "productName": "Product HLGZA"}], "customerId": 40, "customerName": "De Oliveira, Jose"}',),
 ('{"addr": {"city": "Toulouse", "country": "France"}, "products": [{"totalMoney": 2352.010000000, "productName": "Product VJXY"}, {"totalMoney": 1576.0 ... (132 characters truncated) ... 00, "productName": "Product GMKIJ"}, {"totalMoney": 417.600000000, "productName": "Product JYGFE"}], "customerId": 41, "customerName": "Litton, Tim"}',),
 ('{"addr": {"city": "Vancouver", "country": "Canada"}, "products": [{"totalMoney": 154.000000000, "productName": "Product TTEEX"}, {"totalMoney": 75.00 ... (133 characters truncated) ... "productName": "Product LYLNI"}, {"totalMoney": 52.000000000, "productName": "Product LUNZZ"}], "customerId": 42, "customerName": "Steiner, Dominik"}',),
 ('{"addr": {"city": "Walla Walla", "country": "USA"}, "products": [{"totalMoney": 210.000000000, "productName": "Product QMVU"}, {"totalMoney": 147.000000000, "productName": "Product YZIXQ"}], "customerId": 43, "customerName": "Deshpande, Anu"}',),
 ('{"addr": {"city": "Frankfurt a.M.", "country": "Germany"}, "products": [{"totalMoney": 2327.500000000, "productName": "Product HCQDE"}, {"totalMoney" ... (148 characters truncated) ... oductName": "Product QHFFP"}, {"totalMoney": 1300.500000000, "productName": "Product WHBYK"}], "customerId": 44, "customerName": "Louverdis, George"}',),
 ('{"addr": {"city": "San Francisco", "country": "USA"}, "products": [{"totalMoney": 758.100000000, "productName": "Product VKCMF"}, {"totalMoney": 562. ... (144 characters truncated) ... tName": "Product VJZZH"}, {"totalMoney": 239.970000000, "productName": "Product XYWBZ"}], "customerId": 45, "customerName": "Sunkammurali,  Krishna"}',),
 ('{"addr": {"city": "Barquisimeto", "country": "Venezuela"}, "products": [{"totalMoney": 1980.000000000, "productName": "Product UKXRI"}, {"totalMoney" ... (148 characters truncated) ... roductName": "Product WHBYK"}, {"totalMoney": 969.000000000, "productName": "Product OSFNS"}], "customerId": 46, "customerName": "Dressler, Marlies"}',),
 ('{"addr": {"city": "I. de Margarita", "country": "Venezuela"}, "products": [{"totalMoney": 2088.000000000, "productName": "Product GEEOO"}, {"totalMon ... (144 characters truncated) ... 0, "productName": "Product TOONT"}, {"totalMoney": 954.000000000, "productName": "Product HHYDP"}], "customerId": 47, "customerName": "Lupu, Cornel"}',),
 ('{"addr": {"city": "Portland", "country": "USA"}, "products": [{"totalMoney": 1060.000000000, "productName": "Product APITJ"}, {"totalMoney": 760.0000 ... (136 characters truncated) ... oductName": "Product WUXYK"}, {"totalMoney": 319.200000000, "productName": "Product OFBNT"}], "customerId": 48, "customerName": "Szymczak, Radosław"}',),
 ('{"addr": {"city": "Bergamo", "country": "Italy"}, "products": [{"totalMoney": 887.400000000, "productName": "Product GEEOO"}, {"totalMoney": 840.0000 ... (132 characters truncated) ...  "productName": "Product NUNAW"}, {"totalMoney": 570.000000000, "productName": "Product GMKIJ"}], "customerId": 49, "customerName": "Duerr, Bernard"}',),
 ('{"addr": {"city": "Bruxelles", "country": "Belgium"}, "products": [{"totalMoney": 2090.000000000, "productName": "Product UKXRI"}, {"totalMoney": 175 ... (137 characters truncated) ... 0, "productName": "Product OFBNT"}, {"totalMoney": 680.000000000, "productName": "Product WVJFP"}], "customerId": 50, "customerName": "Mace, Donald"}',),
 ('{"addr": {"city": "Montréal", "country": "Canada"}, "products": [{"totalMoney": 8263.360000000, "productName": "Product QDOMO"}, {"totalMoney": 2926. ... (140 characters truncated) ... productName": "Product BLCAX"}, {"totalMoney": 1750.000000000, "productName": "Product VAIIV"}], "customerId": 51, "customerName": "Taylor, Maurice"}',),
 ('{"addr": {"city": "Leipzig", "country": "Germany"}, "products": [{"totalMoney": 1458.800000000, "productName": "Product WUXYK"}, {"totalMoney": 1044. ... (141 characters truncated) ... ductName": "Product UKXRI"}, {"totalMoney": 349.000000000, "productName": "Product PAFRH"}], "customerId": 52, "customerName": "Dupont-Roc, Patrice"}',),
 ('{"addr": {"city": "Londo", "country": "UK"}, "products": [{"totalMoney": 220.000000000, "productName": "Product UKXRI"}, {"totalMoney": 144.000000000 ... (122 characters truncated) ... 0000, "productName": "Product COAXA"}, {"totalMoney": 42.000000000, "productName": "Product QSRXF"}], "customerId": 53, "customerName": "Mallit, Ke"}',),
 ('{"addr": {"city": "Buenos Aires", "country": "Argentina"}, "products": [{"totalMoney": 1215.000000000, "productName": "Product QHFFP"}, {"totalMoney" ... (138 characters truncated) ... 00, "productName": "Product PWCJB"}, {"totalMoney": 195.000000000, "productName": "Product LUNZZ"}], "customerId": 54, "customerName": "Tiano, Mike"}',),
 ('{"addr": {"city": "Anchorage", "country": "USA"}, "products": [{"totalMoney": 2227.500000000, "productName": "Product VJXY"}, {"totalMoney": 1875.875 ... (142 characters truncated) ... ctName": "Product VKCMF"}, {"totalMoney": 1125.000000000, "productName": "Product CKEDC"}], "customerId": 55, "customerName": "Egelund-Muller, Anja"}',),
 ('{"addr": {"city": "Köl", "country": "Germany"}, "products": [{"totalMoney": 1590.000000000, "productName": "Product HMLNI"}, {"totalMoney": 1379.9500 ... (136 characters truncated) ... roductName": "Product OVLQI"}, {"totalMoney": 760.000000000, "productName": "Product RECZE"}], "customerId": 56, "customerName": "Marinova, Nadejda"}',),
 ('{"addr": {"city": "Paris", "country": "France"}, "products": null, "customerId": 57, "customerName": "Tollevsen, Bjør"}',),
 ('{"addr": {"city": "México D.F.", "country": "Mexico"}, "products": [{"totalMoney": 1060.000000000, "productName": "Product APITJ"}, {"totalMoney": 65 ... (137 characters truncated) ... , "productName": "Product VJXY"}, {"totalMoney": 308.700000000, "productName": "Product YZIXQ"}], "customerId": 58, "customerName": "Fakhouri, Fadi"}',),
 ('{"addr": {"city": "Salzburg", "country": "Austria"}, "products": [{"totalMoney": 8432.000000000, "productName": "Product QDOMO"}, {"totalMoney": 2520 ... (138 characters truncated) ... , "productName": "Product CKEDC"}, {"totalMoney": 1150.000000000, "productName": "Product ZZZHR"}], "customerId": 59, "customerName": "Meston, Tosh"}',),
 ('{"addr": {"city": "Lisboa", "country": "Portugal"}, "products": [{"totalMoney": 1237.900000000, "productName": "Product VJXY"}, {"totalMoney": 1200.0 ... (133 characters truncated) ... 0, "productName": "Product APITJ"}, {"totalMoney": 285.120000000, "productName": "Product KSBRM"}], "customerId": 60, "customerName": "Uppal, Sunil"}',),

### 将上面生成的JSON对象导入一个关系表中，完成一系列查询

导入关系表：

In [54]:
%%sql
DROP TABLE IF EXISTS custInfo;
CREATE TABLE custInfo (
    id INT PRIMARY KEY,
    Info JSON
);

INSERT INTO custInfo(id, Info)
SELECT Customers.custid, JSON_OBJECT(
  'customerId', Customers.custid,
  'customerName', Customers.contactname,
  'addr', JSON_OBJECT(
            'country', Customers.country,
            'city', Customers.city
          ),
  'products', (
    SELECT JSON_ARRAYAGG(
      JSON_OBJECT(
        'productName', productname,
        'totalMoney', totalMoney
      )
    )
    FROM (
      SELECT Products.productname as productname, SUM(OrderDetails.unitprice * OrderDetails.qty * (1 - OrderDetails.discount)) as totalMoney
      FROM OrderDetails
      JOIN Products ON OrderDetails.productid = Products.productid
      WHERE OrderDetails.orderid IN (
        SELECT Orders.orderid
        FROM Orders
        WHERE Orders.custid = Customers.custid
      )
      GROUP BY productname
      ORDER BY totalMoney DESC
      LIMIT 5
    ) AS MostExpensiveProducts
  )
)
FROM Customers;

 * mysql://stu2100013117:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
91 rows affected.

[]

1. 指定一个country，返回位于该country的customer

In [55]:
%%sql
SELECT id, Info
FROM custInfo
WHERE JSON_EXTRACT(Info, '$.addr.country') = 'USA';

 * mysql://stu2100013117:***@162.105.146.37:43306
13 rows affected.

[(32, '{"addr": {"city": "Eugene", "country": "USA"}, "products": [{"totalMoney": 11264.625000000, "productName": "Product QDOMO"}, {"totalMoney": 1402.5000 ... (133 characters truncated) ... "productName": "Product HCQDE"}, {"totalMoney": 532.000000000, "productName": "Product VKCMF"}], "customerId": 32, "customerName": "Krishnan, Venky"}'),
 (36, '{"addr": {"city": "Elgi", "country": "USA"}, "products": [{"totalMoney": 1701.000000000, "productName": "Product QHFFP"}, {"totalMoney": 450.00000000 ... (126 characters truncated) ... 0, "productName": "Product PWCJB"}, {"totalMoney": 88.800000000, "productName": "Product QAQRL"}], "customerId": 36, "customerName": "Smith, Denise"}'),
 (43, '{"addr": {"city": "Walla Walla", "country": "USA"}, "products": [{"totalMoney": 210.000000000, "productName": "Product QMVU"}, {"totalMoney": 147.000000000, "productName": "Product YZIXQ"}], "customerId": 43, "customerName": "Deshpande, Anu"}'),
 (45, '{"addr": {"city": "San Francisco", "country": "USA"}, "products": [{"totalMoney": 758.100000000, "productName": "Product VKCMF"}, {"totalMoney": 562. ... (144 characters truncated) ... tName": "Product VJZZH"}, {"totalMoney": 239.970000000, "productName": "Product XYWBZ"}], "customerId": 45, "customerName": "Sunkammurali,  Krishna"}'),
 (48, '{"addr": {"city": "Portland", "country": "USA"}, "products": [{"totalMoney": 1060.000000000, "productName": "Product APITJ"}, {"totalMoney": 760.0000 ... (136 characters truncated) ... oductName": "Product WUXYK"}, {"totalMoney": 319.200000000, "productName": "Product OFBNT"}], "customerId": 48, "customerName": "Szymczak, Radosław"}'),
 (55, '{"addr": {"city": "Anchorage", "country": "USA"}, "products": [{"totalMoney": 2227.500000000, "productName": "Product VJXY"}, {"totalMoney": 1875.875 ... (142 characters truncated) ... ctName": "Product VKCMF"}, {"totalMoney": 1125.000000000, "productName": "Product CKEDC"}], "customerId": 55, "customerName": "Egelund-Muller, Anja"}'),
 (65, '{"addr": {"city": "Albuquerque", "country": "USA"}, "products": [{"totalMoney": 16864.000000000, "productName": "Product QDOMO"}, {"totalMoney": 7884 ... (140 characters truncated) ... "productName": "Product UKXRI"}, {"totalMoney": 2305.680000000, "productName": "Product BLCAX"}], "customerId": 65, "customerName": "Moore, Michael"}'),
 (71, '{"addr": {"city": "Boise", "country": "USA"}, "products": [{"totalMoney": 12046.590000000, "productName": "Product VJXY"}, {"totalMoney": 7392.450000 ... (133 characters truncated) ... "productName": "Product BKGEA"}, {"totalMoney": 4503.000000000, "productName": "Product VKCMF"}], "customerId": 71, "customerName": "Navarro, Tomás"}'),
 (75, '{"addr": {"city": "Lander", "country": "USA"}, "products": [{"totalMoney": 4005.200000000, "productName": "Product QDOMO"}, {"totalMoney": 1980.00000 ... (141 characters truncated) ... ame": "Product VKCMF"}, {"totalMoney": 576.000000000, "productName": "Product COAXA"}], "customerId": 75, "customerName": "Wojciechowska, Agnieszka"}'),
 (77, '{"addr": {"city": "Portland", "country": "USA"}, "products": [{"totalMoney": 2635.000000000, "productName": "Product QDOMO"}, {"totalMoney": 197.0000 ... (132 characters truncated) ...  "productName": "Product PAFRH"}, {"totalMoney": 95.000000000, "productName": "Product GMKIJ"}], "customerId": 77, "customerName": "Osorio, Cristia"}'),
 (78, '{"addr": {"city": "Butte", "country": "USA"}, "products": [{"totalMoney": 742.740000000, "productName": "Product VJXY"}, {"totalMoney": 456.000000000 ... (124 characters truncated) ... 00, "productName": "Product YHXGE"}, {"totalMoney": 184.000000000, "productName": "Product YZIXQ"}], "customerId": 78, "customerName": "Young, Robi"}'),
 (82, '{"addr": {"city": "Kirkland", "country": "USA"}, "products": [{"totalMoney": 640.900000000, "productName": "Product WUXYK"}, {"totalMoney": 234.00000 ... (132 characters truncated) ... "productName": "Product LSOFL"}, {"totalMoney": 155.000000000, "productName": "Product BWRLG"}], "customerId": 82, "customerName": "Veninga, Tjeerd"}'),
 (89, '{"addr": {"city": "Seattle", "country": "USA"}, "products": [{"totalMoney": 6587.500000000, "productName": "Product QDOMO"}, {"totalMoney": 2418.0000 ... (139 characters truncated) ... ductName": "Product WVJFP"}, {"totalMoney": 1650.000000000, "productName": "Product UKXRI"}], "customerId": 89, "customerName": "Smith Jr., Ronaldo"}')]

2. 计算每种product的总金额。

In [56]:
%%sql
SELECT productName, SUM(totalMoney) as totalMoney
FROM custInfo,
     JSON_TABLE(
         Info->'$.products',
         '$[*]'
         COLUMNS(
             productName VARCHAR(50) PATH '$.productName',
             totalMoney FLOAT PATH '$.totalMoney'
         )
     ) as jt
GROUP BY productName;

 * mysql://stu2100013117:***@162.105.146.37:43306
66 rows affected.

[('Product ICKNK', 6300.240051269531),
 ('Product UKXRI', 59873.0),
 ('Product OFBNT', 20811.279571533203),
 ('Product ACRVI', 503.5),
 ('Product MYMOI', 7348.699951171875),
 ('Product GEEOO', 9604.000137329102),
 ('Product WHBYK', 36316.07995605469),
 ('Product NUNAW', 4296.0),
 ('Product RJVNM', 70.0),
 ('Product PWCJB', 571.9499969482422),
 ('Product QMVU', 4435.199951171875),
 ('Product BKGEA', 12872.999877929688),
 ('Product HLGZA', 5967.594085693359),
 ('Product BLCAX', 22162.530151367188),
 ('Product QHFFP', 14507.099975585938),
 ('Product XWOXC', 1906.25),
 ('Product OVLQI', 2589.6000061035156),
 ('Product APITJ', 34193.47998046875),
 ('Product TOONT', 2482.5),
 ('Product QDOMO', 137391.53491210938),
 ('Product ZZZHR', 12728.200012207031),
 ('Product YZIXQ', 3564.500015258789),
 ('Product CKEDC', 21415.625),
 ('Product JYGFE', 1479.6000061035156),
 ('Product VJXY', 76457.35638427734),
 ('Product WUXYK', 31482.00994873047),
 ('Product VKCMF', 33001.86013031006),
 ('Product KSBRM', 707.5199890136719),
 ('Product BWRLG', 1147.6199951171875),
 ('Product VAIIV', 5062.5),
 ('Product HMLNI', 15015.0),
 ('Product YHXGE', 7235.4000244140625),
 ('Product CPHFY', 1482.6000061035156),
 ('Product XLXQF', 700.0),
 ('Product SWNJY', 844.2000122070312),
 ('Product VJZZH', 460.0),
 ('Product EVFFA', 20.799999237060547),
 ('Product COAXA', 11194.559967041016),
 ('Product EPEIM', 1407.5),
 ('Product VJIEO', 2453.8250122070312),
 ('Product FPYP', 2800.0),
 ('Product AOZBW', 5325.300048828125),
 ('Product RECZE', 1944.6500244140625),
 ('Product TTEEX', 289.1000061035156),
 ('Product HCQDE', 11905.162399291992),
 ('Product LYERX', 2014.0500183105469),
 ('Product LSOFL', 1656.0),
 ('Product XYWBZ', 3939.2750244140625),
 ('Product PAFRH', 3403.5999755859375),
 ('Product LUNZZ', 611.0),
 ('Product BKAZJ', 50.0),
 ('Product WVJFP', 6360.0),
 ('Product WEUJZ', 450.0),
 ('Product QAQRL', 88.80000305175781),
 ('Product XYZPE', 2721.75),
 ('Product SMIOH', 9218.0),
 ('Product GMKIJ', 3036.010009765625),
 ('Product JLUDZ', 162.0),
 ('Product LYLNI', 70.0),
 ('Product OSFNS', 2451.0),
 ('Product HHYDP', 1818.0),
 ('Product QSRXF', 168.0),
 ('Product NEVTJ', 1026.0),
 ('Product AQOKR', 190.0),
 ('Product YYWRT', 1080.0),
 ('Product XKXDO', 276.8399963378906)]

## 四.向量数据库实习设计

In [7]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

第一步：建立小说表 yttlj 和人物表 person

直接从CSV文件中读取数据：

In [8]:
import pandas as pd
import chardet

# 读取小说表
yttlj_df = pd.read_csv('./yttlj.csv', encoding='utf-8')

with open('./Person.csv', 'rb') as f:
    result = chardet.detect(f.read())
encoding2 = result['encoding']

person_df = pd.read_csv('./Person.csv', encoding=encoding2)

print(yttlj_df.head())
print(person_df.head())

   phaseId                                          phaseText
0        0  第一章　天涯思君不可忘\n\n    “春游浩荡，是年年寒食，梨花时节。白锦无纹香烂漫，玉树...
1        1  第二章　武当山顶松柏长\n\n    两人缓步上山，直走到寺门外，竟不见一个人影。何足道道：...
2        2  第三章　宝刀百炼生玄光\n\n    花开花落，花落花开。少年子弟江湖老，红颜少女的鬓边终于...
3        3  第四章　字作丧乱意彷徨\n\n    张翠山满怀伤痛恼怒，难以发泄，在床上躺了一个多时辰，悄...
4        4  第五章　皓臂似玉梅花妆\n\n    钱塘江到了六和塔下转一个大弯，然后直向东流。该处和府城...
   personId personName
0         0        张三丰
1         1        张翠山
2         2        殷素素
3         3        俞岱岩
4         4        俞莲舟

第二步：统计每个人物在多少段落中出现过

我们需要统计每个人物在多少段落中出现过，并将这个信息添加到 person 表中。

In [9]:
# 初始化一个词频列
person_df['word_count'] = 0

# 遍历每个人物
for index, person in person_df.iterrows():
    person_name = person['personName']
    count = yttlj_df['phaseText'].str.contains(person_name).sum()
    person_df.at[index, 'word_count'] = count

print(person_df)

    personId personName  word_count
0          0        张三丰          34
1          1        张翠山          23
2          2        殷素素          13
3          3        俞岱岩          20
4          4        俞莲舟          21
5          5        殷梨亭          24
6          6        纪晓芙          17
7          7        张无忌          32
8          8        周芷若          24
9          9         赵敏          18
10        10         殷离           9
11        11         小昭          12
12        12        黛绮丝           1
13        13         谢逊          32
14        14        朱长龄           6
15        15        朱九真           5
16        16         杨逍          26
17        17         范遥          12
18        18       灭绝师太          23
19        19        何足道          16
20        20        胡铁牛           0

第三步：建立共现表 coCurrence

我们可以使用位向量或者直接统计共现次数的方式来建立共现表。这里我们直接统计共现次数。

In [10]:
import itertools

# 初始化共现表
co_currence = []

# 遍历所有人物对
for (idx1, person1), (idx2, person2) in itertools.combinations(person_df.iterrows(), 2):
    person1_name = person1['personName']
    person2_name = person2['personName']
    
    # 统计共现次数
    count = yttlj_df['phaseText'].apply(lambda x: person1_name in x and person2_name in x).sum()
    
    if count > 0:
        co_currence.append({'personId1': person1['personId'], 'personId2': person2['personId'], 'counts': count})

co_currence_df = pd.DataFrame(co_currence)
print(co_currence_df)

     personId1  personId2  counts
0            0          1      22
1            0          2      12
2            0          3      20
3            0          4      20
4            0          5      22
..         ...        ...     ...
175         16         18      18
176         16         19      11
177         17         18       9
178         17         19       6
179         18         19       9

[180 rows x 3 columns]

第四步：通过矩阵分解，得到词向量表示

我们使用 sklearn 中的 TruncatedSVD 来进行矩阵分解。

In [34]:
from sklearn.decomposition import TruncatedSVD  
import numpy as np  
  
# 创建人物-段落矩阵  
person_phase_matrix = np.zeros((len(person_df), len(yttlj_df)))  
  
# 填充矩阵  
for i, person in person_df.iterrows():  
    person_name = person['personName']  
    for j, phase in yttlj_df.iterrows():  
        if person_name in phase['phaseText']:  
            person_phase_matrix[i, j] = 1  
  
# 获取特征数量，即矩阵的列数  
n_features = person_phase_matrix.shape[1]  
  
# 进行SVD分解，确保n_components不超过特征数量  
svd = TruncatedSVD(n_components=min(100, n_features))  
person_vectors = svd.fit_transform(person_phase_matrix)  
  
print(person_vectors)

[[ 5.27763953e+00  1.36324423e+00 -2.76994695e-01  4.24164445e-01
   3.81987453e-01 -1.10337629e+00  2.02929950e-01  1.09707147e+00
  -7.87072260e-01  4.12619737e-01 -3.11908145e-01  3.11924460e-01
  -4.43286989e-01 -3.00598174e-01  2.47358535e-02 -1.90108763e-01
  -2.77476027e-01 -2.40497801e-02 -1.78631892e-01 -7.69854802e-02
   6.59194921e-17]
 [ 3.65486940e+00  2.47307445e+00  1.65988182e-02  6.43829821e-01
  -3.45652008e-01  5.21210771e-01  1.09098039e+00 -1.30194649e-01
   3.17929541e-01 -2.08726367e-01 -8.93560890e-01  1.58436137e-01
   3.71765635e-01  3.16010836e-01  3.81115198e-01 -1.76092690e-01
   3.31219750e-01  9.77358673e-02 -7.45588330e-02 -7.32697994e-02
  -8.67361738e-17]
 [ 1.87075516e+00  1.99836375e+00 -3.40520577e-01  1.29326885e+00
  -1.18481595e+00  3.71146707e-01 -7.61697351e-01 -6.00928597e-01
  -5.63976091e-01  4.47789567e-01 -9.60198556e-02 -5.48732810e-01
   1.03274232e-01  1.37326393e-02 -4.76122027e-01  2.09155636e-02
  -1.83248963e-01  3.21892125e-01  1.75201028e-01 -2.63854018e-02
  -3.46944695e-17]
 [ 3.29895357e+00  1.88916373e+00 -1.33288866e+00 -1.34069472e+00
  -6.00615317e-01 -1.68320770e-01 -2.54011145e-01  5.75824301e-01
  -6.57415065e-02  2.09217020e-01  8.00502471e-01  2.28860235e-01
   1.11397321e-01  1.38410777e-02  2.02498101e-01  4.21481053e-01
   3.40218161e-01 -1.89132416e-02  3.10050516e-01  6.30888435e-02
  -3.12250226e-17]
 [ 3.70076365e+00  1.44239125e+00 -4.34254260e-01 -1.14178304e+00
   1.04420769e+00  3.60168914e-01 -1.47971301e-01 -8.61767988e-02
   1.30032037e+00 -3.50430651e-01  1.43762858e-01 -4.03829077e-01
  -5.24330212e-01 -1.13455782e-01 -2.19717687e-01  3.12709417e-02
  -1.51358628e-01  2.92172613e-01 -1.68432638e-01 -1.05474992e-01
   5.20417043e-17]
 [ 4.29596565e+00  8.11385540e-01 -7.78231537e-02 -1.67241191e+00
   3.73785534e-01  7.96205390e-01 -9.53017702e-02 -6.63790833e-01
  -2.67222285e-01  7.89346771e-02 -3.00772621e-01  1.76406244e-01
   4.27107227e-01 -2.72196340e-01 -1.74956157e-01 -2.77614579e-01
  -2.67687410e-01 -4.00190567e-01  2.59974954e-02  2.53096161e-01
   1.07552856e-16]
 [ 2.92269807e+00  5.82413627e-02  2.41063676e+00 -6.74343479e-01
  -3.04743401e-01 -5.09509677e-01 -5.26413349e-01  4.21861254e-01
  -1.16174168e-01 -8.04388109e-01 -1.29449627e-01  3.97420649e-01
   5.42501091e-01 -9.47508577e-02 -3.47433769e-01  2.28056426e-01
   5.65600105e-02  2.52940798e-01 -3.97184647e-02 -3.14774887e-02
  -3.12250226e-17]
 [ 5.36446256e+00 -8.74801191e-01  7.39893208e-01  4.20982750e-01
  -2.86372225e-01 -3.19327648e-01 -4.14238490e-01  4.23778955e-02
   4.22100197e-01  3.39126940e-01  3.19969293e-01 -7.75810592e-02
  -3.40007513e-01  2.17161976e-01 -4.04808101e-01 -5.36115387e-01
   5.45976148e-01 -2.38156460e-01  6.55842350e-02  2.21135203e-02
  -8.67361738e-17]
 [ 4.24846599e+00 -1.38401696e+00 -1.23405747e-01 -1.05956657e-01
  -9.17025318e-01  5.76424060e-01 -6.99770132e-01 -1.02088208e+00
  -1.72870338e-01  1.32177982e-01  2.25182198e-02  8.94227300e-01
  -4.94188264e-01 -4.20011813e-02  3.26736751e-01  1.40504973e-01
  -5.54515640e-03  1.30554131e-01 -2.27333406e-01 -1.21467616e-01
   8.67361738e-17]
 [ 3.24380192e+00 -1.91392761e+00 -1.34274449e+00 -6.43072366e-01
  -2.44964516e-01 -3.27763174e-01  8.56699105e-02  3.90435921e-01
   1.38075044e-01  2.81941650e-01 -8.35932906e-02  4.33972109e-02
   4.88217725e-01  8.58155329e-01 -2.32663027e-01  1.35163687e-02
  -2.90316296e-01  1.14320037e-01 -1.92414401e-01  2.17313526e-03
   2.42861287e-17]
 [ 1.66983221e+00 -1.40425397e+00 -8.35148822e-01 -9.85397590e-02
  -5.78538598e-01  1.19421608e-02  1.34646110e+00 -1.08539497e-01
  -1.77737194e-01 -8.30946406e-01  2.01781251e-01  3.16468972e-01
  -2.25893317e-01 -1.83681047e-01 -2.31261140e-01 -3.02536199e-01
  -1.32818779e-01  2.46695061e-01  4.48827703e-01 -1.75209615e-02
   1.04083409e-17]
 [ 2.18331457e+00 -1.11206986e+00 -6.80271098e-02 -7.32400465e-02
  -7.98468370e-01  1.79451357e+00  1.59109561e-01  1.04980384e+00
  -5.56047533e-01 -3.77116178e-01  2.41358178e-01 -5.96067930e-01
  -2.19334235e-04 -1.87791327e-01  4.58572336e-04  2.64427160e-02
   8.30913053e-02 -1.25283983e-01 -2.53699306e-01 -1.15441911e-01
  -3.12250226e-17]
 [ 1.71208971e-01 -2.77400174e-01 -1.52005863e-01  1.81349966e-01
   5.69083447e-02 -2.15459489e-02  9.07042330e-02  8.97598868e-02
  -3.16785391e-01 -1.32816976e-01  7.44600750e-02 -1.34077805e-01
  -2.25401583e-01 -2.79870010e-02  1.12022192e-01 -6.64105935e-02
   2.01693797e-01  4.30395152e-01 -2.73827275e-01  5.53887559e-01
   7.39557099e-32]
 [ 5.07357411e+00  1.68916686e-01  2.09149421e-03  1.94236487e+00
  -5.04574946e-01 -6.15193159e-01  2.83426740e-01 -3.38985466e-01
   5.67085056e-01 -6.21874794e-01  7.28343084e-01 -1.87714975e-01
   2.15972407e-01 -8.46669933e-02  1.69867673e-01  2.43617952e-01
  -2.80665471e-01 -3.21102471e-01 -1.28972975e-01  1.21083945e-01
  -3.12250226e-17]
 [ 1.01384069e+00 -1.18690194e-01  1.12972533e+00  2.53587038e-01
   7.78108133e-02  6.25159473e-01  1.31928973e+00  5.79078361e-02
   1.53424322e-01  7.52175260e-01 -1.97085454e-01  2.34231301e-01
  -4.34165621e-01  1.25988299e-01 -4.38953903e-01  6.06283795e-01
  -3.25319764e-02 -1.09312731e-01  5.76000510e-02  1.12800717e-01
  -2.77555756e-17]
 [ 7.46460739e-01 -3.48225509e-01  8.97192065e-01  1.01243151e-01
   3.13418840e-01  3.22514775e-01  6.49994132e-01 -5.57732592e-03
   2.99395445e-01  1.05964716e+00  9.72496329e-01  1.21229344e-01
   6.12255090e-01 -3.21999431e-01  1.94035199e-01 -2.72257015e-01
  -8.93398071e-02  3.18483675e-01 -5.67762279e-02 -7.53332414e-02
   6.93889390e-18]
 [ 4.44920850e+00 -1.83219945e+00  5.77264552e-01  2.96237039e-01
   8.59697670e-02  2.38973599e-01 -6.66492056e-01  5.50517249e-01
   5.56277285e-01  3.06244079e-01 -7.51644621e-01 -3.56841341e-01
  -2.65494668e-02 -1.05427048e-01  5.03340979e-01  7.59222476e-02
  -1.77069333e-01  9.63760830e-02  4.44396467e-01  1.01077498e-01
  -3.12250226e-17]
 [ 2.17464035e+00 -1.74287411e+00 -1.41075463e+00  8.09069142e-02
   2.45825648e-01 -7.04007091e-01  2.83890195e-01 -4.23012760e-01
   8.29894633e-02  2.39161641e-01 -6.01711062e-01 -2.72819839e-01
   4.17943402e-01 -6.55468762e-01 -2.48405791e-01  2.84662086e-01
   3.85250686e-01  3.22164210e-02 -1.35119935e-01 -7.50016209e-02
  -3.46944695e-18]
 [ 4.10607695e+00 -3.99964200e-01  9.60062784e-01 -9.82862631e-01
   8.33876325e-01 -5.84224585e-01  5.48486100e-01 -8.41912637e-01
  -1.04245103e+00 -7.35056306e-02  2.54783219e-01 -8.05952559e-01
  -1.63032342e-01  3.02199339e-01  2.99455129e-01  1.16742671e-01
   5.93231113e-02  3.46984306e-02  5.43526478e-02 -1.03122992e-01
   1.07552856e-16]
 [ 2.34828329e+00 -2.08233245e-01 -6.20536001e-01  1.58343179e+00
   2.42658264e+00  8.60764076e-01 -4.93470423e-01  6.72950059e-02
  -4.70484810e-01 -2.87406829e-01  2.37085333e-01  4.29356366e-01
   1.96840335e-01  1.59007018e-01 -1.30727371e-01  1.01382761e-01
   1.24120772e-01  5.51464034e-02  1.33562263e-01 -2.06196387e-02
   2.42861287e-17]
 [ 0.00000000e+00  0.00000000e+00  0.00000000e+00  0.00000000e+00
   0.00000000e+00  0.00000000e+00  0.00000000e+00  0.00000000e+00
   0.00000000e+00  0.00000000e+00  0.00000000e+00  0.00000000e+00
   0.00000000e+00  0.00000000e+00  0.00000000e+00  0.00000000e+00
   0.00000000e+00  0.00000000e+00  0.00000000e+00  0.00000000e+00
   0.00000000e+00]]

第五步：将词向量存入 pgvector，计算人物之间的相似度

我们可以将词向量存入数据库并计算相似度。

In [35]:
from sklearn.metrics.pairwise import cosine_similarity  
  
# 将词向量转换为列表并存入person DataFrame  
person_df['vector'] = person_vectors.tolist()  
  
# 计算所有人物之间的余弦相似度  
similarity_matrix = cosine_similarity(person_vectors)  
  
# 找到每个人物最相似的人物  
most_similar_person_ids = []  
for i in range(len(similarity_matrix)):  
    # 排除自己与自己的相似度（对角线上的1），找到最大相似度对应的人物ID  
    similarities = similarity_matrix[i][:-1]  # Exclude the last element (self-similarity)  
    max_similarity_index = np.argmax(similarities)  
    if max_similarity_index >= i:  # Adjust index for the excluded self-similarity  
        max_similarity_index += 1  
    most_similar_person_ids.append(person_df.iloc[max_similarity_index]['personId'])  
  
# 将最相似人物的ID添加到person DataFrame中  
person_df['most_similar_personId'] = most_similar_person_ids  
  
print(person_df[['personId', 'personName', 'most_similar_personId']])

    personId personName  most_similar_personId
0          0        张三丰                      1
1          1        张翠山                      2
2          2        殷素素                      3
3          3        俞岱岩                      4
4          4        俞莲舟                      5
5          5        殷梨亭                      6
6          6        纪晓芙                      7
7          7        张无忌                      8
8          8        周芷若                      9
9          9         赵敏                     10
10        10         殷离                     11
11        11         小昭                     12
12        12        黛绮丝                     13
13        13         谢逊                     14
14        14        朱长龄                     15
15        15        朱九真                     16
16        16         杨逍                     17
17        17         范遥                     18
18        18       灭绝师太                     19
19        19        何足道                     20
20        20        胡铁牛                      0